(window["webpackJsonp"] = window["webpackJsonp"] || []).push([["chunk-6fc07222"], {
  "013d": function(t, e, i) {},
  "0773": function(t, e, i) {
    "use strict";
    var s = i("e15f")
      , a = i.n(s);
    a.a
  },
  "0948": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/notice.ed4f11c1.svg"
  },
  "095e": function(t, e, i) {},
  "0de4": function(t, e, i) {
    "use strict";
    i.r(e);
    i("1276"),
      i("ddb0");
    var s = i("5530")
      , a = i("750b")
      , n = i("3613")
      , r = i.n(n)
      , o = i("3ccf")
      , c = i("c3fa")
      , d = i.n(c)
      , l = i("7a0b")
      , u = i.n(l)
      , m = i("4e72")
      , h = [{
      name: "北京市",
      city: [{
        name: "北京市",
        districtAndCounty: ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县", "延庆镇"]
      }]
    }, {
      name: "天津市",
      city: [{
        name: "天津市",
        districtAndCounty: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "蓟县", "宁河县", "芦台镇", "静海县", "静海镇"]
      }]
    }, {
      name: "上海市",
      city: [{
        name: "上海市",
        districtAndCounty: ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区?", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县", "城桥镇"]
      }]
    }, {
      name: "重庆市",
      city: [{
        name: "重庆市",
        districtAndCounty: ["渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "万州区", "涪陵区", "黔江区", "长寿区", "合川市", "永川区市", "江津市", "南川市", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "垫江县", "武隆县", "丰都县", "城口县", "梁平县", "开县", "巫溪县", "巫山县", "奉节县", "云阳县", "忠县", "石柱土家族自治县", "彭水苗族土家族自治县", "酉阳土家族苗族自治县", "秀山土家族苗族自治县"]
      }]
    }, {
      name: "河北省",
      city: [{
        name: "石家庄市",
        districtAndCounty: ["长安区", "桥东区", "桥西区", "新华区", "裕华区", "井陉矿区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县", "微水镇", "正定县", "正定镇", "栾城县", "栾城镇", "行唐县", "龙州镇", "灵寿县", "灵寿镇", "高邑县", "高邑镇", "深泽县", "深泽镇", "赞皇县", "赞皇镇", "无极县", "无极镇", "平山县", "平山镇", "元氏县", "槐阳镇", "赵县", "赵州镇"]
      }, {
        name: "张家口市",
        districtAndCounty: ["桥西区", "桥东区", "宣化区", "下花园区", "宣化县", "张家口市宣化区", "张北县", "张北镇", "康保县", "康保镇", "沽源县", "平定堡镇", "尚义县", "南壕堑镇", "蔚县", "蔚州镇", "阳原县", "西城镇", "怀安县", "柴沟堡镇", "万全县", "孔家庄镇", "怀来县", "沙城镇", "涿鹿县", "涿鹿镇", "赤城县", "赤城镇", "崇礼县", "西湾子镇"]
      }, {
        name: "承德市",
        districtAndCounty: ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "下板城镇", "兴隆县", "兴隆镇", "平泉县", "平泉镇", "滦平县", "滦平镇", "隆化县", "隆化镇", "丰宁满族自治县", "大阁镇", "宽城满族自治县", "宽城镇", "围场满族蒙古族自治县", "围场镇"]
      }, {
        name: "秦皇岛市",
        districtAndCounty: ["海港区", "山海关区", "北戴河区", "昌黎县", "昌黎镇", "抚宁县", "抚宁镇", "卢龙县", "卢龙镇", "青龙满族自治县", "青龙镇"]
      }, {
        name: "唐山市",
        districtAndCounty: ["路北区", "路南区", "古冶区", "开平区", "丰润区", "丰南区", "遵化市", "迁安市", "滦县", "滦州镇", "滦南县", "倴城镇", "乐亭县", "乐亭镇", "迁西县", "兴城镇", "玉田县", "玉田镇", "唐海县", "唐海镇"]
      }, {
        name: "廊坊市",
        districtAndCounty: ["安次区", "广阳区", "霸州市", "三河市", "固安县", "固安镇", "永清县", "永清镇", "香河县", "淑阳镇", "大城县", "平舒镇", "文安县", "文安镇", "大厂回族自治县", "大厂镇"]
      }, {
        name: "保定市",
        districtAndCounty: ["新市区", "北市区", "南市区", "定州市", "涿州市", "安国市", "高碑店市", "满城县", "满城镇", "清苑县", "清苑镇", "易县", "易州镇", "徐水县", "安肃镇", "涞源县", "涞源镇", "定兴县", "定兴镇", "顺平县", "蒲阳镇", "唐县", "仁厚镇", "望都县", "望都镇", "涞水县", "涞水镇", "高阳县", "高阳镇", "安新县", "安新镇", "雄县", "雄州镇", "容城县", "容城镇", "曲阳县", "恒州镇", "阜平县", "阜平镇", "博野县", "博陵镇", "蠡县", "蠡吾镇"]
      }, {
        name: "衡水市",
        districtAndCounty: ["桃城区", "冀州市", "深州市", "枣强县", "枣强镇", "武邑县", "武邑镇", "武强县", "武强镇", "饶阳县", "饶阳镇", "安平县", "安平镇", "故城县", "郑口镇", "景县", "景州镇", "阜城县", "阜城镇"]
      }, {
        name: "沧州市",
        districtAndCounty: ["运河区", "新华区", "泊头市", "任丘市", "黄骅市", "河间市", "沧县", "沧州市新华区", "青县", "清州镇", "东光县", "东光镇", "海兴县", "苏基镇", "盐山县", "盐山镇", "肃宁县", "肃宁镇", "南皮县", "南皮镇", "吴桥县", "桑园镇", "献县", "乐寿镇", "孟村回族自治县", "孟村镇"]
      }, {
        name: "邢台市",
        districtAndCounty: ["桥东区", "桥西区", "南宫市", "沙河市", "邢台县", "邢台市桥东区", "临城县", "临城镇", "内丘县", "内丘镇", "柏乡县", "柏乡镇", "隆尧县", "隆尧镇", "任县", "任城镇", "南和县", "和阳镇", "宁晋县", "凤凰镇", "巨鹿县", "巨鹿镇", "新河县", "新河镇", "广宗县", "广宗镇", "平乡县", "丰州镇", "威县", "洺州镇", "清河县", "葛仙庄镇", "临西县", "临西镇"]
      }, {
        name: "邯郸市",
        districtAndCounty: ["丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "南堡乡东小屯村", "临漳县", "临漳镇", "成安县", "成安镇", "大名县", "大名镇", "涉县", "涉城镇", "磁县", "磁州镇", "肥乡县", "肥乡镇", "永年县", "临洺关镇", "邱县", "新马头镇", "鸡泽县", "鸡泽镇", "广平县", "广平镇", "馆陶县", "馆陶镇", "魏县", "魏城镇", "曲周县", "曲周镇"]
      }]
    }, {
      name: "山西省",
      city: [{
        name: "太原市",
        districtAndCounty: ["杏花岭区", "小店区", "迎泽区", "尖草坪区", "万柏林区", "晋源区", "古交市", "清徐县", "清源镇", "阳曲县", "黄寨镇", "娄烦县", "娄烦镇"]
      }, {
        name: "朔州市",
        districtAndCounty: ["朔城区", "平鲁区", "山阴县", "岱岳乡", "应县", "金城镇", "右玉县", "新城镇", "怀仁县", "云中镇"]
      }, {
        name: "大同市",
        districtAndCounty: ["城区", "矿区", "南郊区", "新荣区", "阳高县", "龙泉镇", "天镇县", "玉泉镇", "广灵县", "壶泉镇", "灵丘县", "武灵镇", "浑源县", "永安镇", "左云县", "云兴镇", "大同县", "西坪镇"]
      }, {
        name: "阳泉市",
        districtAndCounty: ["城区", "矿区", "郊区", "平定县", "冠山镇", "盂县", "秀水镇"]
      }, {
        name: "长治市",
        districtAndCounty: ["城区", "郊区", "潞城市", "长治县", "韩店镇", "襄垣县", "古韩镇", "屯留县", "麟绛镇", "平顺县", "青羊镇", "黎城县", "黎侯镇", "壶关县", "龙泉镇", "长子县", "丹朱镇", "武乡县", "丰州镇", "沁县", "定昌镇", "沁源县", "沁河镇"]
      }, {
        name: "晋城市",
        districtAndCounty: ["城区", "高平市", "泽州县", "南村镇", "沁水县", "龙港镇", "阳城县", "凤城镇", "陵川县", "崇文镇"]
      }, {
        name: "忻州市",
        districtAndCounty: ["忻府区", "原平市", "定襄县", "晋昌镇", "五台县", "台城镇", "代县", "上馆镇", "繁峙县", "繁城镇", "宁武县", "凤凰镇", "静乐县", "鹅城镇", "神池县", "龙泉镇", "五寨县", "砚城镇", "岢岚县", "岚漪镇", "河曲县", "文笔镇", "保德县", "东关镇", "偏关县", "新关镇"]
      }, {
        name: "晋中市",
        districtAndCounty: ["榆次区", "介休市", "榆社县", "箕城镇", "左权县", "辽阳镇", "和顺县", "义兴镇", "昔阳县", "乐平镇", "寿阳县", "朝阳镇", "太谷县", "明星镇", "祁县", "昭余镇", "平遥县", "古陶镇", "灵石县", "翠峰镇"]
      }, {
        name: "临汾市",
        districtAndCounty: ["尧都区", "侯马市", "霍州市", "曲沃县", "乐昌镇", "翼城县", "唐兴镇", "襄汾县", "新城镇", "洪洞县", "大槐树镇", "古县", "岳阳镇", "安泽县", "府城镇", "浮山县", "天坛镇", "吉县", "吉昌镇", "乡宁县", "昌宁镇", "蒲县", "蒲城镇", "大宁县", "昕水镇", "永和县", "芝河镇", "隰县", "龙泉镇", "汾西县", "永安镇"]
      }, {
        name: "吕梁市",
        districtAndCounty: ["离石区", "孝义市", "汾阳市", "文水县", "凤城镇", "中阳县", "宁乡镇", "兴县", "蔚汾镇", "临县", "临泉镇", "方山县", "圪洞镇", "柳林县", "柳林镇", "岚县", "东村镇", "交口县", "水头镇", "交城县", "天宁镇", "石楼县", "灵泉镇"]
      }, {
        name: "运城市",
        districtAndCounty: ["盐湖区", "永济市", "河津市", "芮城县", "古魏镇", "临猗县", "猗氏镇", "万荣县", "解店镇", "新绛县", "龙兴镇", "稷山县", "稷峰镇", "闻喜县", "桐城镇", "夏县", "瑶峰镇", "绛县", "古绛镇", "平陆县", "圣人涧镇", "垣曲县", "新城镇"]
      }]
    }, {
      name: "内蒙古",
      city: [{
        name: "呼和浩特市",
        districtAndCounty: ["回民区", "新城区", "玉泉区", "赛罕区", "托克托县", "双河镇", "武川县", "可可以力更镇", "和林格尔县", "城关镇", "清水河县", "城关镇", "土默特左旗", "察素齐镇"]
      }, {
        name: "包头市",
        districtAndCounty: ["昆都仑区", "东河区", "青山区", "石拐区", "白云矿区", "九原区", "固阳县", "金山镇", "土默特右旗", "萨拉齐镇", "达尔罕茂明安联合旗", "百灵庙镇"]
      }, {
        name: "乌海市",
        districtAndCounty: ["海勃湾区", "海南区", "乌达区"]
      }, {
        name: "赤峰市",
        districtAndCounty: ["红山区", "元宝山区", "松山区", "宁城县", "天义镇", "林西县", "林西镇", "阿鲁科尔沁旗", "天山镇", "巴林左旗", "林东镇", "巴林右旗", "大板镇", "克什克腾旗", "经棚镇", "翁牛特旗", "乌丹镇", "喀喇沁旗", "锦山镇", "敖汉旗", "新惠镇"]
      }, {
        name: "通辽市",
        districtAndCounty: ["科尔沁区", "霍林郭勒市", "开鲁县", "开鲁镇", "库伦旗", "库伦镇", "奈曼旗", "大沁他拉镇", "扎鲁特旗", "鲁北镇", "科尔沁左翼中旗", "保康镇", "科尔沁左翼后旗", "甘旗卡镇"]
      }, {
        name: "呼伦贝尔市",
        districtAndCounty: ["海拉尔区", "满洲里市", "扎兰屯市", "牙克石市", "根河市", "额尔古纳市", "阿荣旗", "那吉镇", "新巴尔虎右旗", "阿拉坦额莫勒镇", "新巴尔虎左旗", "阿穆古郎镇", "陈巴尔虎旗", "巴彦库仁镇", "鄂伦春自治旗", "阿里河镇", "鄂温克族自治旗", "巴彦托海镇", "莫力达瓦达斡尔族自治旗", "尼尔基镇"]
      }, {
        name: "鄂尔多斯市",
        districtAndCounty: ["东胜区", "达拉特旗", "树林召镇", "准格尔旗", "薛家湾镇", "鄂托克前旗", "敖勒召其镇", "鄂托克旗", "乌兰镇", "杭锦旗", "锡尼镇", "乌审旗", "嘎鲁图镇", "伊金霍洛旗", "阿勒腾席热镇"]
      }, {
        name: "乌兰察布市",
        districtAndCounty: ["集宁区", "丰镇市", "卓资县", "卓资山镇", "化德县", "长顺镇", "商都县", "商都镇", "兴和县", "城关镇", "凉城县", "岱海镇", "察哈尔右翼前旗", "土贵乌拉镇", "察哈尔右翼中旗", "科布尔镇", "察哈尔右翼后旗", "白音察干镇", "四子王旗", "乌兰花镇"]
      }, {
        name: "巴彦淖尔市",
        districtAndCounty: ["临河区", "五原县", "隆兴昌镇", "磴口县", "巴彦高勒镇", "乌拉特前旗", "乌拉山镇", "乌拉特中旗", "海流图镇", "乌拉特后旗", "巴音宝力格镇", "杭锦后旗", "陕坝镇"]
      }, {
        name: "兴安盟",
        districtAndCounty: ["乌兰浩特市", "阿尔山市", "突泉县", "突泉镇", "科尔沁右翼前旗", "大坝沟镇", "科尔沁右翼中旗", "巴彦呼硕镇", "扎赉特旗", "音德尔镇"]
      }, {
        name: "锡林郭勒盟",
        districtAndCounty: ["锡林浩特市", "二连浩特市", "多伦县", "多伦淖尔镇", "阿巴嘎旗", "别力古台镇", "苏尼特左旗", "满都拉图镇", "苏尼特右旗", "赛汉塔拉镇", "东乌珠穆沁旗", "乌里雅斯太镇", "西乌珠穆沁旗", "巴拉嘎尔郭勒镇", "太仆寺旗", "宝昌镇", "镶黄旗", "新宝拉格镇", "正镶白旗", "明安图镇", "正蓝旗", "上都镇"]
      }, {
        name: "阿拉善盟",
        districtAndCounty: ["巴彦浩特镇", "阿拉善右旗", "额肯呼都格镇", "额济纳旗", "达来呼布镇"]
      }]
    }, {
      name: "辽宁省",
      city: [{
        name: "沈阳市",
        districtAndCounty: ["沈河区", "和平区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "新城子区", "于洪区", "新民市", "辽中县", "辽中镇", "康平县", "康平镇", "法库县", "法库镇"]
      }, {
        name: "朝阳市",
        districtAndCounty: ["双塔区", "龙城区", "北票市", "凌源市", "朝阳县", "朝阳市双塔区", "建平县", "喀喇沁左翼蒙古族自治县", "大城子镇"]
      }, {
        name: "阜新市",
        districtAndCounty: ["海州区", "新邱区", "太平区", "清河门区", "细河区", "彰武县", "彰武镇", "阜新蒙古族自治县", "阜新镇"]
      }, {
        name: "铁岭市",
        districtAndCounty: ["银州区", "清河区", "调兵山市", "开原市", "铁岭县", "铁岭市银州区", "西丰县", "西丰镇", "昌图县", "昌图镇"]
      }, {
        name: "抚顺市",
        districtAndCounty: ["顺城区", "新抚区", "东洲区", "望花区", "抚顺县", "抚顺市顺城区", "新宾满族自治县", "新宾镇", "清原满族自治县", "清原镇"]
      }, {
        name: "本溪市",
        districtAndCounty: ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "小市镇", "桓仁满族自治县", "桓仁镇"]
      }, {
        name: "辽阳市",
        districtAndCounty: ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "灯塔市", "辽阳县", "首山镇"]
      }, {
        name: "鞍山市",
        districtAndCounty: ["铁东区", "铁西区", "立山区", "千山区", "海城市", "台安县", "台安镇", "岫岩满族自治县", "岫岩镇"]
      }, {
        name: "丹东市",
        districtAndCounty: ["振兴区", "元宝区", "振安区", "凤城市", "东港市", "宽甸满族自治县", "宽甸镇"]
      }, {
        name: "大连市",
        districtAndCounty: ["西岗区", "中山区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "瓦房店市", "普兰店市", "庄河市", "长海县", "大长山岛镇"]
      }, {
        name: "营口市",
        districtAndCounty: ["站前区", "西市区", "鲅鱼圈区", "老边区", "大石桥市", "盖州市"]
      }, {
        name: "盘锦市",
        districtAndCounty: ["兴隆台区", "双台子区", "大洼县", "大洼镇", "盘山县", "盘锦市双台子区"]
      }, {
        name: "锦州市",
        districtAndCounty: ["太和区", "古塔区", "凌河区", "凌海市", "北宁市", "黑山县", "黑山镇", "义县", "义州镇"]
      }, {
        name: "葫芦岛市",
        districtAndCounty: ["龙港区", "连山区", "南票区", "兴城市", "绥中县", "绥中镇", "建昌县", "建昌镇"]
      }]
    }, {
      name: "吉林省",
      city: [{
        name: "长春市",
        districtAndCounty: ["朝阳区", "南关区", "宽城区", "二道区", "绿园区", "双阳区", "德惠市", "九台市", "榆树市", "农安县", "农安镇"]
      }, {
        name: "白城市",
        districtAndCounty: ["洮北区", "大安市", "洮南市", "镇赉县", "镇赉镇", "通榆县", "开通镇"]
      }, {
        name: "松原市",
        districtAndCounty: ["宁江区", "扶余县", "三岔河镇", "长岭县", "长岭镇", "乾安县", "乾安镇", "前郭尔罗斯蒙古族自治县", "前郭镇"]
      }, {
        name: "吉林市",
        districtAndCounty: ["船营区", "龙潭区", "昌邑区", "丰满区", "磐石市", "蛟河市", "桦甸市", "舒兰市", "永吉县", "口前镇"]
      }, {
        name: "四平市",
        districtAndCounty: ["铁西区", "铁东区", "双辽市", "公主岭市", "梨树县", "梨树镇", "伊通满族自治县", "伊通镇"]
      }, {
        name: "辽源市",
        districtAndCounty: ["龙山区", "西安区", "东丰县", "东丰镇", "东辽县", "白泉镇"]
      }, {
        name: "通化市",
        districtAndCounty: ["东昌区", "二道江区", "梅河口市", "集安市", "通化县", "快大茂镇", "辉南县", "朝阳镇", "柳河县", "柳河镇"]
      }, {
        name: "白山市",
        districtAndCounty: ["八道江区", "临江市", "江源县", "孙家堡子镇", "抚松县", "抚松镇", "靖宇县", "靖宇镇", "长白朝鲜族自治县", "长白镇"]
      }, {
        name: "延边州",
        districtAndCounty: ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "汪清镇", "安图县", "明月镇"]
      }]
    }, {
      name: "黑龙江省",
      city: [{
        name: "哈尔滨市",
        districtAndCounty: ["松北区", "道里区", "南岗区", "道外区", "香坊区", "动力区", "平房区", "呼兰区", "双城市", "尚志市", "五常市", "阿城市", "依兰县", "依兰镇", "方正县", "方正镇", "宾县", "宾州镇", "巴彦县", "巴彦镇", "木兰县", "木兰镇", "通河县", "通河镇", "延寿县", "延寿镇"]
      }, {
        name: "齐齐哈尔市",
        districtAndCounty: ["建华区", "龙沙区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "讷河市", "龙江县", "龙江镇", "依安县", "依安镇", "泰来县", "泰来镇", "甘南县", "甘南镇", "富裕县", "富裕镇", "克山县", "克山镇", "克东县", "克东镇", "拜泉县", "拜泉镇"]
      }, {
        name: "七台河市",
        districtAndCounty: ["桃山区", "新兴区", "茄子河区", "勃利县", "勃利镇"]
      }, {
        name: "黑河市",
        districtAndCounty: ["爱辉区", "北安市", "五大连池市", "嫩江县", "嫩江镇", "逊克县", "边疆镇", "孙吴县", "孙吴镇"]
      }, {
        name: "大庆市",
        districtAndCounty: ["萨尔图区", "龙凤区", "让胡路区", "大同区", "红岗区", "肇州县", "肇州镇", "肇源县", "肇源镇", "林甸县", "林甸镇", "杜尔伯特蒙古族自治县", "泰康镇"]
      }, {
        name: "鹤岗市",
        districtAndCounty: ["兴山区", "向阳区", "工农区", "南山区", "兴安区", "东山区", "萝北县", "凤翔镇", "绥滨县", "绥滨镇"]
      }, {
        name: "伊春市",
        districtAndCounty: ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "铁力市", "嘉荫县", "朝阳镇"]
      }, {
        name: "佳木斯市",
        districtAndCounty: ["前进区", "永红区", "向阳区", "东风区", "郊区", "同江市", "富锦市", "桦南县", "桦南镇", "桦川县", "悦来镇", "汤原县", "汤原镇", "抚远县", "抚远镇"]
      }, {
        name: "双鸭山市",
        districtAndCounty: ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "福利镇", "友谊县", "友谊镇", "宝清县", "宝清镇", "饶河县", "饶河镇"]
      }, {
        name: "鸡西市",
        districtAndCounty: ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "虎林市", "密山市", "鸡东县", "鸡东镇"]
      }, {
        name: "牡丹江市",
        districtAndCounty: ["爱民区", "东安区", "阳明区", "西安区", "穆棱市", "绥芬河市", "海林市", "宁安市", "东宁县", "东宁镇", "林口县", "林口镇"]
      }, {
        name: "绥化市",
        districtAndCounty: ["北林区", "安达市", "肇东市", "海伦市", "望奎县", "望奎镇", "兰西县", "兰西镇", "青冈县", "青冈镇", "庆安县", "庆安镇", "明水县", "明水镇", "绥棱县", "绥棱镇"]
      }, {
        name: "大兴安岭地区",
        districtAndCounty: ["呼玛县", "呼玛镇", "塔河县", "塔河镇", "漠河县", "西林吉镇"]
      }]
    }, {
      name: "江苏省",
      city: [{
        name: "南京市",
        districtAndCounty: ["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "六合区", "栖霞区", "雨花台区", "江宁区", "溧水县", "永阳镇", "高淳县", "淳溪镇"]
      }, {
        name: "徐州市",
        districtAndCounty: ["云龙区", "鼓楼区", "九里区", "贾汪区", "泉山区", "邳州市", "新沂市", "铜山县", "铜山镇", "睢宁县", "睢城镇", "沛县", "沛城镇", "丰县", "凤城镇"]
      }, {
        name: "连云港市",
        districtAndCounty: ["新浦区", "连云区", "海州区", "赣榆县", "青口镇", "灌云县", "伊山镇", "东海县", "牛山镇", "灌南县", "新安镇"]
      }, {
        name: "宿迁市",
        districtAndCounty: ["宿城区", "宿豫区", "沭阳县", "沭城镇", "泗阳县", "众兴镇", "泗洪县", "青阳镇"]
      }, {
        name: "淮安市",
        districtAndCounty: ["清河区", "清浦区", "楚州区", "淮阴区", "金湖县", "黎城镇", "盱眙县", "盱城镇", "洪泽县", "高良涧镇", "涟水县", "涟城镇"]
      }, {
        name: "盐城市",
        districtAndCounty: ["亭湖区", "盐都区", "东台市", "大丰市", "射阳县", "合德镇", "阜宁县", "阜城镇", "滨海县", "东坎镇", "响水县", "响水镇", "建湖县", "近湖镇"]
      }, {
        name: "扬州市",
        districtAndCounty: ["维扬区", "广陵区", "邗江区", "仪征市", "江都市", "高邮市", "宝应县", "安宜镇"]
      }, {
        name: "泰州市",
        districtAndCounty: ["海陵区", "高港区", "靖江市", "泰兴市", "姜堰市", "兴化市"]
      }, {
        name: "南通市",
        districtAndCounty: ["崇川区", "港闸区", "海门市", "启东市", "通州市", "如皋市", "如东县", "掘港镇", "海安县", "海安镇"]
      }, {
        name: "镇江市",
        districtAndCounty: ["京口区", "润州区", "丹徒区", "扬中市", "丹阳市", "句容市"]
      }, {
        name: "常州市",
        districtAndCounty: ["钟楼区", "天宁区", "戚墅堰区", "新北区", "武进区", "金坛市", "溧阳市"]
      }, {
        name: "无锡市",
        districtAndCounty: ["崇安区", "南长区", "北塘区", "滨湖区", "惠山区", "锡山区", "江阴市", "宜兴市"]
      }, {
        name: "苏州市",
        districtAndCounty: ["金阊区", "沧浪区", "平江区", "虎丘区", "吴中区", "相城区", "吴江市", "昆山市", "太仓市", "常熟市", "张家港市"]
      }]
    }, {
      name: "浙江省",
      city: [{
        name: "杭州市",
        districtAndCounty: ["拱墅区", "上城区", "下城区", "江干区", "西湖区", "滨江区", "余杭区", "萧山区", "临安市", "富阳市", "建德市", "桐庐县", "淳安县", "千岛湖镇"]
      }, {
        name: "湖州市",
        districtAndCounty: ["吴兴区", "南浔区", "长兴县", "雉城镇", "德清县", "武康镇", "安吉县", "递铺镇"]
      }, {
        name: "嘉兴市",
        districtAndCounty: ["南湖区", "秀洲区", "平湖市", "海宁市", "桐乡市", "嘉善县", "魏塘镇", "海盐县", "武原镇"]
      }, {
        name: "舟山市",
        districtAndCounty: ["定海区", "普陀区", "岱山县", "高亭镇", "嵊泗县", "菜园镇"]
      }, {
        name: "宁波市",
        districtAndCounty: ["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "慈溪市", "余姚市", "奉化市", "宁海县", "象山县"]
      }, {
        name: "绍兴市",
        districtAndCounty: ["越城区", "诸暨市", "上虞市", "嵊州市", "绍兴县", "新昌县", "城关镇"]
      }, {
        name: "衢州市",
        districtAndCounty: ["柯城区", "衢江区", "江山市", "常山县", "天马镇", "开化县", "城关镇", "龙游县"]
      }, {
        name: "金华市",
        districtAndCounty: ["婺城区", "金东区", "兰溪市", "永康市", "义乌市", "东阳市", "武义县", "浦江县", "磐安县", "安文镇"]
      }, {
        name: "台州市",
        districtAndCounty: ["椒江区", "黄岩区", "路桥区", "临海市", "温岭市", "三门县", "海游镇", "天台县", "仙居县", "玉环县", "珠港镇"]
      }, {
        name: "温州市",
        districtAndCounty: ["鹿城区", "龙湾区", "瓯海区", "瑞安市", "乐清市", "永嘉县", "上塘镇", "文成县", "大峃镇", "平阳县", "昆阳镇", "泰顺县", "罗阳镇", "洞头县", "北岙镇", "苍南县", "灵溪镇"]
      }, {
        name: "丽水市",
        districtAndCounty: ["莲都区", "龙泉市", "缙云县", "五云镇", "青田县", "鹤城镇", "云和县", "云和镇", "遂昌县", "妙高镇", "松阳县", "西屏镇", "庆元县", "松源镇", "景宁畲族自治县", "鹤溪镇"]
      }]
    }, {
      name: "安徽省",
      city: [{
        name: "合肥市",
        districtAndCounty: ["庐阳区", "瑶海区", "蜀山区", "包河区", "长丰县", "水湖镇", "肥东县", "店埠镇", "肥西县", "上派镇"]
      }, {
        name: "宿州市",
        districtAndCounty: ["埇桥区", "砀山县", "砀城镇", "萧县", "龙城镇", "灵璧县", "灵城镇", "泗县", "泗城镇"]
      }, {
        name: "淮北市",
        districtAndCounty: ["相山区", "杜集区", "烈山区", "濉溪县", "濉溪镇"]
      }, {
        name: "亳州市",
        districtAndCounty: ["谯城区", "涡阳县", "城关镇", "蒙城县", "城关镇", "利辛县", "城关镇"]
      }, {
        name: "阜阳市",
        districtAndCounty: ["颍州区", "颍东区", "颍泉区", "界首市", "临泉县", "城关镇", "太和县", "城关镇", "阜南县", "城关镇", "颍上县", "慎城镇"]
      }, {
        name: "蚌埠市",
        districtAndCounty: ["蚌山区", "龙子湖区", "禹会区", "淮上区", "怀远县", "城关镇", "五河县", "城关镇", "固镇县", "城关镇"]
      }, {
        name: "淮南市",
        districtAndCounty: ["田家庵区", "大通区", "谢家集区", "八公山区", "潘集区", "凤台县", "城关镇"]
      }, {
        name: "滁州市",
        districtAndCounty: ["琅区", "南谯区", "明光市", "天长市", "来安县", "新安镇", "全椒县", "襄河镇", "定远县", "定城镇", "凤阳县", "府城镇"]
      }, {
        name: "马鞍山市",
        districtAndCounty: ["雨山区", "花山区", "金家庄区", "当涂县", "姑孰镇"]
      }, {
        name: "芜湖市",
        districtAndCounty: ["镜湖区", "弋江区", "三山区", "鸠江区", "芜湖县", "湾镇", "繁昌县", "繁阳镇", "南陵县", "籍山镇"]
      }, {
        name: "铜陵市",
        districtAndCounty: ["铜官山区", "狮子山区", "郊区", "铜陵县", "五松镇"]
      }, {
        name: "安庆市",
        districtAndCounty: ["迎江区", "大观区", "宜秀区", "桐城市", "怀宁县", "高河镇", "枞阳县", "枞阳镇", "潜山县", "梅城镇", "太湖县", "晋熙镇", "宿松县", "孚玉镇", "望江县", "雷阳镇", "岳西县", "天堂镇"]
      }, {
        name: "黄山市",
        districtAndCounty: ["屯溪区", "黄山区", "徽州区", "歙县", "徽城镇", "休宁县", "海阳镇", "黟县", "碧阳镇", "祁门县", "祁山镇"]
      }, {
        name: "六安市",
        districtAndCounty: ["金安区", "裕安区", "寿县", "寿春镇", "霍邱县", "城关镇", "舒城县", "城关镇", "金寨县", "梅山镇", "霍山县", "衡山镇"]
      }, {
        name: "巢湖市",
        districtAndCounty: ["居巢区", "庐江县", "庐城镇", "无为县", "无城镇", "含山县", "环峰镇", "和县", "历阳镇"]
      }, {
        name: "池州市",
        districtAndCounty: ["贵池区", "东至县", "尧渡镇", "石台县", "七里镇", "青阳县", "蓉城镇"]
      }, {
        name: "宣城市",
        districtAndCounty: ["宣州区", "宁国市", "郎溪县", "建平镇", "广德县", "桃州镇", "泾县", "泾川镇", "旌德县", "旌阳镇", "绩溪县", "华阳镇"]
      }]
    }, {
      name: "福建省",
      city: [{
        name: "福州市",
        districtAndCounty: ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "福清市", "长乐市", "闽侯县", "连江县", "凤城镇", "罗源县", "凤山镇", "闽清县", "梅城镇", "永泰县", "樟城镇", "平潭县", "潭城镇"]
      }, {
        name: "南平市",
        districtAndCounty: ["延平区", "邵武市", "武夷山市", "建瓯市", "建阳市", "顺昌县", "浦城县", "光泽县", "杭川镇", "松溪县", "松源镇", "政和县", "熊山镇"]
      }, {
        name: "莆田市",
        districtAndCounty: ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"]
      }, {
        name: "三明市",
        districtAndCounty: ["梅列区", "三元区", "永安市", "明溪县", "雪峰镇", "清流县", "龙津镇", "宁化县", "翠江镇", "大田县", "均溪镇", "尤溪县", "城关镇", "沙县", "将乐县", "古镛镇", "泰宁县", "杉城镇", "建宁县", "濉城镇"]
      }, {
        name: "泉州市",
        districtAndCounty: ["鲤城区", "丰泽区", "洛江区", "泉港区", "石狮市", "晋江市", "南安市", "惠安县", "螺城镇", "安溪县", "凤城镇", "永春县", "桃城镇", "德化县", "浔中镇", "金门县", "☆"]
      }, {
        name: "厦门市",
        districtAndCounty: ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"]
      }, {
        name: "漳州市",
        districtAndCounty: ["芗城区", "龙文区", "龙海市", "云霄县", "云陵镇", "漳浦县", "绥安镇", "诏安县", "南诏镇", "长泰县", "武安镇", "东山县", "西埔镇", "南靖县", "山城镇", "平和县", "小溪镇", "华安县", "华丰镇"]
      }, {
        name: "龙岩市",
        districtAndCounty: ["新罗区", "漳平市", "长汀县", "汀州镇", "永定县", "凤城镇", "上杭县", "临江镇", "武平县", "平川镇", "连城县", "莲峰镇"]
      }, {
        name: "宁德市",
        districtAndCounty: ["蕉城区", "福安市", "福鼎市", "寿宁县", "鳌阳镇", "霞浦县", "柘荣县", "双城镇", "屏南县", "古峰镇", "古田县", "周宁县", "狮城镇"]
      }]
    }, {
      name: "江西省",
      city: [{
        name: "南昌市",
        districtAndCounty: ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "莲塘镇", "新建县", "长堎镇", "安义县", "龙津镇", "进贤县", "民和镇"]
      }, {
        name: "九江市",
        districtAndCounty: ["浔阳区", "庐山区", "瑞昌市", "九江县", "沙河街镇", "武宁县", "新宁镇", "修水县", "义宁镇", "永修县", "涂埠镇", "德安县", "蒲亭镇", "星子县", "南康镇", "都昌县", "都昌镇", "湖口县", "双钟镇", "彭泽县", "龙城镇"]
      }, {
        name: "景德镇市",
        districtAndCounty: ["珠山区", "昌江区", "乐平市", "浮梁县", "浮梁镇"]
      }, {
        name: "鹰潭市",
        districtAndCounty: ["月湖区", "贵溪市", "余江县", "邓埠镇"]
      }, {
        name: "新余市",
        districtAndCounty: ["渝水区", "分宜县", "分宜镇"]
      }, {
        name: "萍乡市",
        districtAndCounty: ["安源区", "湘东区", "莲花县", "琴亭镇", "上栗县", "上栗镇", "芦溪县", "芦溪镇"]
      }, {
        name: "赣州市",
        districtAndCounty: ["章贡区", "瑞金市", "南康市", "赣县", "梅林镇", "信丰县", "嘉定镇", "大余县", "南安镇", "上犹县", "东山镇", "崇义县", "横水镇", "安远县", "欣山镇", "龙南县", "龙南镇", "定南县", "历市镇", "全南县", "城厢镇", "宁都县", "梅江镇", "于都县", "贡江镇", "兴国县", "潋江镇", "会昌县", "文武坝镇", "寻乌县", "长宁镇", "石城县", "琴江镇"]
      }, {
        name: "上饶市",
        districtAndCounty: ["信州区", "德兴市", "上饶县", "旭日镇", "广丰县", "永丰镇", "玉山县", "冰溪镇", "铅山县", "河口镇", "横峰县", "岑阳镇", "弋阳县", "弋江镇", "余干县", "玉亭镇", "鄱阳县", "鄱阳镇", "万年县", "陈营镇", "婺源县", "紫阳镇"]
      }, {
        name: "抚州市",
        districtAndCounty: ["临川区", "南城县", "建昌镇", "黎川县", "日峰镇", "南丰县", "琴城镇", "崇仁县", "巴山镇", "乐安县", "鳌溪镇", "宜黄县", "凤冈镇", "金溪县", "秀谷镇", "资溪县", "鹤城镇", "东乡县", "孝岗镇", "广昌县", "旴江镇"]
      }, {
        name: "宜春市",
        districtAndCounty: ["袁州区", "丰城市", "樟树市", "高安市", "奉新县", "冯川镇", "万载县", "上高县", "宜丰县", "新昌镇", "靖安县", "双溪镇", "铜鼓县", "永宁镇"]
      }, {
        name: "吉安市",
        districtAndCounty: ["吉州区", "青原区", "井冈山市", "厦坪镇", "吉安县", "敦厚镇", "吉水县", "文峰镇", "峡江县", "水边镇", "新干县", "金川镇", "永丰县", "恩江镇", "泰和县", "澄江镇", "遂川县", "泉江镇", "万安县", "芙蓉镇", "安福县", "平都镇", "永新县", "禾川镇"]
      }]
    }, {
      name: "山东省",
      city: [{
        name: "济南市",
        districtAndCounty: ["市中区", "历下区", "槐荫区", "天桥区", "历城区", "长清区", "章丘市", "平阴县", "平阴镇", "济阳县", "济阳镇", "商河县"]
      }, {
        name: "青岛市",
        districtAndCounty: ["市南区", "市北区", "四方区", "黄岛区", "崂山区", "城阳区", "李沧区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"]
      }, {
        name: "聊城市",
        districtAndCounty: ["东昌府区", "临清市", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "冠城镇", "高唐县"]
      }, {
        name: "德州市",
        districtAndCounty: ["德城区", "乐陵市", "禹城市", "陵县", "陵城镇", "平原县", "夏津县", "夏津镇", "武城县", "武城镇", "齐河县", "晏城镇", "临邑县", "宁津县", "宁津镇", "庆云县", "庆云镇"]
      }, {
        name: "东营市",
        districtAndCounty: ["东营区", "河口区", "垦利县", "垦利镇", "利津县", "利津镇", "广饶县", "广饶镇"]
      }, {
        name: "淄博市",
        districtAndCounty: ["张店区", "淄川区", "博山区", "临淄区", "周村区", "桓台县", "索镇", "高青县", "田镇", "沂源县", "南麻镇"]
      }, {
        name: "潍坊市",
        districtAndCounty: ["潍城区", "寒亭区", "坊子区", "奎文区", "安丘市", "昌邑市", "高密市", "青州市", "诸城市", "寿光市", "临朐县", "昌乐县"]
      }, {
        name: "烟台市",
        districtAndCounty: ["莱山区", "芝罘区", "福山区", "牟平区", "栖霞市", "海阳市", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "长岛县", "南长山镇"]
      }, {
        name: "威海市",
        districtAndCounty: ["环翠区", "荣成市", "乳山市", "文登市"]
      }, {
        name: "日照市",
        districtAndCounty: ["东港区", "岚山区", "五莲县", "洪凝镇", "莒县", "城阳镇"]
      }, {
        name: "临沂市",
        districtAndCounty: ["兰山区", "罗庄区", "河东区", "郯城县", "郯城镇", "苍山县", "卞庄镇", "莒南县", "十字路镇", "沂水县", "沂水镇", "蒙阴县", "蒙阴镇", "平邑县", "平邑镇", "费县", "费城镇", "沂南县", "界湖镇", "临沭县", "临沭镇"]
      }, {
        name: "枣庄市",
        districtAndCounty: ["薛城区", "市中区", "峄城区", "台儿庄区", "山亭区", "滕州市"]
      }, {
        name: "济宁市",
        districtAndCounty: ["市中区", "任城区", "曲阜市", "兖州市", "邹城市", "微山县", "鱼台县", "谷亭镇", "金乡县", "金乡镇", "嘉祥县", "嘉祥镇", "汶上县", "汶上镇", "泗水县", "梁山县", "梁山镇"]
      }, {
        name: "泰安市",
        districtAndCounty: ["泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县", "宁阳镇", "东平县", "东平镇"]
      }, {
        name: "莱芜市",
        districtAndCounty: ["莱城区", "钢城区"]
      }, {
        name: "滨州市",
        districtAndCounty: ["滨城区", "惠民县", "惠民镇", "阳信县", "阳信镇", "无棣县", "无棣镇", "沾化县", "富国镇", "博兴县", "博兴镇", "邹平县"]
      }, {
        name: "菏泽市",
        districtAndCounty: ["牡丹区", "曹县", "曹城镇", "定陶县", "定陶镇", "成武县", "成武镇", "单县", "单城镇", "巨野县", "巨野镇", "郓城县", "郓城镇", "鄄城县", "鄄城镇", "东明县", "城关镇"]
      }]
    }, {
      name: "河南省",
      city: [{
        name: "郑州市",
        districtAndCounty: ["中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "新郑市", "登封市", "新密市", "巩义市", "荥阳市", "中牟县", "城关镇"]
      }, {
        name: "开封市",
        districtAndCounty: ["鼓楼区", "龙亭区", "顺河回族区", "禹王台区", "金明区", "杞县", "城关镇", "通许县", "城关镇", "尉氏县", "城关镇", "开封县", "城关镇", "兰考县", "城关镇"]
      }, {
        name: "三门峡市",
        districtAndCounty: ["湖滨区", "义马市", "灵宝市", "渑池县", "城关镇", "陕县", "大营镇", "卢氏县", "城关镇"]
      }, {
        name: "洛阳市",
        districtAndCounty: ["西工区", "老城区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "偃师市", "孟津县", "城关镇", "新安县", "城关镇", "栾川县", "城关镇", "嵩县", "城关镇", "汝阳县", "城关镇", "宜阳县", "城关镇", "洛宁县", "城关镇", "伊川县", "城关镇"]
      }, {
        name: "焦作市",
        districtAndCounty: ["解放区", "山阳区", "中站区", "马村区", "孟州市", "沁阳市", "修武县", "城关镇", "博爱县", "清化镇", "武陟县", "木城镇", "温县", "温泉镇"]
      }, {
        name: "新乡市",
        districtAndCounty: ["卫滨区", "红旗区", "凤泉区", "牧野区", "卫辉市", "辉县市", "新乡县", "新乡市红旗区", "获嘉县", "城关镇", "原阳县", "城关镇", "延津县", "城关镇", "封丘县", "城关镇", "长垣县", "城关镇"]
      }, {
        name: "鹤壁市",
        districtAndCounty: ["淇滨区", "山城区", "鹤山区", "浚县", "城关镇", "淇县", "朝歌镇"]
      }, {
        name: "安阳市",
        districtAndCounty: ["北关区", "文峰区", "殷都区", "龙安区", "林州市", "安阳县", "安阳市北关区", "汤阴县", "城关镇", "滑县", "道口镇", "内黄县", "城关镇"]
      }, {
        name: "濮阳市",
        districtAndCounty: ["华龙区", "清丰县", "城关镇", "南乐县", "城关镇", "范县", "城关镇", "台前县", "城关镇", "濮阳县", "城关镇"]
      }, {
        name: "商丘市",
        districtAndCounty: ["梁园区", "睢阳区", "永城市", "虞城县", "城关镇", "民权县", "城关镇", "宁陵县", "城关镇", "睢县", "城关镇", "夏邑县", "城关镇", "柘城县", "城关镇"]
      }, {
        name: "许昌市",
        districtAndCounty: ["魏都区", "禹州市", "长葛市", "许昌县", "许昌市魏都区", "鄢陵县", "安陵镇", "襄城县", "城关镇"]
      }, {
        name: "漯河市",
        districtAndCounty: ["源汇区", "郾城区", "召陵区", "舞阳县", "舞泉镇", "临颍县", "城关镇"]
      }, {
        name: "平顶山市",
        districtAndCounty: ["新华区", "卫东区", "湛河区", "石龙区", "舞钢市", "汝州市", "宝丰县", "城关镇", "叶县", "昆阳镇", "鲁山县", "鲁阳镇", "郏县", "城关镇"]
      }, {
        name: "南阳市",
        districtAndCounty: ["卧龙区", "宛城区", "邓州市", "南召县", "城关镇", "方城县", "城关镇", "西峡县", "镇平县", "城关镇", "内乡县", "城关镇", "淅川县", "社旗县", "赊店镇", "唐河县", "新野县", "城关镇", "桐柏县", "城关镇"]
      }, {
        name: "信阳市",
        districtAndCounty: ["河区", "平桥区", "息县", "城关镇", "淮滨县", "城关镇", "潢川县", "光山县", "固始县", "城关镇", "商城县", "城关镇", "罗山县", "城关镇", "新县", "新集镇"]
      }, {
        name: "周口市",
        districtAndCounty: ["川汇区", "项城市", "扶沟县", "城关镇", "西华县", "城关镇", "商水县", "城关镇", "太康县", "城关镇", "鹿邑县", "城关镇", "郸城县", "城关镇", "淮阳县", "城关镇", "沈丘县", "槐店镇"]
      }, {
        name: "驻马店市",
        districtAndCounty: ["驿城区", "确山县", "盘龙镇", "泌阳县", "泌水镇", "遂平县", "灈阳镇", "西平县", "上蔡县", "蔡都镇", "汝南县", "汝宁镇", "平舆县", "古槐镇", "新蔡县", "古吕镇", "正阳县", "真阳镇"]
      }, {
        name: "济源市",
        districtAndCounty: []
      }]
    }, {
      name: "湖北省",
      city: [{
        name: "武汉市",
        districtAndCounty: ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"]
      }, {
        name: "十堰市",
        districtAndCounty: ["张湾区", "茅箭区", "丹江口市", "郧县", "城关镇", "竹山县", "城关镇", "房县", "城关镇", "郧西县", "城关镇", "竹溪县", "城关镇"]
      }, {
        name: "襄樊市",
        districtAndCounty: ["襄城区", "樊城区", "襄阳区", "老河口市", "枣阳市", "宜城市", "南漳县", "城关镇", "谷城县", "城关镇", "保康县", "城关镇"]
      }, {
        name: "荆门市",
        districtAndCounty: ["东宝区", "掇刀区", "钟祥市", "沙洋县", "沙洋镇", "京山县", "新市镇"]
      }, {
        name: "孝感市",
        districtAndCounty: ["孝南区", "应城市", "安陆市", "汉川市", "孝昌县", "花园镇", "大悟县", "城关镇", "云梦县", "城关镇"]
      }, {
        name: "黄冈市",
        districtAndCounty: ["黄州区", "麻城市", "武穴市", "红安县", "城关镇", "罗田县", "凤山镇", "英山县", "温泉镇", "浠水县", "清泉镇", "蕲春县", "漕河镇", "黄梅县", "黄梅镇", "团风县", "团风镇"]
      }, {
        name: "鄂州市",
        districtAndCounty: ["鄂城区", "梁子湖区", "华容区"]
      }, {
        name: "黄石市",
        districtAndCounty: ["黄石港区", "西塞山区", "下陆区", "铁山区", "大冶市", "阳新县", "兴国镇"]
      }, {
        name: "咸宁市",
        districtAndCounty: ["咸安区", "赤壁市", "嘉鱼县", "鱼岳镇", "通城县", "隽水镇", "崇阳县", "天城镇", "通山县", "通羊镇"]
      }, {
        name: "荆州市",
        districtAndCounty: ["沙市区", "荆州区", "石首市", "洪湖市", "松滋市", "江陵县", "郝穴镇", "公安县", "斗湖堤镇", "监利县", "容城镇"]
      }, {
        name: "宜昌市",
        districtAndCounty: ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "枝江市", "宜都市", "当阳市", "远安县", "鸣凤镇", "兴山县", "古夫镇", "秭归县", "茅坪镇", "长阳土家族自治县", "龙舟坪镇", "五峰土家族自治县", "五峰镇"]
      }, {
        name: "随州市",
        districtAndCounty: ["曾都区", "广水市"]
      }, {
        name: "省直辖县级行政单位",
        districtAndCounty: ["仙桃市", "天门市", "潜江市", "神农架林区", "松柏镇"]
      }, {
        name: "恩施州",
        districtAndCounty: ["恩施市", "利川市", "建始县", "业州镇", "巴东县", "信陵镇", "宣恩县", "珠山镇", "咸丰县", "高乐山镇", "来凤县", "翔凤镇", "鹤峰县", "容美镇"]
      }]
    }, {
      name: "湖南省",
      city: [{
        name: "长沙市",
        districtAndCounty: ["长沙市", "岳麓区", "芙蓉区", "天心区", "开福区", "雨花区", "浏阳市", "长沙县", "星沙镇", "望城县", "高塘岭镇", "宁乡县", "玉潭镇"]
      }, {
        name: "张家界市",
        districtAndCounty: ["永定区", "武陵源区", "慈利县", "零阳镇", "桑植县", "澧源镇"]
      }, {
        name: "常德市",
        districtAndCounty: ["武陵区", "鼎城区", "津市市", "安乡县", "城关镇", "汉寿县", "龙阳镇", "澧县", "澧阳镇", "临澧县", "安福镇", "桃源县", "漳江镇", "石门县", "楚江镇"]
      }, {
        name: "益阳市",
        districtAndCounty: ["赫山区", "资阳区", "沅江市", "南县", "南洲镇", "桃江县", "桃花江镇", "安化县", "东坪镇"]
      }, {
        name: "岳阳市",
        districtAndCounty: ["岳阳楼区", "君山区", "云溪区", "汨罗市", "临湘市", "岳阳县", "荣家湾镇", "华容县", "城关镇", "湘阴县", "文星镇", "平江县", "汉昌镇"]
      }, {
        name: "株洲市",
        districtAndCounty: ["天元区", "荷塘区", "芦淞区", "石峰区", "醴陵市", "株洲县", "渌口镇", "攸县", "城关镇", "茶陵县", "城关镇", "炎陵县", "霞阳镇"]
      }, {
        name: "湘潭市",
        districtAndCounty: ["岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县", "易俗河镇"]
      }, {
        name: "衡阳市",
        districtAndCounty: ["雁峰区", "珠晖区", "石鼓区", "蒸湘区", "南岳区", "常宁市", "耒阳市", "衡阳县", "西渡镇", "衡南县", "云集镇", "衡山县", "开云镇", "衡东县", "城关镇", "祁东县", "洪桥镇"]
      }, {
        name: "郴州市",
        districtAndCounty: ["北湖区", "苏仙区", "资兴市", "桂阳县", "城关镇", "永兴县", "城关镇", "宜章县", "城关镇", "嘉禾县", "城关镇", "临武县", "城关镇", "汝城县", "城关镇", "桂东县", "城关镇", "安仁县", "城关镇"]
      }, {
        name: "永州市",
        districtAndCounty: ["冷水滩区", "零陵区", "东安县", "白牙市镇", "道县", "道江镇", "宁远县", "舜陵镇", "江永县", "潇浦镇", "蓝山县", "塔峰镇", "新田县", "龙泉镇", "双牌县", "泷泊镇", "祁阳县", "浯溪镇", "江华瑶族自治县", "沱江镇"]
      }, {
        name: "邵阳市",
        districtAndCounty: ["双清区", "大祥区", "北塔区", "武冈市", "邵东县", "两市镇", "邵阳县", "塘渡口镇", "新邵县", "酿溪镇", "隆回县", "桃洪镇", "洞口县", "洞口镇", "绥宁县", "长铺镇", "新宁县", "金石镇", "城步苗族自治县", "儒林镇"]
      }, {
        name: "怀化市",
        districtAndCounty: ["鹤城区", "洪江市", "沅陵县", "沅陵镇", "辰溪县", "辰阳镇", "溆浦县", "卢峰镇", "中方县", "中方镇", "会同县", "林城镇", "麻阳苗族自治县", "高村镇", "新晃侗族自治县", "新晃镇", "芷江侗族自治县", "芷江镇", "靖州苗族侗族自治县", "渠阳镇", "通道侗族自治县", "双江镇"]
      }, {
        name: "娄底市",
        districtAndCounty: ["娄星区", "冷水江市", "涟源市", "双峰县", "永丰镇", "新化县", "上梅镇"]
      }, {
        name: "湘西州",
        districtAndCounty: ["吉首市", "泸溪县", "白沙镇", "凤凰县", "沱江镇", "花垣县", "花垣镇", "保靖县", "迁陵镇", "古丈县", "古阳镇", "永顺县", "灵溪镇", "龙山县"]
      }]
    }, {
      name: "广东省",
      city: [{
        name: "广州市",
        districtAndCounty: ["越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市"]
      }, {
        name: "深圳市",
        districtAndCounty: ["福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "盐田区"]
      }, {
        name: "清远市",
        districtAndCounty: ["清城区", "英德市", "连州市", "佛冈县", "石角镇", "阳山县", "阳城镇", "清新县", "太和镇", "连山壮族瑶族自治县", "吉田镇", "连南瑶族自治县", "三江镇"]
      }, {
        name: "韶关市",
        districtAndCounty: ["浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "太平镇", "仁化县", "仁化镇", "翁源县", "龙仙镇", "新丰县", "乳源瑶族自治县", "乳城镇"]
      }, {
        name: "河源市",
        districtAndCounty: ["源城区", "紫金县", "紫城镇", "龙川县", "老隆镇", "连平县", "元善镇", "和平县", "阳明镇", "东源县", "仙塘镇"]
      }, {
        name: "梅州市",
        districtAndCounty: ["梅江区", "兴宁市", "梅县", "程江镇", "大埔县", "湖寮镇", "丰顺县", "汤坑镇", "五华县", "水寨镇", "平远县", "大柘镇", "蕉岭县", "蕉城镇"]
      }, {
        name: "潮州市",
        districtAndCounty: ["湘桥区", "潮安县", "庵埠镇", "饶平县", "黄冈镇"]
      }, {
        name: "汕头市",
        districtAndCounty: ["金平区", "濠江区", "龙湖区", "潮阳区", "潮南区", "澄海区", "南澳县", "后宅镇"]
      }, {
        name: "揭阳市",
        districtAndCounty: ["榕城区", "普宁市", "揭东县", "曲溪镇", "揭西县", "河婆镇", "惠来县", "惠城镇"]
      }, {
        name: "汕尾市",
        districtAndCounty: ["城区", "陆丰市", "海丰县", "海城镇", "陆河县", "河田镇"]
      }, {
        name: "惠州市",
        districtAndCounty: ["惠城区", "惠阳区", "博罗县", "罗阳镇", "惠东县", "龙门县"]
      }, {
        name: "东莞市",
        districtAndCounty: []
      }, {
        name: "珠海市",
        districtAndCounty: ["香洲区", "斗门区", "金湾区"]
      }, {
        name: "中山市",
        districtAndCounty: []
      }, {
        name: "江门市",
        districtAndCounty: ["江海区", "蓬江区", "新会区", "恩平市", "台山市", "开平市", "鹤山市"]
      }, {
        name: "佛山市",
        districtAndCounty: ["禅城区", "南海区", "顺德区", "三水区", "高明区"]
      }, {
        name: "肇庆市",
        districtAndCounty: ["端州区", "鼎湖区", "高要市", "四会市", "广宁县", "南街镇", "怀集县", "怀城镇", "封开县", "江口镇", "德庆县"]
      }, {
        name: "云浮市",
        districtAndCounty: ["云城区", "罗定市", "云安县", "六都镇", "新兴县", "新城镇", "郁南县", "都城镇"]
      }, {
        name: "阳江市",
        districtAndCounty: ["江城区", "阳春市", "阳西县", "织镇", "阳东县", "东城镇"]
      }, {
        name: "茂名市",
        districtAndCounty: ["茂南区", "茂港区", "化州市", "信宜市", "高州市", "电白县", "水东镇"]
      }, {
        name: "湛江市",
        districtAndCounty: ["赤坎区", "霞山区", "坡头区", "麻章区", "吴川市", "廉江市", "雷州市", "遂溪县", "遂城镇", "徐闻县", "撤销广州市东山区", "芳村区", "设立广州市南沙区", "萝岗区"]
      }]
    }, {
      name: "广西",
      city: [{
        name: "南宁市",
        districtAndCounty: ["青秀区", "兴宁区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "横县", "宾阳县", "上林县", "隆安县", "马山县"]
      }, {
        name: "桂林市",
        districtAndCounty: ["象山区", "叠彩区", "秀峰区", "七星区", "雁山区", "阳朔县", "阳朔镇", "临桂县", "临桂镇", "灵川县", "灵川镇", "全州县", "全州镇", "兴安县", "兴安镇", "永福县", "永福镇", "灌阳县", "灌阳镇", "资源县", "资源镇", "平乐县", "平乐镇", "荔浦县", "荔城镇", "龙胜各族自治县", "龙胜镇", "恭城瑶族自治县", "恭城镇"]
      }, {
        name: "柳州市",
        districtAndCounty: ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江县", "拉堡镇", "柳城县", "大埔镇", "鹿寨县", "鹿寨镇", "融安县", "长安镇", "三江侗族自治县", "古宜镇", "融水苗族自治县", "融水镇"]
      }, {
        name: "梧州市",
        districtAndCounty: ["万秀区", "蝶山区", "长洲区", "岑溪市", "苍梧县", "龙圩镇", "藤县", "藤州镇", "蒙山县", "蒙山镇"]
      }, {
        name: "贵港市",
        districtAndCounty: ["港北区", "港南区", "覃塘区", "桂平市", "平南县", "平南镇"]
      }, {
        name: "玉林市",
        districtAndCounty: ["玉州区", "北流市", "兴业县", "石南镇", "容县", "容州镇", "陆川县", "陆城镇", "博白县", "博白镇"]
      }, {
        name: "钦州市",
        districtAndCounty: ["钦南区", "钦北区", "灵山县", "灵城镇", "浦北县", "小江镇"]
      }, {
        name: "北海市",
        districtAndCounty: ["海城区", "银海区", "铁山港区", "合浦县", "廉州镇"]
      }, {
        name: "防城港市",
        districtAndCounty: ["港口区", "防城区", "东兴市", "上思县", "思阳镇"]
      }, {
        name: "崇左市",
        districtAndCounty: ["江州区", "凭祥市", "扶绥县", "新宁镇", "大新县", "桃城镇", "天等县", "天等镇", "宁明县", "城中镇", "龙州县", "龙州镇"]
      }, {
        name: "百色市",
        districtAndCounty: ["右江区", "田阳县", "田州镇", "田东县", "平马镇", "平果县", "马头镇", "德保县", "城关镇", "靖西县", "新靖镇", "那坡县", "城厢镇", "凌云县", "泗城镇", "乐业县", "同乐镇", "西林县", "八达镇", "田林县", "乐里镇", "隆林各族自治县", "新州镇"]
      }, {
        name: "河池市",
        districtAndCounty: ["金城江区", "宜州市", "南丹县", "城关镇", "天峨县", "六排镇", "凤山县", "凤城镇", "东兰县", "东兰镇", "巴马瑶族自治县", "巴马镇", "都安瑶族自治县", "安阳镇", "大化瑶族自治县", "大化镇", "罗城仫佬族自治县", "东门镇", "环江毛南族自治县", "思恩镇"]
      }, {
        name: "来宾市",
        districtAndCounty: ["兴宾区", "合山市", "象州县", "象州镇", "武宣县", "武宣镇", "忻城县", "城关镇", "金秀瑶族自治县", "金秀镇"]
      }, {
        name: "贺州市",
        districtAndCounty: ["八步区", "昭平县", "昭平镇", "钟山县", "钟山镇", "富川瑶族自治县", "富阳镇"]
      }]
    }, {
      name: "海南省",
      city: [{
        name: "海口市",
        districtAndCounty: ["龙华区", "秀英区", "琼山区", "美兰区"]
      }, {
        name: "三亚市",
        districtAndCounty: []
      }, {
        name: "省直辖行政单位",
        districtAndCounty: ["文昌市", "琼海市", "万宁市", "五指山市", "东方市", "儋州市", "临高县", "临城镇", "澄迈县", "金江镇", "定安县", "定城镇", "屯昌县", "屯城镇", "昌江黎族自治县", "石碌镇", "白沙黎族自治县", "牙叉镇", "琼中黎族苗族自治县", "营根镇", "陵水黎族自治县", "椰林镇", "保亭黎族苗族自治县", "保城镇", "乐东黎族自治县", "抱由镇"]
      }]
    }, {
      name: "四川省",
      city: [{
        name: "成都市",
        districtAndCounty: ["青羊区", "锦江区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "都江堰市", "彭州市", "邛崃市", "崇州市", "金堂县", "赵镇", "双流县", "郫县", "郫筒镇", "大邑县", "晋原镇", "蒲江县", "鹤山镇", "新津县", "五津镇"]
      }, {
        name: "广元市",
        districtAndCounty: ["市中区", "元坝区", "朝天区", "旺苍县", "东河镇", "青川县", "乔庄镇", "剑阁县", "下寺镇", "苍溪县", "陵江镇"]
      }, {
        name: "绵阳市",
        districtAndCounty: ["涪城区", "游仙区", "江油市", "三台县", "潼川镇", "盐亭县", "云溪镇", "安县", "花荄镇", "梓潼县", "文昌镇", "北川羌族自治县", "曲山镇", "平武县", "龙安镇"]
      }, {
        name: "德阳市",
        districtAndCounty: ["旌阳区", "什邡市", "广汉市", "绵竹市", "罗江县", "罗江镇", "中江县", "凯江镇"]
      }, {
        name: "南充市",
        districtAndCounty: ["顺庆区", "高坪区", "嘉陵区", "阆中市", "南部县", "南隆镇", "营山县", "朗池镇", "蓬安县", "周口镇", "仪陇县", "新政镇", "西充县", "晋城镇"]
      }, {
        name: "广安市",
        districtAndCounty: ["广安区", "华蓥市", "岳池县", "九龙镇", "武胜县", "沿口镇", "邻水县", "鼎屏镇"]
      }, {
        name: "遂宁市",
        districtAndCounty: ["船山区", "安居区", "蓬溪县", "赤城镇", "射洪县", "太和镇", "大英县", "蓬莱镇"]
      }, {
        name: "内江市",
        districtAndCounty: ["市中区", "东兴区", "威远县", "严陵镇", "资中县", "重龙镇", "隆昌县", "金鹅镇"]
      }, {
        name: "乐山市",
        districtAndCounty: ["市中区", "沙湾区", "五通桥区", "金口河区", "峨眉山市", "犍为县", "玉津镇", "井研县", "研城镇", "夹江县", "漹城镇", "沐川县", "沐溪镇", "峨边彝族自治县", "沙坪镇", "马边彝族自治县", "民建镇"]
      }, {
        name: "自贡市",
        districtAndCounty: ["自流井区", "大安区", "贡井区", "沿滩区", "荣县", "旭阳镇", "富顺县", "富世镇"]
      }, {
        name: "泸州市",
        districtAndCounty: ["江阳区", "纳溪区", "龙马潭区", "泸县", "福集镇", "合江县", "合江镇", "叙永县", "叙永镇", "古蔺县", "古蔺镇"]
      }, {
        name: "宜宾市",
        districtAndCounty: ["翠屏区", "宜宾县", "柏溪镇", "南溪县", "南溪镇", "江安县", "江安镇", "长宁县", "长宁镇", "高县", "庆符镇", "筠连县", "筠连镇", "珙县", "巡场镇", "兴文县", "中城镇", "屏山县", "屏山镇"]
      }, {
        name: "攀枝花市",
        districtAndCounty: ["东区", "西区", "仁和区", "米易县", "攀莲镇", "盐边县", "桐子林镇"]
      }, {
        name: "巴中市",
        districtAndCounty: ["巴州区", "通江县", "诺江镇", "南江县", "南江镇", "平昌县", "江口镇"]
      }, {
        name: "达州市",
        districtAndCounty: ["通川区", "万源市", "达县", "南外镇", "宣汉县", "东乡镇", "开江县", "新宁镇", "大竹县", "竹阳镇", "渠县", "渠江镇"]
      }, {
        name: "资阳市",
        districtAndCounty: ["雁江区", "简阳市", "乐至县", "天池镇", "安岳县", "岳阳镇"]
      }, {
        name: "眉山市",
        districtAndCounty: ["东坡区", "仁寿县", "文林镇", "彭山县", "凤鸣镇", "洪雅县", "洪川镇", "丹棱县", "丹棱镇", "青神县", "城厢镇"]
      }, {
        name: "雅安市",
        districtAndCounty: ["雨城区", "名山县", "蒙阳镇", "荥经县", "严道镇", "汉源县", "富林镇", "石棉县", "新棉镇", "天全县", "城厢镇", "芦山县", "芦阳镇", "宝兴县", "穆坪镇"]
      }, {
        name: "阿坝州",
        districtAndCounty: ["马尔康县", "马尔康镇", "汶川县", "威州镇", "理县", "杂谷脑镇", "茂县", "凤仪镇", "松潘县", "进安镇", "九寨沟县", "永乐镇", "金川县", "金川镇", "小金县", "美兴镇", "黑水县", "芦花镇", "壤塘县", "壤柯镇", "阿坝县", "阿坝镇", "若尔盖县", "达扎寺镇", "红原县", "邛溪镇"]
      }, {
        name: "甘孜州",
        districtAndCounty: ["康定县", "炉城镇", "泸定县", "泸桥镇", "丹巴县", "章谷镇", "九龙县", "呷尔镇", "雅江县", "河口镇", "道孚县", "鲜水镇", "炉霍县", "新都镇", "甘孜县", "甘孜镇", "新龙县", "茹龙镇", "德格县", "更庆镇", "白玉县", "建设镇", "石渠县", "尼呷镇", "色达县", "色柯镇", "理塘县", "高城镇", "巴塘县", "夏邛镇", "乡城县", "桑披镇", "稻城县", "金珠镇", "得荣县", "松麦镇"]
      }, {
        name: "凉山州",
        districtAndCounty: ["西昌市", "盐源县", "盐井镇", "德昌县", "德州镇", "会理县", "城关镇", "会东县", "会东镇", "宁南县", "披砂镇", "普格县", "普基镇", "布拖县", "特木里镇", "金阳县", "天地坝镇", "昭觉县", "新城镇", "喜德县", "光明镇", "冕宁县", "城厢镇", "越西县", "越城镇", "甘洛县", "新市坝镇", "美姑县", "巴普镇", "雷波县", "锦城镇", "木里藏族自治县", "乔瓦镇"]
      }]
    }, {
      name: "贵州省",
      city: [{
        name: "贵阳市",
        districtAndCounty: ["乌当区", "南明区", "云岩区", "花溪区", "白云区", "小河区", "清镇市", "开阳县", "城关镇", "修文县", "龙场镇", "息烽县", "永靖镇"]
      }, {
        name: "六盘水市",
        districtAndCounty: ["钟山区", "盘县", "红果镇", "六枝特区", "平寨镇", "水城县"]
      }, {
        name: "遵义市",
        districtAndCounty: ["红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "南白镇", "桐梓县", "娄山关镇", "绥阳县", "洋川镇", "正安县", "凤仪镇", "凤冈县", "龙泉镇", "湄潭县", "湄江镇", "余庆县", "白泥镇", "习水县", "东皇镇", "道真仡佬族苗族自治县", "玉溪镇", "务川仡佬族苗族自治县", "都濡镇"]
      }, {
        name: "安顺市",
        districtAndCounty: ["西秀区", "平坝县", "城关镇", "普定县", "城关镇", "关岭布依族苗族自治县", "关索镇", "镇宁布依族苗族自治县", "城关镇", "紫云苗族布依族自治县", "松山镇"]
      }, {
        name: "毕节地区",
        districtAndCounty: ["毕节市", "大方县", "大方镇", "黔西县", "城关镇", "金沙县", "城关镇", "织金县", "城关镇", "纳雍县", "雍熙镇", "赫章县", "城关镇", "威宁彝族回族苗族自治县", "草海镇"]
      }, {
        name: "铜仁地区",
        districtAndCounty: ["铜仁市", "江口县", "双江镇", "石阡县", "汤山镇", "思南县", "思唐镇", "德江县", "青龙镇", "玉屏侗族自治县", "平溪镇", "印江土家族苗族自治县", "峨岭镇", "沿河土家族自治县", "和平镇", "松桃苗族自治县", "蓼皋镇", "万山特区", "万山镇"]
      }, {
        name: "黔东南州",
        districtAndCounty: ["凯里市", "黄平县", "新州镇", "施秉县", "城关镇", "三穗县", "八弓镇", "镇远县", "阳镇", "岑巩县", "思旸镇", "天柱县", "凤城镇", "锦屏县", "三江镇", "剑河县", "革东镇", "台江县", "台拱镇", "黎平县", "德凤镇", "榕江县", "古州镇", "从江县", "丙妹镇", "雷山县", "丹江镇", "麻江县", "杏山镇", "丹寨县", "龙泉镇"]
      }, {
        name: "黔南州",
        districtAndCounty: ["都匀市", "福泉市", "荔波县", "玉屏镇", "贵定县", "城关镇", "瓮安县", "雍阳镇", "独山县", "城关镇", "平塘县", "平湖镇", "罗甸县", "龙坪镇", "长顺县", "长寨镇", "龙里县", "龙山镇", "惠水县", "和平镇", "三都水族自治县", "三合镇"]
      }, {
        name: "黔西南州",
        districtAndCounty: ["兴义市", "兴仁县", "城关镇", "普安县", "盘水镇", "晴隆县", "莲城镇", "贞丰县", "珉谷镇", "望谟县", "复兴镇", "册亨县", "者楼镇", "安龙县", "新安镇"]
      }]
    }, {
      name: "云南省",
      city: [{
        name: "昆明市",
        districtAndCounty: ["盘龙区", "五华区", "官渡区", "西山区", "东川区", "安宁市", "呈贡县", "龙城镇", "晋宁县", "昆阳镇", "富民县", "永定镇", "宜良县", "匡远镇", "嵩明县", "嵩阳镇", "石林彝族自治县", "鹿阜镇", "禄劝彝族苗族自治县", "屏山镇", "寻甸回族彝族自治县", "仁德镇"]
      }, {
        name: "曲靖市",
        districtAndCounty: ["麒麟区", "宣威市", "马龙县", "通泉镇", "沾益县", "西平镇", "富源县", "中安镇", "罗平县", "罗雄镇", "师宗县", "丹凤镇", "陆良县", "中枢镇", "会泽县", "金钟镇"]
      }, {
        name: "玉溪市",
        districtAndCounty: ["红塔区", "江川县", "大街镇", "澄江县", "凤麓镇", "通海县", "秀山镇", "华宁县", "宁州镇", "易门县", "龙泉镇", "峨山彝族自治县", "双江镇", "新平彝族傣族自治县", "桂山镇", "元江哈尼族彝族傣族自治县", "澧江镇"]
      }, {
        name: "保山市",
        districtAndCounty: ["隆阳区", "施甸县", "甸阳镇", "腾冲县", "腾越镇", "龙陵县", "龙山镇", "昌宁县", "田园镇"]
      }, {
        name: "昭通市",
        districtAndCounty: ["昭阳区", "鲁甸县", "文屏镇", "巧家县", "新华镇", "盐津县", "盐井镇", "大关县", "翠华镇", "永善县", "溪落渡镇", "绥江县", "中城镇", "镇雄县", "乌峰镇", "彝良县", "角奎镇", "威信县", "扎西镇", "水富县", "向家坝镇"]
      }, {
        name: "丽江市",
        districtAndCounty: ["古城区", "永胜县", "永北镇", "华坪县", "中心镇", "玉龙纳西族自治县", "黄山镇", "宁蒗彝族自治县", "大兴镇"]
      }, {
        name: "思茅市",
        districtAndCounty: ["翠云区", "普洱哈尼族彝族自治县", "宁洱镇", "墨江哈尼族自治县", "联珠镇", "景东彝族自治县", "锦屏镇", "景谷傣族彝族自治县", "威远镇", "镇沅彝族哈尼族拉祜族自治县", "恩乐镇", "江城哈尼族彝族自治县", "勐烈镇", "孟连傣族拉祜族佤族自治县", "娜允镇", "澜沧拉祜族自治县", "勐朗镇", "西盟佤族自治县", "勐梭镇"]
      }, {
        name: "临沧市",
        districtAndCounty: ["临翔区", "凤庆县", "凤山镇", "云县", "爱华镇", "永德县", "德党镇", "镇康县", "南伞镇", "双江拉祜族佤族布朗族傣族自治县", "勐勐镇", "耿马傣族佤族自治县", "耿马镇", "沧源佤族自治县", "勐董镇"]
      }, {
        name: "德宏州",
        districtAndCounty: ["潞西市", "瑞丽市", "梁河县", "遮岛镇", "盈江县", "平原镇", "陇川县", "章凤镇"]
      }, {
        name: "怒江州",
        districtAndCounty: ["泸水县六库镇", "泸水县", "六库镇", "福贡县", "上帕镇", "贡山独龙族怒族自治县", "茨开镇", "兰坪白族普米族自治县", "金顶镇"]
      }, {
        name: "迪庆州",
        districtAndCounty: ["香格里拉县", "建塘镇", "德钦县", "升平镇", "维西傈僳族自治县", "保和镇"]
      }, {
        name: "大理州",
        districtAndCounty: ["大理市", "祥云县", "祥城镇", "宾川县", "金牛镇", "弥渡县", "弥城镇", "永平县", "博南镇", "云龙县", "诺邓镇", "洱源县", "茈碧湖镇", "剑川县", "金华镇", "鹤庆县", "云鹤镇", "漾濞彝族自治县", "苍山西镇", "南涧彝族自治县", "南涧镇", "巍山彝族回族自治县", "南诏镇"]
      }, {
        name: "楚雄州",
        districtAndCounty: ["楚雄市", "双柏县", "妥甸镇", "牟定县", "共和镇", "南华县", "龙川镇", "姚安县", "栋川镇", "大姚县", "金碧镇", "永仁县", "永定镇", "元谋县", "元马镇", "武定县", "狮山镇", "禄丰县", "金山镇"]
      }, {
        name: "红河州",
        districtAndCounty: ["蒙自县", "文澜镇", "个旧市", "开远市", "绿春县", "大兴镇", "建水县", "临安镇", "石屏县", "异龙镇", "弥勒县", "弥阳镇", "泸西县", "中枢镇", "元阳县", "南沙镇", "红河县", "迤萨镇", "金平苗族瑶族傣族自治县", "金河镇", "河口瑶族自治县", "河口镇", "屏边苗族自治县", "玉屏镇"]
      }, {
        name: "文山州",
        districtAndCounty: ["文山县", "开化镇", "砚山县", "江那镇", "西畴县", "西洒镇", "麻栗坡县", "麻栗镇", "马关县", "马白镇", "丘北县", "锦屏镇", "广南县", "莲城镇", "富宁县", "新华镇"]
      }, {
        name: "西双版纳州",
        districtAndCounty: ["景洪市", "勐海县", "勐海镇", "勐腊县", "勐腊镇"]
      }]
    }, {
      name: "西藏",
      city: [{
        name: "拉萨市",
        districtAndCounty: ["城关区", "林周县", "甘丹曲果镇", "当雄县", "当曲卡镇", "尼木县", "塔荣镇", "曲水县", "曲水镇", "堆龙德庆县", "东嘎镇", "达孜县", "德庆镇", "墨竹工卡县", "工卡镇"]
      }, {
        name: "那曲地区",
        districtAndCounty: ["那曲县", "那曲镇", "嘉黎县", "阿扎镇", "比如县", "比如镇", "聂荣县", "聂荣镇", "安多县", "帕那镇", "申扎县", "申扎镇", "索县", "亚拉镇", "班戈县", "普保镇", "巴青县", "拉西镇", "尼玛县", "尼玛镇"]
      }, {
        name: "昌都地区",
        districtAndCounty: ["昌都县", "城关镇", "江达县", "江达镇", "贡觉县", "莫洛镇", "类乌齐县", "桑多镇", "丁青县", "丁青镇", "察雅县", "烟多镇", "八宿县", "白玛镇", "左贡县", "旺达镇", "芒康县", "嘎托镇", "洛隆县", "孜托镇", "边坝县", "草卡镇"]
      }, {
        name: "林芝地区",
        districtAndCounty: ["林芝县", "八一镇", "工布江达县", "工布江达镇", "米林县", "米林镇", "墨脱县", "墨脱镇", "波密县", "扎木镇", "察隅县", "竹瓦根镇", "朗县", "朗镇"]
      }, {
        name: "山南地区",
        districtAndCounty: ["乃东县", "泽当镇", "扎囊县", "扎塘镇", "贡嘎县", "吉雄镇", "桑日县", "桑日镇", "琼结县", "琼结镇", "曲松县", "曲松镇", "措美县", "措美镇", "洛扎县", "洛扎镇", "加查县", "安绕镇", "隆子县", "隆子镇", "错那县", "错那镇", "浪卡子县", "浪卡子镇"]
      }, {
        name: "日喀则地区",
        districtAndCounty: ["日喀则市", "南木林县", "南木林镇", "江孜县", "江孜镇", "定日县", "协格尔镇", "萨迦县", "萨迦镇", "拉孜县", "曲下镇", "昂仁县", "卡嘎镇", "谢通门县", "卡嘎镇", "白朗县", "洛江镇", "仁布县", "德吉林镇", "康马县", "康马镇", "定结县", "江嘎镇", "仲巴县", "拉让乡", "亚东县", "下司马镇", "吉隆县", "宗嘎镇", "聂拉木县", "聂拉木镇", "萨嘎县", "加加镇", "岗巴县", "岗巴镇"]
      }, {
        name: "阿里地区",
        districtAndCounty: ["噶尔县", "狮泉河镇", "普兰县", "普兰镇", "札达县", "托林镇", "日土县", "日土镇", "革吉县", "革吉镇", "改则县", "改则镇", "措勤县", "措勤镇", "林芝县人民政府驻地由林芝镇迁至八一镇"]
      }]
    }, {
      name: "陕西省",
      city: [{
        name: "西安市",
        districtAndCounty: ["莲湖区", "新城区", "碑林区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "蓝关镇", "周至县", "二曲镇", "户县", "甘亭镇", "高陵县", "鹿苑镇"]
      }, {
        name: "延安市",
        districtAndCounty: ["宝塔区", "延长县", "七里村镇", "延川县", "延川镇", "子长县", "瓦窑堡镇", "安塞县", "真武洞镇", "志丹县", "保安镇", "吴起县", "吴旗镇", "甘泉县", "城关镇", "富县", "富城镇", "洛川县", "凤栖镇", "宜川县", "丹州镇", "黄龙县", "石堡镇", "黄陵县", "桥山镇"]
      }, {
        name: "铜川市",
        districtAndCounty: ["耀州区", "王益区", "印台区", "宜君县", "城关镇"]
      }, {
        name: "渭南市",
        districtAndCounty: ["临渭区", "华阴市", "韩城市", "华县", "华州镇", "潼关县", "城关镇", "大荔县", "城关镇", "蒲城县", "城关镇", "澄城县", "城关镇", "白水县", "城关镇", "合阳县", "城关镇", "富平县", "窦村镇"]
      }, {
        name: "咸阳市",
        districtAndCounty: ["秦都区", "杨陵区", "渭城区", "兴平市", "三原县", "城关镇", "泾阳县", "泾干镇", "乾县", "城关镇", "礼泉县", "城关镇", "永寿县", "监军镇", "彬县", "城关镇", "长武县", "昭仁镇", "旬邑县", "城关镇", "淳化县", "城关镇", "武功县", "普集镇"]
      }, {
        name: "宝鸡市",
        districtAndCounty: ["渭滨区", "金台区", "陈仓区", "凤翔县", "城关镇", "岐山县", "凤鸣镇", "扶风县", "城关镇", "眉县", "首善镇", "陇县", "城关镇", "千阳县", "城关镇", "麟游县", "九成宫镇", "凤县", "双石铺镇", "太白县", "嘴头镇"]
      }, {
        name: "汉中市",
        districtAndCounty: ["汉台区", "南郑县", "城关镇", "城固县", "博望镇", "洋县", "洋州镇", "西乡县", "城关镇", "勉县", "勉阳镇", "宁强县", "汉源镇", "略阳县", "城关镇", "镇巴县", "泾洋镇", "留坝县", "城关镇", "佛坪县", "袁家庄镇"]
      }, {
        name: "榆林市",
        districtAndCounty: ["榆阳区", "神木县", "神木镇", "府谷县", "府谷镇", "横山县", "横山镇", "靖边县", "张家畔镇", "定边县", "定边镇", "绥德县", "名州镇", "米脂县", "银州镇", "佳县", "佳芦镇", "吴堡县", "宋家川镇", "清涧县", "宽洲镇", "子洲县", "双湖峪镇"]
      }, {
        name: "安康市",
        districtAndCounty: ["汉滨区", "汉阴县", "城关镇", "石泉县", "城关镇", "宁陕县", "城关镇", "紫阳县", "城关镇", "岚皋县", "城关镇", "平利县", "城关镇", "镇坪县", "城关镇", "旬阳县", "城关镇", "白河县", "城关镇"]
      }, {
        name: "商洛市",
        districtAndCounty: ["商州区", "洛南县", "城关镇", "丹凤县", "龙驹寨镇", "商南县", "城关镇", "山阳县", "城关镇", "镇安县", "永乐镇", "柞水县", "乾佑镇"]
      }]
    }, {
      name: "甘肃省",
      city: [{
        name: "兰州市",
        districtAndCounty: ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "城关镇", "皋兰县", "石洞镇", "榆中县", "城关镇"]
      }, {
        name: "嘉峪关市",
        districtAndCounty: ["金昌市", "金川区", "永昌县", "城关镇"]
      }, {
        name: "白银市",
        districtAndCounty: ["白银区", "平川区", "靖远县", "乌兰镇", "会宁县", "会师镇", "景泰县", "一条山镇"]
      }, {
        name: "天水市",
        districtAndCounty: ["秦州区", "麦积区", "清水县", "永清镇", "秦安县", "兴国镇", "甘谷县", "大像山镇", "武山县", "城关镇", "张家川回族自治县", "张家川镇"]
      }, {
        name: "武威市",
        districtAndCounty: ["凉州区", "民勤县", "城关镇", "古浪县", "古浪镇", "天祝藏族自治县", "华藏寺镇"]
      }, {
        name: "酒泉市",
        districtAndCounty: ["肃州区", "玉门市", "敦煌市", "金塔县", "金塔镇", "安西县", "渊泉镇", "肃北蒙古族自治县", "党城湾镇", "阿克塞哈萨克族自治县", "红柳湾镇"]
      }, {
        name: "张掖市",
        districtAndCounty: ["甘州区", "民乐县", "洪水镇", "临泽县", "沙河镇", "高台县", "城关镇", "山丹县", "清泉镇", "肃南裕固族自治县", "红湾寺镇"]
      }, {
        name: "庆阳市",
        districtAndCounty: ["西峰区", "庆城县", "庆城镇", "环县", "环城镇", "华池县", "柔远镇", "合水县", "西华池镇", "正宁县", "山河镇", "宁县", "新宁镇", "镇原县", "城关镇"]
      }, {
        name: "平凉市",
        districtAndCounty: ["崆峒区", "泾川县", "城关镇", "灵台县", "中台镇", "崇信县", "锦屏镇", "华亭县", "东华镇", "庄浪县", "水洛镇", "静宁县", "城关镇"]
      }, {
        name: "定西市",
        districtAndCounty: ["安定区", "通渭县", "平襄镇", "临洮县", "洮阳镇", "漳县", "武阳镇", "岷县", "岷阳镇", "渭源县", "清源镇", "陇西县", "巩昌镇"]
      }, {
        name: "陇南市",
        districtAndCounty: ["武都区", "成县", "城关镇", "宕昌县", "城关镇", "康县", "文县", "城关镇", "西和县", "汉源镇", "礼县", "城关镇", "两当县", "城关镇", "徽县", "城关镇"]
      }, {
        name: "临夏州",
        districtAndCounty: ["临夏市", "临夏县", "韩集镇", "康乐县", "附城镇", "永靖县", "刘家峡镇", "广河县", "城关镇", "和政县", "城关镇", "东乡族自治县", "锁南坝镇", "积石山保安族东乡族撒拉族自治县", "吹麻滩镇"]
      }, {
        name: "甘南州",
        districtAndCounty: ["合作市", "临潭县", "城关镇", "卓尼县", "柳林镇", "舟曲县", "城关镇", "迭部县", "电尕镇", "玛曲县", "尼玛镇", "碌曲县", "玛艾镇", "夏河县", "拉卜楞镇"]
      }]
    }, {
      name: "青海省",
      city: [{
        name: "西宁市",
        districtAndCounty: ["城中区", "城东区", "城西区", "城北区", "大通回族土族自治县", "桥头镇", "湟源县", "城关镇", "湟中县", "鲁沙尔镇"]
      }, {
        name: "海东地区",
        districtAndCounty: ["平安县", "平安镇", "乐都县", "碾伯镇", "民和回族土族自治县", "川口镇", "互助土族自治县", "威远镇", "化隆回族自治县", "巴燕镇", "循化撒拉族自治县", "积石镇"]
      }, {
        name: "海北州",
        districtAndCounty: ["海晏县", "三角城镇", "祁连县", "八宝镇", "刚察县", "沙柳河镇", "门源回族自治县", "浩门镇"]
      }, {
        name: "海南州",
        districtAndCounty: ["共和县", "恰卜恰镇", "同德县", "尕巴松多镇", "贵德县", "河阴镇", "兴海县", "子科滩镇", "贵南县", "茫曲镇"]
      }, {
        name: "黄南州",
        districtAndCounty: ["同仁县", "隆务镇", "尖扎县", "马克唐镇", "泽库县", "泽曲镇", "河南蒙古族自治县", "优干宁镇"]
      }, {
        name: "果洛州",
        districtAndCounty: ["玛沁县", "大武镇", "班玛县", "赛来塘镇", "甘德县", "柯曲镇", "达日县", "吉迈镇", "久治县", "智青松多镇", "玛多县", "黄河乡"]
      }, {
        name: "玉树州",
        districtAndCounty: ["玉树县", "结古镇", "杂多县", "萨呼腾镇", "称多县", "称文镇", "治多县", "加吉博洛镇", "囊谦县", "香达镇", "曲麻莱县", "约改镇"]
      }, {
        name: "海西州",
        districtAndCounty: ["德令哈市", "格尔木市", "乌兰县", "希里沟镇", "都兰县", "察汗乌苏镇", "天峻县", "新源镇"]
      }]
    }, {
      name: "宁夏",
      city: [{
        name: "银川市",
        districtAndCounty: ["兴庆区", "金凤区", "西夏区", "灵武市", "永宁县", "杨和镇", "贺兰县", "习岗镇"]
      }, {
        name: "石嘴山市",
        districtAndCounty: ["大武口区", "惠农区", "平罗县", "城关镇"]
      }, {
        name: "吴忠市",
        districtAndCounty: ["利通区", "青铜峡市", "盐池县", "花马池镇", "同心县", "豫海镇"]
      }, {
        name: "固原市",
        districtAndCounty: ["原州区", "西吉县", "吉强镇", "隆德县", "城关镇", "泾源县", "香水镇", "彭阳县", "白阳镇"]
      }, {
        name: "中卫市",
        districtAndCounty: ["沙坡头区", "中宁县", "海原县"]
      }]
    }, {
      name: "新疆",
      city: [{
        name: "乌鲁木齐市",
        districtAndCounty: ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "东山区", "乌鲁木齐县", "乌鲁木齐市水磨沟区"]
      }, {
        name: "克拉玛依市",
        districtAndCounty: ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区"]
      }, {
        name: "自治区直辖县级行政单位",
        districtAndCounty: ["石河子市", "阿拉尔市", "图木舒克市", "五家渠市"]
      }, {
        name: "喀什地区",
        districtAndCounty: ["喀什市", "疏附县", "托克扎克镇", "疏勒县", "疏勒镇", "英吉沙县", "英吉沙镇", "泽普县", "泽普镇", "莎车县", "莎车镇", "叶城县", "喀格勒克镇", "麦盖提县", "麦盖提镇", "岳普湖县", "岳普湖镇", "伽师县", "巴仁镇", "巴楚县", "巴楚镇", "塔什库尔干塔吉克自治县", "塔什库尔干镇"]
      }, {
        name: "阿克苏地区",
        districtAndCounty: ["阿克苏市", "温宿县", "温宿镇", "库车县", "库车镇", "沙雅县", "沙雅镇", "新和县", "新和镇", "拜城县", "拜城镇", "乌什县", "乌什镇", "阿瓦提县", "阿瓦提镇", "柯坪县", "柯坪镇"]
      }, {
        name: "和田地区",
        districtAndCounty: ["和田市", "和田县", "墨玉县", "喀拉喀什镇", "皮山县", "固玛镇", "洛浦县", "洛浦镇", "策勒县", "策勒镇", "于田县", "木尕拉镇", "民丰县", "尼雅镇"]
      }, {
        name: "吐鲁番地区",
        districtAndCounty: ["吐鲁番市", "鄯善县", "鄯善镇", "托克逊县", "托克逊镇"]
      }, {
        name: "哈密地区",
        districtAndCounty: ["哈密市", "伊吾县", "伊吾镇", "巴里坤哈萨克自治县", "巴里坤镇"]
      }, {
        name: "克孜勒苏柯州",
        districtAndCounty: ["阿图什市", "阿克陶县", "阿克陶镇", "阿合奇县", "阿合奇镇", "乌恰县", "乌恰镇"]
      }, {
        name: "博尔塔拉州",
        districtAndCounty: ["博乐市", "精河县", "精河镇", "温泉县", "博格达尔镇"]
      }, {
        name: "昌吉州",
        districtAndCounty: ["昌吉市", "阜康市", "米泉市", "呼图壁县", "呼图壁镇", "玛纳斯县", "玛纳斯镇", "奇台县", "奇台镇", "吉木萨尔县", "吉木萨尔镇", "木垒哈萨克自治县", "木垒镇"]
      }, {
        name: "巴音郭楞州",
        districtAndCounty: ["库尔勒市", "轮台县", "轮台镇", "尉犁县", "尉犁镇", "若羌县", "若羌镇", "且末县", "且末镇", "和静县", "和静镇", "和硕县", "特吾里克镇", "博湖县", "博湖镇", "焉耆回族自治县", "焉耆镇"]
      }, {
        name: "伊犁州",
        districtAndCounty: ["伊宁市", "奎屯市", "伊宁县", "吉里于孜镇", "霍城县", "水定镇", "巩留县", "巩留镇", "新源县", "新源镇", "昭苏县", "昭苏镇", "特克斯县", "特克斯镇", "尼勒克县", "尼勒克镇", "察布查尔锡伯自治县", "察布查尔镇"]
      }, {
        name: "塔城地区",
        districtAndCounty: ["塔城市", "乌苏市", "额敏县", "额敏镇", "沙湾县", "三道河子镇", "托里县", "托里镇", "裕民县", "哈拉布拉镇", "和布克赛尔蒙古自治县", "和布克赛尔镇"]
      }, {
        name: "阿勒泰地区",
        districtAndCounty: ["阿勒泰市", "布尔津县", "布尔津镇", "富蕴县", "库额尔齐斯镇", "福海县", "哈巴河县", "青河县", "吉木乃县"]
      }]
    }, {
      name: "香港",
      city: [{
        name: "香港特别行政区",
        districtAndCounty: ["中西区", "东区", "九龙城区", "观塘区", "南区", "深水埗区", "湾仔区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "屯门区", "大埔区", "荃湾区", "元朗区"]
      }]
    }, {
      name: "澳门",
      city: [{
        name: "澳门特别行政区",
        districtAndCounty: ["澳门特别行政区"]
      }]
    }, {
      name: "台湾省",
      city: [{
        name: "台北",
        districtAndCounty: []
      }, {
        name: "高雄",
        districtAndCounty: []
      }, {
        name: "台中",
        districtAndCounty: []
      }, {
        name: "花莲",
        districtAndCounty: []
      }, {
        name: "基隆",
        districtAndCounty: []
      }, {
        name: "嘉义",
        districtAndCounty: []
      }, {
        name: "金门",
        districtAndCounty: []
      }, {
        name: "连江",
        districtAndCounty: []
      }, {
        name: "苗栗",
        districtAndCounty: []
      }, {
        name: "南投",
        districtAndCounty: []
      }, {
        name: "澎湖",
        districtAndCounty: []
      }, {
        name: "屏东",
        districtAndCounty: []
      }, {
        name: "台东",
        districtAndCounty: []
      }, {
        name: "台南",
        districtAndCounty: []
      }, {
        name: "桃园",
        districtAndCounty: []
      }, {
        name: "新竹",
        districtAndCounty: []
      }, {
        name: "宜兰",
        districtAndCounty: []
      }, {
        name: "云林",
        districtAndCounty: []
      }, {
        name: "彰化",
        districtAndCounty: []
      }]
    }]
      , p = {
      province: h
    }
      , v = i("365c")
      , g = i("d055")
      , y = i.n(g)
      , A = (i("ed08"),
      i("054f"))
      , b = i("c64e")
      , C = i.n(b);
    i("291a");
    const f = {
      labelCol: {
        xs: {
          span: 6
        },
        sm: {
          span: 6
        }
      },
      wrapperCol: {
        xs: {
          span: 12
        },
        sm: {
          span: 12
        }
      }
    }
      , w = ["avatar", "logo", "mch_name", "mch_des", "extend_url", "address", "mch_name", "admin_name", "def_mobile_number", "tel_number"]
      , x = Object(a["b"])({
      setup(t, e) {
        const {data: i} = Object(o["c"])(v["getMchInfo"])
          , {getFieldDecorator: n, setFieldsValue: c, validateFields: l, getFieldValue: m} = t.form
          , [h] = Object(o["b"])(v["updateMch"])
          , g = Object(a["j"])(!1)
          , b = Object(a["j"])(!1)
          , x = Object(a["j"])("")
          , j = Object(a["j"])(!1)
          , O = Object(a["j"])([0, 0, 0]);
        Object(a["k"])(()=>i.value, ()=>{
            if (i.value) {
              const {res: t} = i.value
                , {province: e, city: s, area: a} = t;
              if (e && s && a) {
                const t = p.province.findIndex(t=>t.name === e)
                  , i = p.province[t].city.findIndex(t=>t.name === s)
                  , n = p.province[t].city[i].districtAndCounty.findIndex(t=>t === a);
                O.value = [t, i, n]
              }
              t.extend_url && (j.value = !0,
                y.a.toDataURL(t.extend_url).then(t=>{
                    x.value = t
                  }
                ).catch(t=>{}
                ));
              const n = {};
              Object.keys(t).forEach(e=>{
                  "keywords" === e && t[e] && (n[e] = t[e].split(",")),
                  t[e] && w.includes(e) && (n[e] = t[e])
                }
              ),
                c(n)
            }
          }
        );
        const _ = Object(a["a"])(()=>p.province[O.value[0]].city)
          , k = Object(a["a"])(()=>_.value[O.value[1]].districtAndCounty)
          , S = t=>{
            const e = [t, 0, 0];
            O.value = e
          }
          , M = t=>{
            const e = [...O.value];
            e[1] = t,
              e[2] = 0,
              O.value = e
          }
          , R = t=>{
            const e = [...O.value];
            e[2] = t,
              O.value = e
          }
        ;
        Object(a["k"])(()=>O.value, ()=>{
            const [t,e,i] = O.value;
            setTimeout(()=>{
                c({
                  location: `${p.province[t].name} ${_.value[e].name} ${k.value[i]}`
                })
              }
              , 100)
          }
        );
        const I = ()=>{
            l((t,i)=>{
                var a;
                if (t)
                  return;
                const n = Object(s["a"])({}, i)
                  , {location: r} = n;
                delete n.location;
                const [o,c,d] = r.split(" ");
                n.province = o,
                  n.city = c,
                  n.area = d,
                  n.keywords = null === (a = n.keywords) || void 0 === a ? void 0 : a.join(),
                  h({
                    variables: n,
                    update() {
                      e.root.$message.success("操作成功"),
                        window.location.reload()
                    }
                  })
              }
            )
          }
        ;
        return ()=>{
          var t;
          return Object(a["c"])("div", {
            class: "mch-settings"
          }, [Object(a["c"])("div", {
            class: "page-title"
          }, ["基本设置"]), Object(a["c"])("div", {
            class: "settings-wrapper bg-white mt-30"
          }, [Object(a["c"])("div", {
            class: "setting-header px-20 py-12"
          }, [Object(a["c"])("span", {
            class: "ml-10"
          }, ["商家信息"])]), Object(a["c"])("div", {
            class: "setting-body py-40"
          }, [Object(a["c"])("a-form", {
            attrs: {
              labelCol: f.labelCol,
              wrapperCol: f.wrapperCol
            }
          }, [Object(a["c"])("a-form-item", {
            attrs: {
              label: "头像："
            }
          }, [n("logo", {
            rules: [{
              required: !0,
              message: "请上传头像"
            }]
          })(Object(a["c"])("a-upload", {
            attrs: {
              showUploadList: !1,
              name: "file",
              accept: ".svg,.png,.jpg,.jpeg",
              multiple: !1,
              data: {
                type: "image"
              },
              beforeUpload: t=>"image/svg+xml" === t.type && t.size >= 512e3 ? (e.root.$message.error("SVG格式的图片不得大于500KB"),
                !1) : t.size >= 5242880 ? (e.root.$message.error("此图片不得大于5MB"),
                !1) : void 0,
              customRequest: async t=>{
                let i = t.file.name.substring(t.file.name.lastIndexOf(".") + 1, t.file.name.length);
                const s = "avatar";
                let a = C()() + "." + i
                  , n = await A["a"].putFile(t.file, {
                  xapi: s,
                  rename: a,
                  type: "image"
                });
                c({
                  logo: n.data.url
                }),
                0 !== n.errno && (e.root.$message.error(n.errmsg),
                  A["a"].removeStorage())
              }
            }
          }, [Object(a["c"])("div", {
            class: "head-avatar text-pointer",
            on: {
              mousemove: ()=>{
                g.value = !0
              }
              ,
              mouseleave: ()=>{
                g.value = !1
              }
            }
          }, [g.value ? Object(a["c"])("div", {
            class: "avatar-preview"
          }, [Object(a["c"])("div", [Object(a["c"])("img", {
            attrs: {
              src: d.a,
              alt: ""
            }
          }), Object(a["c"])("div", ["上传图片"])])]) : "", Object(a["c"])("img", {
            class: "avatar",
            attrs: {
              src: m("logo") || "https://cdn.baoxiaohe.com/7bb738b3-3c05-4a06-bbac-4616cacd26e6.png",
              alt: ""
            }
          })])]))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "名称:"
            }
          }, [n("mch_name", {
            rules: [{
              required: !0,
              message: "请输入名称"
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "介绍："
            }
          }, [n("mch_des", {})(Object(a["c"])("a-textarea", {
            attrs: {
              "allow-clear": !0
            },
            style: "width:560px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "关键词："
            }
          }, [n("keywords", {})(Object(a["c"])("a-select", {
            attrs: {
              mode: "tags",
              tokenSeparators: [","]
            },
            style: "width:560px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "推广地址：",
              help: "设置后不可变更"
            }
          }, [n("extend_url", {})(Object(a["c"])("a-input", {
            style: "width:560px",
            attrs: {
              placeholder: "http://",
              disabled: j.value
            }
          }))]), x.value ? Object(a["c"])("a-form-item", {
            attrs: {
              label: "推广二维码："
            },
            class: "pt-10"
          }, [Object(a["c"])("div", {
            class: "qrcode-wrapper",
            on: {
              mousemove: ()=>b.value = !0,
              mouseleave: ()=>{
                b.value = !1
              }
            }
          }, [Object(a["c"])("transition", {
            attrs: {
              name: "fade"
            }
          }, [b.value ? Object(a["c"])("div", {
            class: "qrcode-preview flex item-center flex-center",
            on: {
              click: ()=>{
                const t = document.createElement("a");
                t.href = x.value,
                  t.setAttribute("download", "推广二维码"),
                  t.click()
              }
            }
          }, [Object(a["c"])("div", [Object(a["c"])("img", {
            attrs: {
              src: u.a,
              alt: ""
            }
          }), Object(a["c"])("div", ["下载二维码"])])]) : ""]), Object(a["c"])("div", {
            class: "qrcode"
          }, [Object(a["c"])("img", {
            attrs: {
              src: x.value,
              alt: ""
            }
          })])])]) : "", Object(a["c"])("a-form-item", {
            attrs: {
              label: "客服电话："
            }
          }, [n("tel_number", {
            rules: [{
              required: !0,
              message: "请输入客服电话"
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "所在地址："
            }
          }, [Object(a["c"])("div", {
            class: "flex",
            style: "height:36px"
          }, [n("location", {
            rules: [{
              required: !0,
              message: "请输入所在地址"
            }]
          })(Object(a["c"])("div", {
            class: "flex"
          }, [Object(a["c"])("a-select", {
            attrs: {
              value: O.value[0]
            },
            style: "width: 90px",
            on: {
              change: S
            }
          }, [p.province.map((t,e)=>Object(a["c"])("a-select-option", {
            key: e
          }, [t.name]))]), Object(a["c"])("a-select", {
            attrs: {
              value: O.value[1]
            },
            style: "width: 90px",
            on: {
              change: M
            }
          }, [_.value.map((t,e)=>Object(a["c"])("a-select-option", {
            key: e
          }, [t.name]))]), Object(a["c"])("a-select", {
            attrs: {
              value: O.value[2]
            },
            style: "width: 90px",
            on: {
              change: R
            }
          }, [k.value.map((t,e)=>Object(a["c"])("a-select-option", {
            key: e
          }, [t]))])])), Object(a["c"])("a-form-item", {
            style: "margin-top:-2px"
          }, [n("address", {
            rules: [{
              required: !0,
              message: "请输入所在地址"
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px;margin-left:10px"
          }))])])]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "主体信息："
            }
          }, [n("mch_name", {
            rules: [{
              required: !0,
              message: "请输入主体信息"
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "管理员："
            }
          }, [n("admin_name", {
            rules: [{
              required: !0,
              message: "请输入管理员"
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px"
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "登录账号："
            }
          }, [n("def_mobile_number", {
            rules: [{
              required: !0
            }]
          })(Object(a["c"])("a-input", {
            style: "width:280px",
            attrs: {
              disabled: !0
            }
          }))]), Object(a["c"])("a-form-item", {
            attrs: {
              label: "商家ID："
            }
          }, [Object(a["c"])("div", {
            class: "flex item-center"
          }, [Object(a["c"])("span", [null === (t = i.value) || void 0 === t ? void 0 : t.res.mch_no]), Object(a["c"])("img", {
            attrs: {
              src: r.a,
              alt: ""
            },
            class: "copy-icon ml-10",
            on: {
              click: ()=>{
                var t;
                e.copyText(null === (t = i.value) || void 0 === t ? void 0 : t.res.mch_no).then(()=>{
                    e.root.$message.success("复制成功")
                  }
                )
              }
            }
          })])])])])]), Object(a["c"])("div", {
            class: "settings-bottom flex item-center flex-center"
          }, [Object(a["c"])("a-button", ["取消"]), Object(a["c"])("a-button", {
            class: "ml-20",
            attrs: {
              type: "primary"
            },
            on: {
              click: I
            }
          }, ["确认"])])])
        }
      }
    });
    e["default"] = m["Form"].create({})(x)
  },
  "0eaf": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/union.96d592cf.png"
  },
  "0f7b": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = i("750b")
      , a = i("8d87");
    i("4873");
    e["default"] = Object(s["b"])({
      props: {
        title: {
          type: String,
          default: "测试"
        },
        menus: {
          type: [Object, Array],
          default: ()=>[]
        }
      },
      setup(t, e) {
        const {title: i} = t
          , n = Object(s["a"])(()=>t.menus.reduce((t,e)=>t && e.active, !0))
          , r = Object(s["a"])(()=>!t.menus.find(t=>t.active));
        return ()=>{
          var o;
          return Object(s["c"])("div", {
            class: "rail-container"
          }, [Object(s["c"])("div", {
            class: "flex"
          }, [Object(s["c"])("div", {
            class: "rail-title"
          }, [i, ":"]), Object(s["c"])("div", {
            class: "flex item-center flex-wrap"
          }, [Object(s["c"])(a["default"], {
            attrs: {
              type: "box",
              active: null !== (o = r.value) && void 0 !== o ? o : n.value
            },
            class: "ml-8 flex-item",
            on: {
              click: ()=>{
                e.emit("selectAll")
              }
            }
          }, ["全部"]), t.menus.map((t,i)=>Object(s["c"])(a["default"], {
            attrs: {
              type: "box",
              active: t.active
            },
            class: "ml-8 flex-item",
            on: {
              click: ()=>{
                e.emit("selectOne", {
                  target: t,
                  index: i
                })
              }
            },
            key: i
          }, [t.tag_name, t.active && Object(s["c"])("a-icon", {
            attrs: {
              type: "close"
            },
            class: "ml-8"
          })]))])])])
        }
      }
    })
  },
  "112a": function(t, e, i) {},
  1151: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = i("5530")
      , a = i("750b")
      , n = i("0f7b")
      , r = i("365c")
      , o = i("3ccf");
    i("013d");
    e["default"] = Object(a["b"])({
      setup(t, e) {
        const {loading: i, data: c} = Object(o["c"])(r["getTempMenus"])
          , d = Object(a["j"])([])
          , l = Object(a["j"])([]);
        Object(a["k"])(()=>c.value, ()=>{
            var t;
            d.value = (null === (t = c.value) || void 0 === t ? void 0 : t.map(t=>Object(s["a"])(Object(s["a"])({}, t), {}, {
              children: t.children.map(t=>Object(s["a"])(Object(s["a"])({}, t), {}, {
                active: !1
              }))
            }))) || []
          }
          , {
            lazy: !0
          }),
          Object(a["k"])(()=>l.value, ()=>{
              e.emit("change", l.value.join())
            }
            , {
              lazy: !0
            });
        const u = ()=>{
            var t;
            return null === (t = d.value) || void 0 === t ? void 0 : t.map((t,e)=>Object(a["c"])(n["default"], {
              attrs: {
                title: t.cate_name,
                menus: t.children
              },
              key: e,
              on: {
                selectAll: ()=>{
                  d.value[e].children = d.value[e].children.map(t=>(l.value = l.value.filter(e=>e !== t.id),
                    Object(s["a"])(Object(s["a"])({}, t), {}, {
                      active: !1
                    })))
                }
                ,
                selectOne: ({_: t, index: i})=>{
                  d.value[e].children[i].active = !d.value[e].children[i].active;
                  const s = d.value[e].children[i];
                  s.active ? l.value.push(s.id) : l.value = l.value.filter(t=>t !== s.id)
                }
              }
            }))
          }
        ;
        return ()=>Object(a["c"])("a-spin", {
          attrs: {
            spinning: i.value
          }
        }, [Object(a["c"])("div", {
          class: "template-header"
        }, [u()])])
      }
    })
  },
  "15a9": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/vip.9af22611.svg"
  },
  "1f8e": function(t, e, i) {},
  2557: function(t, e, i) {},
  "267e": function(t, e, i) {},
  "2c2d": function(t, e, i) {},
  "354d": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/check.0644668e.svg"
  },
  3613: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAB4AAAAcCAYAAAB2+A+pAAABlUlEQVRIS+3Wv05UURDH8c9qUEiMRhriA1ABtUhsjVQ0UNkYKaCQFwIbLSHyAPinVCkJ0BAbEwiJJBQYo9KAmeTcZL3h7p57d802nPbMud+Z38ydmZYBndaAuKrADzBK5X0nf89xhN+djK4CP8Vkj0r8wVt8r/pOGRyRPsMJdnDZwIF7mMY3bOaCJzCLd9hrAC2eLOMCr3LBIXFIvYX9HsBL6e3aIMFjWMABPhSOlHNcFfF93KnwPurgOElbmLRHfBfz6S95jdMwygEPYQU3Oki/jU9t92WpZ/AIGzjMBYfdk+TxVeyI+EvxwWTQN3DdOrsGN8rxTbxAdKSqHL8vNZy+SB3g54hfquoEePd/VPV1cXVToHaOxzGHcifqBmq/v42YTmd4ky66VvUIFjGMnw3ncbyNNhvd7HMuOOximjzucfX5mlSLmRyna8R1JK1j2wgcCsTi9qMOqWQbCj7EeloEs7bIl/iVBnkTdjSgKdzCarF95uzV/dg6I9cf27tbDrgouPC4yYl5HVvHP3t2LrgJsOObv9dBfR1nurJIAAAAAElFTkSuQmCC"
  },
  "374a": function(t, e, i) {},
  "37dc": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/bg3.02795bb8.jpg"
  },
  "39e4": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("a-modal", {
        attrs: {
          title: t.title + "建议给设计方案取个名",
          footer: null
        },
        model: {
          value: t.visible,
          callback: function(e) {
            t.visible = e
          },
          expression: "visible"
        }
      }, [i("rename", {
        ref: "renameRef",
        attrs: {
          showSubmit: !0,
          "project-name": t.$root.projectData.project_name,
          trademark: t.$root.projectData.extend_attrs ? t.$root.projectData.extend_attrs.trademark : "",
          "product-name": t.$root.projectData.extend_attrs ? t.$root.projectData.extend_attrs.productName : ""
        },
        on: {
          nameChanged: t.handleNameChanged
        }
      })], 1)
    }
      , a = []
      , n = i("f2a2")
      , r = {
      components: {
        Rename: n["default"]
      },
      data() {
        return {
          visible: !1,
          purpose: ""
        }
      },
      methods: {
        show(t) {
          this.visible = !0,
            this.purpose = t
        },
        handleNameChanged() {
          this.visible = !1,
            this.$emit("navigate", this.purpose)
        }
      },
      computed: {
        title() {
          const t = {
            share: "分享",
            render: "渲染"
          };
          return t[this.purpose] ? t[this.purpose] + "前" : ""
        }
      }
    }
      , o = r
      , c = i("2877")
      , d = Object(c["a"])(o, s, a, !1, null, null, null);
    e["default"] = d.exports
  },
  "3ba3": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/vipp.a4c21068.svg"
  },
  "3d70": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/t1.18316d47.svg"
  },
  "3f0b": function(t, e, i) {
    "use strict";
    var s = i("267e")
      , a = i.n(s);
    a.a
  },
  "403c": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , s = t._self._c || e;
      return s("div", {
        staticClass: "vip-convert-container"
      }, [s("div", {
        staticClass: "flex flex-end item-center",
        staticStyle: {
          height: "1px"
        },
        on: {
          click: function(e) {
            return t.$router.push("/vip")
          }
        }
      }, [s("img", {
        staticClass: "mt-40 pointer",
        attrs: {
          src: i("3ba3"),
          height: "16px",
          alt: ""
        }
      }), s("div", {
        staticClass: "fo-14 fo-white ml-4 mt-40 mr-16 pointer"
      }, [t._v("查看会员权益")])]), s("header-bg", {
        attrs: {
          title: "包小盒VIP会员卡激活"
        }
      }), s("div", {
        staticClass: "flex flex-center item-center"
      }, [s("div", {
        staticClass: "gold-bg-convert"
      }, [t.user.nick_name ? s("div", {
        staticClass: "gold-bg-convert-unlogin"
      }, [s("div", {
        staticClass: "fo-p-active fo-16"
      }, [t._v("您好，" + t._s(t.user.nick_name) + "(ID:" + t._s(t.user.user_id) + ")")]), s("div", {
        staticClass: "fo-16 fo-p-active bold",
        staticStyle: {
          "margin-top": "60px"
        }
      }, [t._v(" 激活码： ")]), s("a-input", {
        staticClass: "mt-12",
        staticStyle: {
          height: "40px"
        },
        attrs: {
          placeholder: "输入激活码"
        },
        on: {
          input: t.convertInput
        },
        model: {
          value: t.convert_code,
          callback: function(e) {
            t.convert_code = e
          },
          expression: "convert_code"
        }
      }), s("div", {
        staticClass: "fo-14 fo-p-active mt-12"
      }, [t._v("请输入 XXXX-XXXX-XXXX-XXXX 16位激活码")]), s("a-button", {
        style: {
          color: "#6B4D1B",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)",
          marginTop: "30px"
        },
        attrs: {
          size: "large",
          loading: t.loading,
          block: ""
        },
        on: {
          click: t.convertCode
        }
      }, [t._v("立即激活")])], 1) : s("div", {
        staticClass: "gold-bg-convert-unlogin flex flex-center item-center"
      }, [s("div", {
        staticClass: "text-center"
      }, [s("img", {
        attrs: {
          src: i("15a9"),
          alt: ""
        }
      }), s("div", {
        staticClass: "fo-p-active fo-16 mt-30"
      }, [t._v(" 激活会员卡，请先 "), s("a", {
        staticClass: "bold fo-p-active",
        on: {
          click: t.showLoginModal
        }
      }, [t._v("登录/注册")]), t._v(" 需要兑换VIP的账号 ")])])])]), t._m(0)]), s("success", {
        attrs: {
          title: t.title,
          order_id: t.orderId,
          showget: !0
        },
        model: {
          value: t.showSuccess,
          callback: function(e) {
            t.showSuccess = e
          },
          expression: "showSuccess"
        }
      })], 1)
    }
      , a = [function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("div", {
        staticClass: "black-bg-convert fo-white"
      }, [i("div", {
        staticClass: "fo-16"
      }, [t._v("使用须知：")]), i("div", {
        staticClass: "fo-14 mt-10"
      }, [i("p", [t._v("① 登录包小盒账号后，输入激活码即可激活VIP；")]), i("p", [t._v(" ② 激活成功后立即升级为包小盒VIP，按照会员消耗顺序享受包小盒VIP服务 (本VIP不包含会员限时专享或附赠权益)； ")]), i("p", [t._v("③ 此卡不支持开发票，不支持退款，请妥善保管，遗失、泄漏、绑错账号等 不补；")]), i("p", [t._v("④ 本VIP会员最终解释权归包小盒所有。")])])])
    }
    ]
      , n = (i("5319"),
      i("5530"))
      , r = i("5880")
      , o = i("bc11")
      , c = i("2ae1")
      , d = i("365c")
      , l = i("b6c6")
      , u = {
      components: {
        headerBg: o["default"],
        success: c["default"]
      },
      data() {
        return {
          convert_code: "",
          loading: !1,
          showSuccess: !1,
          title: "",
          orderId: ""
        }
      },
      computed: Object(n["a"])({}, Object(r["mapState"])("profile", ["user"])),
      methods: {
        showLoginModal() {
          this.$store.commit("profile/" + l["c"], !0)
        },
        convertCode() {
          "" !== this.convert_code ? (this.loading = !0,
            Object(d["convertVip"])({
              convert_code: this.convert_code
            }).then(t=>{
                200 === t.code && (this.orderId = t.data.order_id,
                  this.title = t.msg,
                  this.showSuccess = !0,
                  this.$store.dispatch("profile/fetchUserInfo"))
              }
            ).finally(()=>{
                this.convert_code = "",
                  this.loading = !1
              }
            )) : this.$message.error("请输入激活码")
        },
        convertInput(t) {
          if ("insertText" === t.inputType) {
            let e = t.target.value;
            e = e.replace(/-/g, ""),
            e.length >= 4 && (e = e.slice(0, 4) + "-" + e.slice(4)),
            e.length >= 9 && (e = e.slice(0, 9) + "-" + e.slice(9)),
            e.length >= 14 && (e = e.slice(0, 14) + "-" + e.slice(14)),
            e.length > 19 && (e = e.substring(0, 19)),
              this.convert_code = e.toUpperCase()
          }
        }
      }
    }
      , m = u
      , h = (i("3f0b"),
      i("2877"))
      , p = Object(h["a"])(m, s, a, !1, null, null, null);
    e["default"] = p.exports
  },
  4873: function(t, e, i) {},
  "4c35": function(t, e, i) {},
  5108: function(t, e, i) {},
  5613: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACgAAAAoCAYAAACM/rhtAAAHFklEQVRYR82YfUxWVRzHz7n3eX/lRV58UFFDCjVpwxCUtJSS5QuVyDBfGhtK09CsNl1rpVtb2WqGmRNfxqgYTHGJaGOGlIaiplugQUNNIEHgkbfn7T5v9552btzHy9PzPOdC2br/PPc55/fyud97zu+ceyAY/wXH6IrGaM+bS0kixWY8uQWfkOChkj9qMP+HCgjqD/FfQwVT3gcrBvq/wI169RhqvGBj9Rv3JBlLolG2g4ODk/V6/RII4WMAgFgIYSx+fIRQDwCgByF0x2q1ngsPD//D711KhpWqoA+sv78/LiwsbAtFUcsBALMkTt8WjuNqhoaGvoyMjOwS+RBBSYA+MIvFkqDVandQFLUOAKCQCOZv5uY4rtxut+8xGAy3pICGAuThSkpK6IKCgrcpitoFAFCOE8zfzcVx3K4jR458VlhYyI50Bi0zQUvN8PDwdL1e/w2EcN6/BDYqDELoqtVqXWc0Gu8EU9NfQR+s3W5P0Wg0pwEA0Y8CThTTzDDMco1Gcy0QpBjQB+d0Op9XKpVVAAAdCQ4h1Oh2u0/YbLaG+/fvd2P7iRMnmnQ6XYZCociBEKaRYgAAbC6XK0elUn3vDykA+uAcDkeqWq2uBwCoQwVGCLXbbLYig8FwNpSdxWJ5QafTfQEhnEoAdTIMs1ij0VwRQ2IwSmjo6emJj4mJaQQAxBDgLjY0NKxeuHBhvwR1wIULFyIzMjKOQwgXEOx7e3t702NjYzsEOx/gsWPHlDk5OVcghE8S4G7X19dnZGZmDort9u3bp8rLy5uD2yorK5u3bt3qFPfX1dWFL168uAFCmECIf6Oqqmpebm6uC9sJgJBl2V0URb1HUsRsNi+Kjo72vYbq6uqwZcuWfUrTdB4AQDbi72VZtvLMmTPvZGdnDwkx+/r65kVFRZ0n5eA47kOapnFZQxiQttlss7Va7c8AAHkoZ5Zlz8hkslWCzeXLl6NSU1MbIYSTAvkhhO5dvXo1PS0tzSz0e73eEzRNLyNAeux2+9M6ne4mD8hx3DkI4SLSk1kslvVGo/G4KFklTdMvER7qpEwmw+ry1/DwcK7BYPiKlAshdJ6iqCXQ4XAsUKvVDSQH3N/Y2Dhp/vz5D/B9S0vLlKSkpDYpfq2trYkzZ87sxLaXLl2akJ6efk+KH8MwGRAv4hBCvPCTLheE0ChS4mWDwVBBcsL9FotljdFo/FawRQgNS1k2EUKnMWAzaeaOBLZCCKOEJHa7fb1GozksBdDhcGzUarVfiwDxmNSTfBFCNyDDMBtUKlUZyRj3Hz16NLKgoMCO7zs6OmZPmTJFvDwFDdHZ2Tk3Pj7+JjYoKyvTbdiwgR8mpMvpdL4Gi4qKlMXFxb9JqPRgYGAgKzIy8kcceMWKFXR1dfU1CGFSqEQIodbs7Oy5NTU1/K6lv7//2YiIiFoSHF6ptm3b9gSexTKGYXJVKlU5ycnj8ZQoFIptgl1XV1eKyWTCdU2of/4hvN3d3Yvi4uKuCx1ut7tYLpcXknIxDPOqRqM5zgPigu31ek/SNP0iwZFpbm6elZyczG8K8PXgwYMFERERhyGE08W+CKHfBwYGNk6YMOGi0N7U1GSaM2fOr6R1nmXZ72QyGS5ffKHmAdva2ibPmDHjF9LgZVn2dEJCwur29nbfBvPAgQOaNWvWPKNSqVIwjNPpvF5RUfHT5s2bHQLc1KlT4e3bt6skFGnrrVu3nkpMTMTfMQ8BcSCr1bpCp9PhQuzbQARS1OPxFCcmJu4UQ4ZSHsO1tbV9LJfLfcMjiD1ns9lW6/X6mpH+0YBYSZfL9ZZCofiINEZYlj1RV1dXlJWVNRDKtra2NiIzM3M/TdOvkGK63e53lUrlZ1g5f0D837d59Xq9xTRNv04KCAAYcrvd+7u7u09MmzatVWx/9+7dJJPJtEqhULwBAAgjxWJZ9qBMJhMUxoA8JL8Wi+GED3mXy7VboVDsJAUW9Q8ghPjJAyE0AQAipPq63e49SqXyfUE10e9fuxnR6YKws+Z/nU7nFqVS+UmIMiKVIZid1+Vy7VCpVPsDwOEmH6Cg5t9+e3t7U6KiokohhI//Uxq/MtRmNpvzY2JihNXIN+7EsL4N60jjKAUFZUtKStT5+fkfyOVyPC5DfqtIeAjG4/EcLC0t3V1YWMgEU048SYSSEhBOfLjU1NQUnZSU9KZcLt9EqpcBQG14JWptbf08OTm5T9QfUDnxJBHXvGCQ4lcPysvLtStXrnxOrVYvpShqKYRwcoDaiRBCnRzHnWUYpvbUqVM/rF27lt9o+KnGj7UgSvpKi/h0wR9yFFyg47pNmzbJtm/fHh0eHs6fbg0ODvbs3bu379ChQ94ASoqPOALdj2oL+OEeYFb7Qwp5/Y9Ngg3BQOcuRDghaSD1QqkmFUoKLEnNh6uHKFow4PGqSFJPPAb978GfrKymrp2emkUAAAAASUVORK5CYII="
  },
  "5bec": function(t, e, i) {},
  "5da9": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("div", {
        staticClass: "mode3d-container",
        style: {
          width: this.twidth + "px",
          height: this.theight + "px"
        }
      }, [i("a-spin", {
        directives: [{
          name: "show",
          rawName: "v-show",
          value: !t.sceneReady,
          expression: "!sceneReady"
        }],
        staticStyle: {
          position: "absolute",
          top: "50%",
          left: "50%",
          transform: "translate(-50%, -50%)"
        }
      }, [i("a-icon", {
        staticStyle: {
          "font-size": "24px"
        },
        attrs: {
          slot: "indicator",
          type: "loading",
          spin: ""
        },
        slot: "indicator"
      })], 1), i("canvas", {
        staticStyle: {
          position: "absolute",
          "z-index": "0"
        },
        attrs: {
          id: "mode3d"
        }
      })], 1)
    }
      , a = []
      , n = (i("ddb0"),
      i("5530"))
      , r = i("5880")
      , o = i("60bb")
      , c = i.n(o)
      , d = i("5fda")
      , l = i("87a0")
      , u = (i("2532"),
      i("1276"),
      i("2ca0"),
      i("5cc6"),
      i("b39a"),
      i("da71"))
      , m = i("34ad")
      , h = i("ed08")
      , p = i("c890")
      , v = i("6881")
      , g = i("054f")
      , y = i("5a0c")
      , A = i.n(y)
      , b = i("c64e")
      , C = i.n(b)
      , f = {
      data() {
        return {
          animator: null,
          sceneReady: !1,
          camera: null,
          renderer: null,
          controls: null,
          group: null,
          allGroup: null,
          textureGroup: null,
          timeout: null,
          lights: [],
          notEdit: !1,
          main_material: null,
          outside_material: null,
          inside_material: null,
          insideCanvasTexture: null,
          outsideCanvasTexture: null,
          gildingCanvasTexture: null,
          bumpCanvasTexture: null,
          roughnessCanvasTexture: null,
          rendering: !1,
          drawList: [],
          line_list: {},
          img_list: [],
          huabu_size: {
            x: 0,
            y: 0,
            z: 0
          },
          canvas_list: {
            outside: {
              material: null,
              canvas: document.createElement("canvas")
            },
            inside: {
              material: null,
              canvas: document.createElement("canvas")
            },
            gilding: {
              material: null,
              canvas: document.createElement("canvas")
            },
            bump: {
              material: null,
              canvas: document.createElement("canvas")
            },
            roughness: {
              material: null,
              canvas: document.createElement("canvas")
            }
          },
          twidth: this.width,
          theight: this.height,
          tsize: this.size,
          playtime: 1,
          intl: null,
          knife: {},
          is_inverse: !1,
          openRotate: !1
        }
      },
      props: {
        animationInterval: {
          type: Number,
          default: 15
        },
        showRecord: {
          type: Boolean
        }
      },
      computed: Object(n["a"])(Object(n["a"])(Object(n["a"])(Object(n["a"])(Object(n["a"])({}, Object(r["mapState"])("editor-v2", ["project_data", "knife_data", "is_outside", "element_craft_list", "d3_window_option", "show_d3_window"])), Object(r["mapState"])(["reloadMode", "knifeVersion", "projectVersion"])), Object(r["mapGetters"])("editor-v2", ["inside_designs_loaded", "outside_designs_loaded", "isCup"])), Object(r["mapGetters"])("profile", ["isVip"])), {}, {
        crafts() {
          return this.element_craft_list
        },
        modelScale() {
          return p["a"].modelScale(this.knife.size)
        },
        ratio() {
          const t = 500
            , e = 40;
          return this.d3_window_option.is_fullscreen ? t : Math.min(Math.max(this.d3_window_option.width / 1289 * t, e), t)
        },
        rx() {
          return this.ratio * this.modelScale
        },
        ry() {
          return this.ratio * this.modelScale
        },
        backgroundImageCanvasWidth() {
          return 200 / u["DPI"] * this.rx
        },
        backgroundImageCanvasHeight() {
          return 200 / u["DPI"] * this.ry
        }
      }),
      mounted() {
        this.showRecord && this.$bus.$on("getRenderGlb", async()=>{
            this.$bus.$emit("emitRenderGlb", await this.exportGLB())
          }
        )
      },
      methods: {
        async exportGLB() {
          const t = {
            embedImages: !0,
            truncateDrawRange: !1,
            forceIndices: !0,
            binary: !0,
            maxTextureSize: 4096,
            onlyVisible: !1
          }
            , e = new h["a"]
            , i = this.knife.transform;
          this.group.scale = new d["Vector3"](1 / this.modelScale,1 / this.modelScale,1 / this.modelScale),
            this.group.position.set(i.position.x / this.modelScale, i.position.y / this.modelScale, i.position.z / this.modelScale),
            this.group.updateMatrix(),
            this.group.scale = new d["Vector3"](.01,.01,.01),
            this.group.position.set(.01 * i.position.x, .01 * i.position.y, .01 * i.position.z),
            this.group.updateMatrix();
          const s = [this.group];
          return new Promise(a=>{
              e.parse(s, async t=>{
                  const e = new Blob([t],{
                    type: "application/octet-stream"
                  });
                  e.lastModifiedDate = new Date;
                  const s = C()();
                  e.name = s + ".glb",
                    this.group.scale = new d["Vector3"](100,100,100),
                    this.group.position.set(100 * i.position.x, 100 * i.position.y, 100 * i.position.z),
                    this.group.updateMatrix(),
                    this.group.scale = new d["Vector3"](this.modelScale,this.modelScale,this.modelScale),
                    this.group.position.set(i.position.x * this.modelScale, i.position.y * this.modelScale, i.position.z * this.modelScale),
                    this.group.updateMatrix();
                  const n = await g["a"].putFile(e, {
                    xapi: "glb",
                    rename: A()().format("YYYYMMDD") + "/" + e.name,
                    type: "glb"
                  });
                  n && n.data && n.data.url ? a(n.data.url) : this.$message.error("上传模型失败")
                }
                , t)
            }
          )
        },
        doRotate(t) {
          this.openRotate = t
        },
        async init() {
          this.timeout || (this.timeout = setInterval(()=>this.drawMapAll(), 1e3)),
            this.initRenderer(),
            this.initCamera(),
            this.initControls(),
            this.initScene(),
            this.initLight(),
            this.initCanvas(),
            this.setupTextures(),
            this.isCup ? await this.setupSceneForCup() : this.setupScene(),
            this.accumulateRotations(),
            this.sceneReady = !0,
          "true" === this.$route.query.showCanvas && (localStorage.setItem("showDevCanvas", "1"),
            this.showCanvas(!0))
        },
        showCanvas(t) {
          ["outside", "inside", "gilding", "bump", "roughness"].forEach((e,i)=>{
              const s = e + "-canvas"
                , a = this.canvas_list[e].canvas;
              a && ("outside" === e ? (a.style.left = 0,
                a.style.bottom = 0,
                a.style.width = "100mm",
                a.style.height = this.knife_data.totalY / this.knife_data.totalX * 100 + "mm") : (a.style.width = "64px",
                a.style.height = this.knife_data.totalY / this.knife_data.totalX * 64 + "px",
                a.style.left = 300 + 80 * i + "px",
                a.style.top = "60px"),
                a.style.position = "fixed",
                a.style.zIndex = 1e4,
                a.style.display = t ? "block" : "none",
                a.style.outline = "1px solid red",
                a.setAttribute("id", s),
                a.setAttribute("class", "J_dev_canvas"),
                document.body.append(a))
            }
          )
        },
        initRenderer() {
          if (this.renderer)
            return;
          // todo @zj
          const t = document.getElementById("mode3d");
          this.renderer = new d["WebGLRenderer"]({
            canvas: t,
            antialias: !0,
            alpha: !0,
            preserveDrawingBuffer: !0
          }),
            this.renderer.setSize(this.twidth, this.theight)
        },
        initCamera() {
          this.camera || (this.camera = new d["PerspectiveCamera"](45,this.twidth / this.theight,1,500),
            this.camera.position.set(3, 8, 13))
        },
        initCanvas() {
          const t = ["inside", "outside", "gilding", "roughness"];
          for (const e of t) {
            const t = this.canvas_list[e].canvas;
            t.width = 64,
              t.height = 64
          }
        },
        initControls() {
          this.controls || (this.controls = new h["b"](this.camera,this.renderer.domElement),
            this.controls.enableDamping = !0,
            this.controls.dampingFactor = .05,
            this.controls.minDistance = 4,
            this.controls.maxDistance = 20)
        },
        initScene() {
          this.scene || (this.scene = new d["Scene"],
            this.$root.scene = this.scene,
            this.initWatermark())
        },
        initWatermark() {
          this.isVip ? this.clearWatermark() : this.showRecord ? this.setWatermark() : this.clearWatermark()
        },
        setWatermark() {
          const t = document.createElement("canvas");
          t.width = this.width,
            t.height = this.height;
          const e = t.getContext("2d");
          e.fillStyle = "#F0F1F5",
            e.fillRect(0, 0, this.width, this.height);
          const s = new Image;
          s.src = i("ac55"),
            s.onload = ()=>{
              e.drawImage(s, this.width - 137 - 20, 20, 137, 44),
                this.scene.background = new d["CanvasTexture"](t)
            }
        },
        clearWatermark() {
          this.scene.background = new d["Color"]("#F0F1F5")
        },
        initLight() {
          if (this.lights && this.lights.length > 0)
            return;
          this.scene.add(new d["AmbientLight"](16777215,.8));
          const t = new d["DirectionalLight"](16777215,.1);
          t.position.set(-20, 20, 20),
            t.castShadow = !0,
            t.shadow.mapSize.width = 1024,
            t.shadow.mapSize.height = 1024;
          const e = new d["DirectionalLight"](16777215,.1);
          e.position.set(20, 20, 20),
            e.castShadow = !0,
            e.shadow.mapSize.width = 1024,
            e.shadow.mapSize.height = 1024,
            this.lights = [t, e];
          for (const i of this.lights)
            this.scene.add(i);
          this.initFloor()
        },
        initFloor() {
          if (!u["DRAW_FLOOR"])
            return;
          this.renderer.shadowMap.enabled = !0,
            this.renderer.shadowMap.type = d["PCFSoftShadowMap"];
          const t = new d["Mesh"](new d["PlaneBufferGeometry"](20,20,100,100),new d["MeshPhongMaterial"]({
            color: 16777215
          }));
          t.rotation.x = -Math.PI / 2,
            t.position.y = -.5,
            t.receiveShadow = !0,
            this.scene.add(t);
          const e = new d["AxesHelper"](5);
          this.scene.add(e);
          const i = new d["GridHelper"](20,20,16777215,16777215);
          i.material.opacity = .2,
            i.material.transparent = !1,
            i.position.y = -.5,
            this.scene.add(i)
        },
        animate() {
          if (this.animator = requestAnimationFrame(this.animate),
            !this.sceneReady)
            return;
          const t = this.camera.position.clone();
          t.applyAxisAngle(new d["Vector3"](0,1,0), -Math.PI / 4),
            this.lights[0].position.copy(t);
          const e = this.camera.position.clone();
          e.applyAxisAngle(new d["Vector3"](0,1,0), Math.PI / 4),
            this.lights[1].position.copy(e),
            this.renderer.render(this.scene, this.camera),
            this.controls.update(),
          this.openRotate && (this.allGroup.rotation.y += .005)
        },
        getExtrudeSettings() {
          return {
            steps: 1,
            depth: this.knife.size.D / 2,
            bevelEnabled: !1,
            bevelThickness: 1,
            bevelSize: 1,
            bevelOffset: 0,
            bevelSegments: 1
          }
        },
        async setupSceneForCup() {
          this.allGroup || (this.allGroup = new d["Group"],
            this.allGroup.name = "container"),
            this.group = new d["Group"],
            this.group.name = "allGroup";
          const t = this.project_data.size_option
            , e = this.project_data.cate.size_options
            , i = e.find(e=>e.sizeName === t)
            , s = i.glbFile
            , a = new m["a"]
            , n = await a.loadAsync(s)
            , r = n.scene.children.filter(t=>"Mesh" === t.type)
            , o = r.some(t=>t.name.includes("outside"))
            , c = r.filter(t=>t.name.startsWith("main"))
            , l = n.scene.getObjectByName("outside")
            , u = "贴图"
            , h = o ? c : r.filter(t=>t.name !== u)
            , v = o ? l : n.scene.getObjectByName(u);
          h.forEach(t=>{
              t.material.envMapIntensity = 1,
                t.material.envMap = this.textureCube,
              t.material.transmission && t.material.transmission > 0 && (t.material.transparent = !0)
            }
          ),
          this.outside_material && (this.outside_material.map.flipY = !1,
            this.outside_material.metalnessMap.flipY = !1,
            this.outside_material.roughnessMap.flipY = !1,
            this.outside_material.metalness = v.material.metalness,
            this.outside_material.roughness = v.material.roughness,
            this.outside_material.transparent = v.material.transparent,
            this.outside_material.side = v.material.side,
            this.outside_material.opacity = v.material.opacity,
            this.outside_material.depthFunc = v.material.depthFunc,
            this.outside_material.depthTest = v.material.depthTest,
            this.outside_material.depthWrite = v.material.depthWrite,
            v.material = this.outside_material),
            [...h, v].forEach(t=>{
                this.group.add(t)
              }
            );
          const {totalX: g, totalY: y} = this.knife_data
            , A = new d["BoxHelper"](this.group,16737844);
          A.visible = !1,
            A.geometry.computeBoundingBox();
          const b = A.geometry.boundingBox
            , C = {
            L: Math.abs(b.max.x - b.min.x),
            W: Math.abs(b.max.z - b.min.z),
            H: Math.abs(b.max.y - b.min.y)
          };
          this.allGroup.remove(this.allGroup.children[0]),
            this.allGroup.add(this.group);
          const f = p["a"].modelScale(C);
          this.allGroup.scale.set(f, f, f),
            this.scene.add(this.allGroup),
            this.huabu_size = {
              x: g,
              y: y,
              z: 0
            }
        },
        setupScene() {
          this.allGroup || (this.allGroup = new d["Group"],
            this.allGroup.name = "container");
          const t = this.getExtrudeSettings()
            , e = this.knife.faces;
          this.group = new d["Group"],
            this.group.name = "allGroup";
          const i = {
            x: [],
            y: [],
            z: []
          }
            , s = this.knife.transform;
          for (const a in e) {
            const s = this.filterSvgPath(e[a].dlist, "Shape");
            if (e[a].holes)
              for (const t of e[a].holes) {
                const e = this.filterSvgPath(t, "Path");
                s.holes.push(e)
              }
            const n = new d["ExtrudeBufferGeometry"](s,t)
              , r = new d["Mesh"](n,this.outside_material);
            r.receiveShadow = !1,
              r.castShadow = !0,
              r.name = e[a].name,
              this.group.add(r);
            const o = n.attributes.position.array;
            for (const t in o)
              t % 3 === 0 ? i.x.push(o[t]) : t % 3 === 1 ? i.y.push(o[t]) : t % 3 === 2 && i.z.push(o[t])
          }
          this.group.rotation.set(s.rotate.x, s.rotate.y, s.rotate.z, "XYZ"),
            this.group.updateMatrix(),
            this.group.scale = new d["Vector3"](this.modelScale,this.modelScale,this.modelScale),
            this.group.position.set(s.position.x * this.modelScale, s.position.y * this.modelScale, s.position.z * this.modelScale),
            this.allGroup.remove(this.allGroup.children[0]),
            this.allGroup.add(this.group),
            this.scene.add(this.allGroup),
            this.huabu_size = {
              x: Math.max.apply(null, i.x) - Math.min.apply(null, i.x),
              y: Math.max.apply(null, i.y) - Math.min.apply(null, i.y),
              z: Math.max.apply(null, i.z) - Math.min.apply(null, i.z)
            };
          for (const a of this.knife.folds) {
            if (a.path)
              continue;
            const e = new d["CatmullRomCurve3"]([new d["Vector3"]((a.x1 - a.x2) / 2,(a.y1 - a.y2) / 2,.01), new d["Vector3"]((a.x2 - a.x1) / 2,(a.y2 - a.y1) / 2,.01)])
              , i = e.getPoints(2)
              , s = new d["WireframeGeometry"];
            s.vertices = i;
            const n = new d["LineBasicMaterial"]({
              color: 16777215,
              opacity: 1,
              transparent: !0
            });
            if ("x" === a.name)
              continue;
            const r = new d["Mesh"](s,n);
            r.name = a.name,
              a.rotate ? r.position.set((a.x1 + a.x2) / 2, (a.y1 + a.y2) / 2, this.knife.size.D) : r.position.set((a.x1 + a.x2) / 2, (a.y1 + a.y2) / 2, 0),
              this.line_list[a.name] = r,
              this.group.getObjectByName(a.name.split("_")[0]).add(r),
              r.add(this.group.getObjectByName(a.name.split("_")[1])),
              this.group.getObjectByName(a.name.split("_")[1]).position.set(-(a.x1 + a.x2) / 2, -(a.y1 + a.y2) / 2, 0),
              r.rotation.set(0, 0, 0);
            for (const o in a.name.split("_"))
              if (void 0 === this.group.getObjectByName(a.name.split("_")[o] + ".inside")) {
                const e = this.group.getObjectByName(a.name.split("_")[o]).geometry;
                this.uv_revise("outside", e);
                const i = this.uv_revise("inside", e.clone())
                  , s = new d["Mesh"](i,this.inside_material);
                s.name = a.name.split("_")[o] + ".inside",
                  "0" === o ? (s.position.z = t.depth,
                    this.group.getObjectByName(a.name.split("_")[o]).add(s)) : "1" === o && (s.position.set(-(a.x1 + a.x2) / 2, -(a.y1 + a.y2) / 2, t.depth),
                    r.add(s))
              }
          }
          for (const a of e) {
            const t = a.name;
            if (void 0 !== this.group.getObjectByName(t + ".inside"))
              continue;
            const e = this.group.getObjectByName(t).geometry;
            this.uv_revise("outside", e);
            const i = this.uv_revise("inside", e.clone())
              , s = new d["Mesh"](i,this.inside_material);
            s.name = t + ".inside",
              s.position.z = this.getExtrudeSettings().depth,
              this.group.getObjectByName(t).add(s)
          }
        },
        uv_revise(t, e) {
          const i = e.attributes.uv.array;
          for (const s in i)
            "outside" === t ? i[s] = s % 2 === 0 ? i[s] / this.huabu_size.x : 1 - i[s] / this.huabu_size.y : "inside" === t && s % 2 === 0 && (i[s] = 1 - i[s]);
          return e
        },
        drawMap(t) {
          this.drawList.push(t)
        },
        async doDrawMap(t) {
          if (!this.outside_designs_loaded && "outside" === t)
            return !1;
          const e = this.canvas_list[t].canvas
            , i = this.rx
            , s = this.ry;
          e.width = this.huabu_size.x * i,
            e.height = this.huabu_size.y * s;
          const a = i
            , n = s
            , r = e.getContext("2d");
          "inside" !== t && "outside" !== t || await p["a"].drawBackground(r, e.width, e.height, "url(" + this.project_data.science_image + ")", [0, 0], [1, 1], {
            rect: !0,
            shadow: !1,
            repeat: !0,
            backgroundImageCanvasWidth: this.backgroundImageCanvasWidth,
            backgroundImageCanvasHeight: this.backgroundImageCanvasHeight
          });
          let o = ""
            , c = "#ffffff";
          "inside" === t ? (o = this.project_data.inside_face_background,
            c = this.project_data.inside_background) : "outside" === t ? (o = this.project_data.face_background,
            c = this.project_data.background) : "gilding" === t ? c = "#ffff00" : "bump" === t ? c = "rgb(128,128,128)" : "roughness" === t && (c = "#008000"),
          c && await p["a"].drawBackground(r, e.width, e.height, c, [0, 0], [1, 1], {
            rect: !0,
            shadow: !1,
            repeat: !1,
            backgroundImageCanvasWidth: this.backgroundImageCanvasWidth,
            backgroundImageCanvasHeight: this.backgroundImageCanvasHeight
          }),
          "inside" === t && p["a"].ctxScale(r, this.knife.totalX * a, 0, -1, 1),
            p["a"].drawFace(r, o, this.knife.faces, [a, n]),
          "inside" === t && p["a"].ctxScale(r, this.knife.totalX * a, 0, -1, 1);
          const d = [a, n];
          "true" === this.$route.query.showBleed && "outside" === t && p["a"].drawBleeding(r, this.knife_data.bleeds, null, [-this.project_data.bleedline * d[0], -this.project_data.bleedline * d[1]], 0, 0, "#ff0000", d);
          let l = [];
          l = "outside" === t || "gilding" === t || "bump" === t || "roughness" === t ? this.project_data.design_data : this.project_data.inside_design_data;
          let u = null;
          return "gilding" !== t && "bump" !== t && "roughness" !== t || (u = t),
            await p["a"].drawMaterials(r, l, d, [0, 0], {
              mapType: u,
              craft: this.crafts
            }),
            "gilding" === t ? this.canvas_list.outside.material.metalnessMap.needsUpdate = !0 : "bump" === t || ("roughness" === t ? this.canvas_list.outside.material.roughnessMap.needsUpdate = !0 : this.canvas_list[t].material.map.needsUpdate = !0),
            this.$store.commit("render/setCanvasReady", t),
            !0
        },
        async drawMapAll() {
          if (!this.sceneReady)
            return;
          if (!this.show_d3_window)
            return;
          if (this.rendering)
            return;
          if (!this.drawList.length)
            return;
          if (!this.outside_designs_loaded)
            return;
          if (!this.is_outside && !this.inside_designs_loaded)
            return;
          this.rendering = !0;
          const t = this.drawList.filter((function(t, e, i) {
              return i.indexOf(t) === e
            }
          ));
          this.drawList = [],
            await Promise.all(["outside", "inside"].filter(e=>t.includes(e)).map(t=>this.doDrawMap(t))).catch(t=>{}
            ),
            await Promise.all(["gilding", "bump", "roughness"].filter(e=>t.includes(e)).map(t=>this.doDrawMap(t))).catch(t=>{}
            ),
            this.rendering = !1
        },
        filterSvgPath(t, e) {
          const i = new d[e];
          for (const s in t)
            if (t[s])
              switch (t[s].mtd) {
                case "M":
                  i.moveTo(t[s].x, t[s].y);
                  break;
                case "L":
                  i.lineTo(t[s].x, t[s].y);
                  break;
                case "Q":
                  i.quadraticCurveTo(t[s].cx, t[s].cy, t[s].x, t[s].y);
                  break;
                case "A":
                  v["a"].parseArcCommand(i, t[s].rx, t[s].ry, t[s].ang, t[s].arc, t[s].dir, {
                    x: t[s - 1].x,
                    y: t[s - 1].y
                  }, {
                    x: t[s].x,
                    y: t[s].y
                  });
                  break;
                case "Z":
                  i.closePath()
              }
          return i
        },
        getMaterialSettings: p["a"].getMaterialSettings,
        convertBase64UrlToBlob(t) {
          const e = window.atob(t.split(",")[1])
            , i = new ArrayBuffer(e.length)
            , s = new Uint8Array(i);
          for (let a = 0; a < e.length; a++)
            s[a] = e.charCodeAt(a);
          return new Blob([i],{
            type: "image/png"
          })
        },
        async screenshotWindow(t, e, i, s) {
          const a = this.renderer.getSize().clone()
            , n = this.renderer.domElement;
          this.camera.position.set(t, e, i),
            this.renderer.setSize(s, s),
            this.renderer.render(this.scene, this.camera);
          const r = n.toDataURL("image/webp");
          return this.renderer.setSize(a.x, a.y),
            await this.readImg(r)
        },
        async readImg(t) {
          return new Promise((e,i)=>{
              const s = new Image;
              s.src = t,
                s.onload = ()=>{
                  e(s)
                }
            }
          )
        },
        getOldAnimation(t, e) {
          for (let i = e - 1; i >= 0; i--) {
            const e = this.knife.animation.animations[i].filter(e=>e.name === t);
            if (e.length > 0)
              return e[0]
          }
          return null
        },
        accumulateRotations() {
          const t = this.knife.animation.animations;
          for (const e in t) {
            const i = t[e];
            for (const t of i) {
              const i = this.getOldAnimation(t.name, e);
              t.initialRotate = i ? i.rotate + (i.initialRotate || 0) : 0
            }
          }
        },
        async doAction(t=0) {
          return 0 === t ? this.resetModal() : this.doAnimate(t)
        },
        rotateLine(t, e) {
          const i = new d["Vector3"](t.vector.x,t.vector.y,t.vector.z).normalize();
          this.line_list[t.name].setRotationFromAxisAngle(i, e)
        },
        translateFace(t, e) {
          const i = this.group.getObjectByName(t.name)
            , s = new d["Vector3"](t.vector.x,t.vector.y,t.vector.z).normalize();
          i.translateOnAxis(s, e)
        },
        async doAnimate(t) {
          const e = parseInt(t / 1e3)
            , i = t - 1e3 * e
            , s = this.knife.animation.animations;
          if (e >= s.length)
            return;
          for (let n = 0; n < e; n++) {
            const t = s[n];
            for (const e of t)
              "rotate" === e.action && this.rotateLine(e, (e.initialRotate + e.rotate) * Math.PI / 180)
          }
          const a = s[e];
          for (const n of a)
            if ("rotate" === n.action) {
              const t = i / 1e3 * n.rotate;
              this.rotateLine(n, (n.initialRotate + t) * Math.PI / 180)
            } else if ("translate" === n.action) {
              this.translateFace(n, -1 * (n.prevTranslate || 0));
              const t = i / 1e3 * n.translate;
              this.translateFace(n, t),
                n.prevTranslate = t
            }
        },
        async resetModal() {
          for (const t of Object.keys(this.line_list)) {
            const e = this.line_list[t];
            e.rotation.set(0, 0, 0)
          }
        },
        debounceReDraw: c.a.debounce(t=>{
            t.is_outside ? t.drawList.push("outside", "gilding", "bump", "roughness") : t.drawList.push("inside"),
              t.drawMapAll()
          }
          , 500)
      },
      watch: {
        d3_window_option: {
          handler(t) {
            this.debounceReDraw(this)
          },
          deep: !0
        },
        showRecord() {
          this.initWatermark()
        },
        isVip() {
          this.initWatermark()
        },
        width(t) {
          this.twidth = t,
            this.initWatermark(),
          this.sceneReady && (this.camera.aspect = this.twidth / this.theight,
            this.camera.updateProjectionMatrix(),
            this.renderer.setSize(this.twidth, this.theight))
        },
        height(t) {
          this.initWatermark(),
            this.theight = t,
          this.sceneReady && (this.camera.aspect = this.twidth / this.theight,
            this.camera.updateProjectionMatrix(),
            this.renderer.setSize(this.twidth, this.theight))
        },
        "knife_data.knifeSize": {
          handler(t) {
            this.reloadModel()
          },
          deep: !0
        }
      },
      beforeDestroy() {
        this.$bus.$off("getRenderGlb"),
          Object(h["j"])(),
        this.renderer && (this.renderer.dispose(),
          this.renderer.forceContextLoss(),
          this.renderer.domElement = null,
          this.renderer = null),
        this.timeout && (clearInterval(this.timeout),
          this.timeout = null),
        this.animator && cancelAnimationFrame(this.animator),
          this.$root.modeReady = !1
      }
    }
      , w = i("bea0")
      , x = i.n(w)
      , j = (i("780b"),
      {
        name: "Mode3d",
        mixins: [f],
        computed: Object(n["a"])(Object(n["a"])(Object(n["a"])(Object(n["a"])({}, Object(r["mapState"])(["insideCanvasVersion", "insideMaterialVersion", "outsideCanvasVersion", "outsideMaterialVersion", "changeTarget"])), Object(r["mapState"])("render", ["insideMaterialPending", "outsideMaterialPending"])), Object(r["mapState"])("editor-v2", ["project_data", "knife_data", "localHistory"])), Object(r["mapGetters"])("editor-v2", ["design_data"])),
        data() {
          return {
            mediaRecorder: null,
            startTime: 0
          }
        },
        props: {
          width: {
            type: Number,
            default: 500
          },
          height: {
            type: Number,
            default: 500
          },
          size: {
            type: Object
          }
        },
        watch: {
          is_outside(t) {
            t || this.debounceDrawInsideMap(this)
          },
          "project_data.science_id"() {
            this.debounceDrawInsideMap(this),
              this.debounceDrawOutsideMap(this),
              this.debounceDrawBumpMap(this),
              this.debounceDrawGildingMap(this),
              this.debounceDrawRoughnessMap(this)
          },
          "project_data.membrane_id"() {
            this.setupTextures(),
              this.debounceDrawInsideMap(this),
              this.debounceDrawOutsideMap(this)
          },
          "project_data.face_background": {
            handler(t) {
              this.debounceDrawOutsideMap(this)
            },
            deep: !0
          },
          "project_data.inside_face_background": {
            handler(t) {
              this.debounceDrawInsideMap(this)
            },
            deep: !0
          },
          "project_data.background"() {
            this.debounceDrawOutsideMap(this)
          },
          "project_data.inside_background"() {
            this.debounceDrawInsideMap(this)
          },
          "localHistory.outside_version"(t) {
            this.debounceDrawOutsideMap(this),
              this.debounceDrawBumpMap(this),
              this.debounceDrawGildingMap(this),
              this.debounceDrawRoughnessMap(this)
          },
          "localHistory.inside_version"(t) {
            this.debounceDrawInsideMap(this)
          }
        },
        mounted() {
          this.animate(),
            this.reloadModel(),
            this.$route.query.type ? this.notEdit = !0 : window.addEventListener("beforeunload", this.beforeunload),
            this.watchScreenshot(),
            this.$bus.$on("envLightIntensityChange", t=>{
                this.outside_material.envMapIntensity = t,
                  this.outside_material.needsUpdate = !0,
                  this.inside_material.envMapIntensity = t,
                  this.inside_material.needsUpdate = !0
              }
            ),
            this.recordStart(),
            this.recordEnd()
        },
        beforeDestroy() {
          window.removeEventListener("beforeunload", this.beforeunload),
            this.$bus.$off("envLightIntensityChange"),
            this.$bus.$off("screenshot-callback"),
            this.$store.dispatch("editor/setEditorTempMaterial", null),
            this.$store.commit("editor/toggleCurrentFace", null),
            this.$store.dispatch("saveModeData", null),
            this.$store.dispatch("saveIsInside", 0),
            this[l["D"]](),
            this.$bus.$off("recorderStart"),
            this.$bus.$off("recorderEnd")
        },
        methods: Object(n["a"])(Object(n["a"])({}, Object(r["mapMutations"])([l["D"]])), {}, {
          recordStart() {
            this.$bus.$on("recorderStart", ()=>{
                const t = this.renderer.domElement.captureStream(60);
                this.mediaRecorder = new MediaRecorder(t);
                const e = [];
                this.mediaRecorder.ondataavailable = t=>{
                  e.push(t.data)
                }
                  ,
                  this.mediaRecorder.onstop = ()=>{
                    const t = Date.now() - this.startTime
                      , i = new Blob(e,{
                      type: "video/webm"
                    });
                    x()(i, t, t=>{
                        this.$bus.$emit("recorderOver", t)
                      }
                    )
                  }
                  ,
                  this.startTime = Date.now(),
                  this.mediaRecorder.start()
              }
            )
          },
          recordEnd() {
            this.$bus.$on("recorderEnd", ()=>{
                this.mediaRecorder.stop()
              }
            )
          },
          watchScreenshot() {
            this.$bus.$on("screenshot", t=>{
                this.$nextTick(async()=>{
                    const t = [{
                      x: 2.91,
                      y: 7.62,
                      z: 6.4,
                      size: 360
                    }, {
                      x: .22,
                      y: 6.54,
                      z: 8.04,
                      size: 120
                    }, {
                      x: -3.85,
                      y: 6.31,
                      z: 7.27,
                      size: 120
                    }, {
                      x: -.9,
                      y: .27,
                      z: 10.328,
                      size: 120
                    }]
                      , e = [];
                    for (const i of t)
                      e.push(await this.screenshotWindow(i.x / .667, i.y / .667, i.z / .667, i.size));
                    this.$bus.$emit("screenshot-callback", e)
                  }
                )
              }
            )
          },
          debounceDrawInsideMap: c.a.debounce(t=>{
              t.drawMap("inside")
            }
            , 500),
          debounceDrawOutsideMap: c.a.debounce(t=>{
              t.drawMap("outside")
            }
            , 500),
          debounceDrawGildingMap: c.a.debounce(t=>{
              t.drawMap("gilding")
            }
            , 500),
          debounceDrawBumpMap: c.a.debounce(t=>{
              t.drawMap("bump")
            }
            , 500),
          debounceDrawRoughnessMap: c.a.debounce(t=>{
              t.drawMap("roughness")
            }
            , 500),
          beforeunload(t) {
            this.changeTarget.length > 0 && (t.returnValue = "",
              t.preventDefault())
          },
          async reloadModel() {
            this.knife = this.knife_data,
              this.$emit("get-step", this.knife.animation.animations.length),
              this.line_list = {},
            this.group && this.scene.remove(this.group),
              this.init_main_material_for_cup(),
              this.init(),
              this.debounceDrawInsideMap(this),
              this.debounceDrawOutsideMap(this),
              this.debounceDrawBumpMap(this),
              this.debounceDrawGildingMap(this),
              this.debounceDrawRoughnessMap(this),
              this.$emit("ready", !0)
          },
          init_main_material_for_cup() {
            if (!this.isCup)
              return;
            const t = (new d["TextureLoader"]).load(this.project_data.science_image);
            t.wrapS = d["RepeatWrapping"],
              t.wrapT = d["RepeatWrapping"],
              t.repeat.set(3, 3),
              this.main_material ? (this.main_material.map = t,
                this.main_material.needsUpdate = !0) : this.main_material = new d["MeshLambertMaterial"]({
                color: 16777215,
                map: t,
                fog: !1,
                envMapIntensity: 1
              }),
              this.main_material.name = "mainMaterial"
          },
          setupTextures() {
            const t = this.getMaterialSettings(this.project_data.membrane_id, this.project_data.membrane_name);
            if (this.outsideCanvasTexture && this.insideCanvasTexture)
              return this.outside_material.metalness = t.metalness,
                this.outside_material.roughness = t.roughness,
                this.outside_material.needsUpdate = !0,
                this.outsideCanvasTexture.needsUpdate = !0,
                this.insideCanvasTexture.needsUpdate = !0,
              this.gildingCanvasTexture && (this.gildingCanvasTexture.needsUpdate = !0),
                void (this.bumpCanvasTexture && (this.bumpCanvasTexture.needsUpdate = !0));
            this.outsideCanvasTexture || (this.outsideCanvasTexture = new d["CanvasTexture"](this.canvas_list.outside.canvas),
              this.outsideCanvasTexture.name = "outsideCanvasTexture",
              this.gildingCanvasTexture = new d["CanvasTexture"](this.canvas_list.gilding.canvas),
              this.gildingCanvasTexture.name = "gildingCanvasTexture",
              this.roughnessCanvasTexture = new d["CanvasTexture"](this.canvas_list.roughness.canvas),
              this.roughnessCanvasTexture.name = "roughnessCanvasTexture",
              this.bumpCanvasTexture = new d["CanvasTexture"](this.canvas_list.bump.canvas),
              this.bumpCanvasTexture.name = "bumpCanvasTexture",
              this.outsideCanvasTexture.anisotropy = 4,
              this.outside_material = new d["MeshStandardMaterial"]({
                color: 16777215,
                map: this.outsideCanvasTexture,
                metalness: t.metalness,
                metalnessMap: this.gildingCanvasTexture,
                envMap: this.textureCube,
                roughness: t.roughness,
                roughnessMap: this.roughnessCanvasTexture,
                fog: !1,
                envMapIntensity: 1
              }),
              this.outside_material.name = "outsideMaterial",
              this.canvas_list.outside.material = this.outside_material,
              this.init_main_material_for_cup()),
            this.insideCanvasTexture || (this.insideCanvasTexture = new d["CanvasTexture"](this.canvas_list.inside.canvas),
              this.insideCanvasTexture.name = "insideCanvasTexture",
              this.insideCanvasTexture.anisotropy = 4,
              this.insideCanvasTexture.center = new d["Vector2"](.5,.5),
              this.inside_material = new d["MeshStandardMaterial"]({
                map: this.insideCanvasTexture,
                fog: !1,
                envMapIntensity: 1,
                envMap: this.textureCube
              }),
              this.inside_material.name = "insideMaterial",
              this.canvas_list.inside.material = this.inside_material),
              this.textureToScene(),
              this.scene.add(this.textureGroup)
          },
          textureToScene() {
            this.textureGroup || (this.textureGroup = new d["Group"],
              this.textureGroup.name = "textureGroup"),
              this.addTexture("gildingCanvasTexture"),
              this.addTexture("roughnessCanvasTexture"),
              this.addTexture("bumpCanvasTexture")
          },
          addTexture(t) {
            const e = new d["BoxBufferGeometry"](.1,.1,.1)
              , i = new d["MeshStandardMaterial"]({
              map: this[t]
            })
              , s = new d["Mesh"](e,i);
            s.name = t,
              s.visible = !1,
              this.textureGroup.add(s)
          }
        })
      })
      , O = j
      , _ = (i("621f"),
      i("2877"))
      , k = Object(_["a"])(O, s, a, !1, null, "70a47bd8", null);
    e["default"] = k.exports
  },
  "5ef8": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("div", {
        staticClass: "payment"
      }, [i("div", {
        staticClass: "content"
      }, [t._m(0), i("div", {
        staticClass: "content__left"
      }, [i("p", {
        staticClass: "chenggong"
      }, [t._v("支付成功")]), i("p", {
        staticClass: "message1"
      }, [t._v("感谢您的购买，我们将尽快为您发货！")]), i("p", {
        staticClass: "message1"
      }, [t._v(" 系统将在 "), i("span", {
        staticClass: "message1_count"
      }, [t._v(t._s(t.count) + "s")]), t._v("后自动为您跳转到订单详情页 ")]), i("p", {
        staticClass: "message2"
      }, [t._v(" ￥ "), i("span", [t._v(t._s(t.price))])]), i("div", {
        staticClass: "orderdetails"
      }, [t._v("查看订单详情")]), t._m(1), t._m(2)]), i("div", {
        staticClass: "content__right"
      }, [i("p", [i("span", {
        staticClass: "title"
      }, [t._v("订单编号：")]), i("span", {
        staticClass: "details"
      }, [t._v(t._s(t.order_no))])]), i("p", [i("span", {
        staticClass: "title"
      }, [t._v("收货信息：")]), i("span", {
        staticClass: "details"
      }, [t._v(t._s(t.orderdata.contacts) + " " + t._s(t.tel))])]), i("p", [i("span", {
        staticClass: "title"
      }), i("span", {
        staticClass: "details"
      }, [t._v(t._s(t.orderdata.province) + " " + t._s(t.orderdata.city) + " " + t._s(t.orderdata.district) + " " + t._s(t.orderdata.address_detail))])]), t._m(3), t._m(4), t._m(5)])])])
    }
      , a = [function() {
      var t = this
        , e = t.$createElement
        , s = t._self._c || e;
      return s("div", {
        staticClass: "success"
      }, [s("img", {
        attrs: {
          src: i("e027"),
          alt: ""
        }
      })])
    }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("p", [i("span", {
          staticClass: "title"
        }, [t._v("客服联系电话：")]), i("span", {
          staticClass: "details",
          staticStyle: {
            width: "253px"
          }
        }, [t._v("85121608")])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("p", [i("span", {
          staticClass: "title"
        }, [t._v("客服微信电话：")]), i("span", {
          staticClass: "details",
          staticStyle: {
            width: "253px"
          }
        }, [t._v("usho123456")])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("p", [i("span", {
          staticClass: "title"
        }, [t._v("商品名称：")]), i("span", {
          staticClass: "details"
        }, [t._v("中秋月饼礼盒*100")])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("p", [i("span", {
          staticClass: "title"
        }, [t._v("配送时间：")]), i("span", {
          staticClass: "details"
        }, [t._v("预计3天内发货")])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , s = t._self._c || e;
        return s("div", [s("div", {
          staticClass: "two"
        }, [s("img", {
          staticClass: "two_union",
          attrs: {
            src: i("0eaf"),
            alt: ""
          }
        })]), s("span", {
          staticClass: "jieshao"
        }, [t._v("扫一扫关注，关注微信，第一时间了解最新订单资讯")])])
      }
    ]
      , n = {
      data() {
        return {
          price: "",
          orderdata: {},
          order_no: "",
          tel: "",
          count: 30,
          timer: null
        }
      },
      mounted() {
        this.$api.order.getOrdersInfo({
          order_id: this.$route.query.order_id
        }).then(t=>{
            this.orderdata = JSON.parse(t.data.consignee_info),
              this.order_no = t.data.order_no,
              this.price = t.data.total_fee;
            let e = this.orderdata.tel_number;
            this.tel = e.substr(0, 3) + "****" + e.substr(7)
          }
        ),
          this.CountDown()
      },
      methods: {
        CountDown() {
          this.timer = setInterval(()=>{
              this.count > 0 && this.count <= 30 ? this.count-- : (clearInterval(this.timer),
                this.timer = null)
            }
            , 1e3)
        },
        ToOrderdetail() {
          this.$router.push({
            path: "/",
            query: {
              order_id: this.$route.query.order_id
            }
          })
        }
      },
      destroyed() {
        clearInterval(this.timer),
          this.timer = null
      }
    }
      , r = n
      , o = (i("d885"),
      i("2877"))
      , c = Object(o["a"])(r, s, a, !1, null, null, null);
    e["default"] = c.exports
  },
  "621f": function(t, e, i) {
    "use strict";
    var s = i("d8d8")
      , a = i.n(s);
    a.a
  },
  "62d2": function(t, e, i) {},
  "63a9": function(t, e, i) {},
  6736: function(t, e, i) {},
  "7a0b": function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwCAYAAABXAvmHAAACfUlEQVRoQ+2YT6hNURTGf99ABqSQCTJCjCQjQ0VKSCJvpCcK+VNPKANRRhKKV0IYyL/IQHrlz0ApmTBSCsM3MnhKpBh82rXv6/Teufeee/50e7296wzOae21v2+tb6+z9hZTfGiK4ycR6HcGG8uA7eB7C/BH0qumiDZJYCtwIQI/KulFEySaJHAEOBxBD0u6mgjkRCBloJ0sbCcJFdkzSUJJQkV00sEmSShJKEmoYgSShCoGcHpXIdsDwA7gqaT72WB264VsHwe2A3ck3SybiEoZsP0emBsXPyHpWQtIJwK29wIno+2YpLX9InAF2BgX/wfslvQxvLcjYHsdcA3GLxQeSDrbLwKzgUfA0gjgR5CUpNE8AraXAw+BWdH+AzAo6W9fCMRILwYeA/MiiG/ALmBP9kgJ3AOeAIui3SiwU9JYWfBhXqU9kNH7auAuMCN+ewt8Ag7G9xvAmviET7+BAUlfqoCvjUDMxGbgYgbQT2BOfA+AW7IxcEDSm6rgayWQs3Hb4Tsv6XYd4GsnEElcBja1ARj+F6fqAp9LwPYS4Fa4UQP2Sfrey4K2Z8b9sGrCvFIVpxueSZvY9n7gWFz8kqTrvRCIWZgfK87CqhWnG548ArVch9heBgQ5hTEk6WuvgcjZV5Nu+BojUAZs3pxuPVUiUFek2/lJGWjqWrxo5qZlBgaB1t/ytaRDRaPVhJ3tYWBD9H1GUmjHx0deFQr1+3nG5iVQuWssSW4FsD4zd5ukzx0JFOhnSmKpPG1E0tBEL7nnAdvhpHWuQ1NWGU2PDkaA05J+FSLQMrK9EghN2YIeF6zLPJwp3nVqQ2o5kdWFtoyfRKBM1OqcM+Uz8B8ywEhA/mEbMwAAAABJRU5ErkJggg=="
  },
  "7a98": function(t, e, i) {},
  "7c20": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = i("750b")
      , a = i("575b");
    i("d89e");
    e["default"] = Object(s["b"])({
      setup() {
        return ()=>Object(s["c"])("div", {
          class: "filter-container flex item-center flex-between"
        }, [Object(s["c"])("div", {
          class: "filter"
        }), Object(s["c"])(a["a"])])
      }
    })
  },
  "7e2d": function(t, e, i) {
    "use strict";
    i.r(e);
    i("ddb0");
    var s = i("5530")
      , a = i("750b")
      , n = i("365c")
      , r = i("3ccf");
    i("949b");
    e["default"] = Object(a["b"])({
      props: {
        password: {
          type: Boolean,
          default: !1
        },
        loading: {
          type: Boolean,
          default: !1
        }
      },
      setup(t, e) {
        const i = Object(a["i"])({
          oldPassword: "",
          password: "",
          checkPassword: ""
        })
          , [o,{loading: c}] = Object(r["b"])(n["savePassword"])
          , [d,{loading: l}] = Object(r["b"])(n["updatePassword"])
          , u = ()=>{
          i.oldPassword = "",
            i.password = "",
            i.checkPassword = ""
        }
          , m = Object(a["a"])(()=>t.password ? "修改" : "设置");
        return ()=>Object(a["c"])("div", {
          class: "password"
        }, [Object(a["c"])("div", {
          class: "password-container"
        }, [Object(a["c"])("h3", {
          class: "password-title"
        }, [m.value, "登录密码"]), Object(a["c"])("div", {
          class: "password-content"
        }, [t.password ? Object(a["c"])("div", {
          class: "list__wrap"
        }, [Object(a["c"])("span", {
          class: "list_title"
        }, ["旧密码："]), Object(a["c"])("div", {
          class: "list_content"
        }, [Object(a["c"])("a-input", {
          attrs: {
            value: i.oldPassword,
            type: "password"
          },
          on: {
            change: t=>i.oldPassword = t.target.value
          }
        })])]) : "", Object(a["c"])("div", {
          class: "list__wrap"
        }, [Object(a["c"])("span", {
          class: "list_title"
        }, ["新密码："]), Object(a["c"])("div", {
          class: "list_content"
        }, [Object(a["c"])("a-input", {
          attrs: {
            value: i.password,
            type: "password"
          },
          on: {
            change: t=>i.password = t.target.value
          }
        })])]), Object(a["c"])("div", {
          class: "list__wrap"
        }, [Object(a["c"])("span", {
          class: "list_title"
        }, ["确认密码："]), Object(a["c"])("div", {
          class: "list_content"
        }, [Object(a["c"])("a-input", {
          attrs: {
            value: i.checkPassword,
            type: "password"
          },
          on: {
            change: t=>i.checkPassword = t.target.value
          }
        })])])]), Object(a["c"])("a-button", {
          class: "save",
          attrs: {
            type: "primary",
            loading: c.value || l.value
          },
          on: {
            click: ()=>{
              const a = Object(s["a"])({}, i);
              let n = "";
              if (a.checkPassword !== a.password && (n = "两次输入密码不一致"),
              a.checkPassword || (n = "请输入确认密码"),
              a.password || (n = "请输入新密码"),
              t.password && (a.oldPassword || (n = "请输入旧密码")),
                n)
                return void e.root.$message.error(n);
              const r = t.password ? d : o
                , c = t.password ? {
                password: a.oldPassword,
                newPassword: a.password
              } : {
                password: a.password
              };
              r({
                variables: c,
                update() {
                  e.emit("refresh"),
                    u(),
                    e.root.$message.success("保存成功")
                }
              })
            }
          }
        }, ["保存"])])])
      }
    })
  },
  "7f29": function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , s = t._self._c || e;
      return t.vipConfig ? s("div", {
        staticClass: "vip-container"
      }, [s("header-bg", {
        attrs: {
          title: t.vipConfig.title
        }
      }), s("div", {
        staticClass: "w-100 flex flex-center item-center"
      }, t._l(t.prods, (function(e, a) {
          return s("div", {
            key: a,
            staticClass: "vip-pro-item"
          }, [s("div", {
            staticClass: "top-bg",
            style: {
              backgroundImage: "url(" + e.bg + ")"
            }
          }, [s("div", {
            class: "label-bg label-bg-fo" + a
          }, [t._v(t._s(e.label))]), 0 === a ? s("div", {
            class: "mt-16 fo-40 lp lp-fo0 bold"
          }, [t._v("免费")]) : t._e(), 1 === a ? s("div", {
            class: "mt-16 fo-14 lp lp-fo1"
          }, [t._v(" 低至"), s("span", {
            staticClass: "fo-40 bold"
          }, [t._v(" " + t._s(t.vipConfig.singlePrice) + " ")]), t._v("元/月"), s("br"), t._v(" 每天仅需" + t._s(t.vipConfig.singleDayPrice) + "元 ")]) : t._e(), 2 === a ? s("div", {
            class: "mt-16 fo-14 lp lp-fo2"
          }, [s("span", {
            staticClass: "fo-40 bold"
          }, [t._v(t._s(t.vipConfig.yearPrice) + " ")]), t._v("元/年"), s("br"), t._v(" 每天仅需" + t._s(t.vipConfig.yearDayPrice) + "元 ")]) : t._e(), s("div", {
            class: "mt-30 fo-16 label-bg-fo" + a
          }, [t._v(t._s(e.remark))]), 0 === a ? s("a-button", {
            staticClass: "label-bg-fo1 mt-30",
            style: {
              backgroundColor: "#DAE6F3",
              color: "#19436F"
            },
            attrs: {
              size: "large",
              block: ""
            },
            on: {
              click: function(e) {
                return t.navTo("https://www.baoxiaohe.com/share")
              }
            }
          }, [t._v(" 免费领会员 ")]) : t._e(), 1 === a ? s("a-button", {
            staticClass: "label-bg-fo1 mt-30",
            style: {
              backgroundColor: "#FFE6C4"
            },
            attrs: {
              size: "large",
              block: ""
            },
            on: {
              click: t.showPersonalVip
            }
          }, [t._v(" 开通个人专业版 ")]) : t._e(), 2 === a ? s("a-button", {
            staticClass: "label-bg-fo1 mt-30",
            style: {
              backgroundColor: "#FFE6C4"
            },
            attrs: {
              size: "large",
              block: ""
            },
            on: {
              click: t.showBusinessVip
            }
          }, [t._v(" 开通企业高级版 ")]) : t._e()], 1), s("div", {
            staticClass: "p-30"
          }, [s("div", {
            staticClass: "mt-10 fo-14 fo-gray"
          }, [t._v("设计权益")]), t._l(t.designList, (function(a, n) {
              return s("div", {
                key: n + "design",
                staticClass: "mt-20 fo-16 fo-b flex flex-between item-center"
              }, [s("div", [t._v(t._s(a))]), s("div", ["true" === e.designs[n] ? s("img", {
                attrs: {
                  src: i("d15f")
                }
              }) : "false" === e.designs[n] ? s("img", {
                attrs: {
                  src: i("964b")
                }
              }) : e.designs[n].indexOf("&") > -1 ? s("span", {
                staticClass: "fo-gray"
              }, [t._v(t._s(e.designs[n].replace("&", "")))]) : s("span", [t._v(t._s(e.designs[n]))])])])
            }
          )), s("div", {
            staticClass: "mt-40 fo-14 fo-gray"
          }, [t._v("限时专享")]), t._l(t.enjoy, (function(a, n) {
              return s("div", {
                key: n,
                staticClass: "mt-20 fo-16 fo-b flex flex-between item-center"
              }, [s("div", [t._v(t._s(a))]), s("div", ["true" === e.enjoy[n] ? s("img", {
                attrs: {
                  src: i("d15f")
                }
              }) : "false" === e.enjoy[n] ? s("img", {
                attrs: {
                  src: i("964b")
                }
              }) : s("span", [t._v(t._s(e.enjoy[n]))])])])
            }
          )), t._m(0, !0), t._l(t.powers, (function(a, n) {
              return s("div", {
                key: n + "posers",
                staticClass: "mt-20 fo-16 fo-b flex flex-between item-center"
              }, [s("div", [t._v(t._s(a))]), s("div", ["true" === e.powers[n] ? s("img", {
                attrs: {
                  src: i("d15f")
                }
              }) : "false" === e.powers[n] ? s("img", {
                attrs: {
                  src: i("964b")
                }
              }) : s("span", [t._v(t._s(e.powers[n]))])])])
            }
          )), s("div", {
            staticClass: "mt-40 fo-14 fo-gray"
          }, [t._v("专属服务")]), t._l(t.service, (function(a, n) {
              return s("div", {
                key: n + "service",
                staticClass: "mt-20 fo-16 fo-b flex flex-between item-center"
              }, [s("div", [t._v(t._s(a))]), s("div", ["true" === e.service[n] ? s("img", {
                attrs: {
                  src: i("d15f")
                }
              }) : "false" === e.service[n] ? s("img", {
                attrs: {
                  src: i("964b")
                }
              }) : s("span", [t._v(t._s(e.service[n]))])])])
            }
          ))], 2)])
        }
      )), 0), s("vip-title", {
        attrs: {
          title: "版权无忧，放心商用",
          "sub-title": "COPY RIGHT",
          theme: "light"
        }
      }), t._m(1), s("div", {
        staticClass: "n-bg flex flex-center item-center"
      }, [s("div", {
        staticStyle: {
          width: "260px"
        }
      }, [s("div", {
        staticClass: "fo-20 fo-b"
      }, [t._v("商业授权书保障")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" 会员用户可获得正式的商业授权书，版权范围清晰明了，让您的权益得到安全的保障 ")]), s("a-button", {
        style: {
          color: "#6B4D1B",
          width: "240px",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)",
          marginTop: "40px"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: t.showPersonalVip
        }
      }, [t._v("立即开通")])], 1), s("img", {
        staticStyle: {
          "margin-left": "120px",
          "border-radius": "10px"
        },
        attrs: {
          src: "https://yun.baoxiaohe.com/bxh/VIP-%E5%95%86%E4%B8%9A%E6%8E%88%E6%9D%83%E4%B9%A6.jpg",
          width: "640",
          alt: ""
        }
      })]), s("vip-title", {
        attrs: {
          title: "8秒放肆渲染，照片级品质效果图",
          "sub-title": "FASTER",
          theme: "light"
        }
      }), s("div", {
        staticClass: "flex flex-center item-center mt-120"
      }, [t._m(2), s("div", {
        staticClass: "text-right",
        staticStyle: {
          width: "260px",
          "margin-left": "120px"
        }
      }, [s("div", {
        staticClass: "fo-20 fo-b"
      }, [t._v("畅享强大的云端渲染力")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" 最高4K高清分辨率，影棚级逼真效果图，包装设计从未如此简单高效 ")]), s("a-button", {
        style: {
          color: "#6B4D1B",
          width: "240px",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)",
          marginTop: "40px"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: t.showPersonalVip
        }
      }, [t._v("立即开通")])], 1)]), s("div", {
        staticClass: "n-bg flex flex-center item-center"
      }, [s("div", {
        staticStyle: {
          width: "260px"
        }
      }, [s("div", {
        staticClass: "fo-20 fo-b"
      }, [t._v("专业服务 极致体验")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" 成为VIP，您将获得包小盒专属客服及微信群服务。行业干货每日推送，实时需求极速响应。 ")]), s("a-button", {
        style: {
          color: "#6B4D1B",
          width: "240px",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)",
          marginTop: "40px"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: t.showPersonalVip
        }
      }, [t._v("立即开通")])], 1), s("img", {
        staticStyle: {
          "margin-left": "120px",
          "border-radius": "10px"
        },
        attrs: {
          src: "https://yun.baoxiaohe.com/bxh/VIP-%E4%B8%93%E4%B8%9A%E6%9C%8D%E5%8A%A1%E6%9E%81%E8%87%B4%E4%BD%93%E9%AA%8C.jpg",
          width: "640",
          alt: ""
        }
      })]), s("div", {
        staticClass: "k-bg"
      }, [s("vip-title", {
        attrs: {
          title: "会员之声",
          "sub-title": "MEMBERS",
          theme: "dark"
        }
      }), s("div", {
        staticClass: "flex flex-center item-center"
      }, t._l(t.vipConfig.vipList, (function(e, a) {
          return s("div", {
            key: a,
            staticClass: "user-item mt-120"
          }, [s("div", {
            staticClass: " flex flex-between item-center"
          }, [s("div", {
            staticClass: "flex flex-start item-center"
          }, [s("a-avatar", {
            attrs: {
              icon: "user",
              size: 60,
              src: e.avatar
            }
          }), s("div", {
            staticClass: "ml-20"
          }, [s("div", {
            staticClass: "flex flex-start item-center"
          }, [s("div", {
            staticClass: "fo-18 fo-b"
          }, [t._v(t._s(e.name))]), 0 === a ? s("img", {
            staticClass: "ml-8",
            attrs: {
              src: i("25a3"),
              width: "42px",
              alt: ""
            }
          }) : t._e(), 1 === a ? s("img", {
            staticClass: "ml-8",
            attrs: {
              src: i("1c5f"),
              width: "42px",
              alt: ""
            }
          }) : t._e()]), s("div", {
            staticClass: "fo-14 mt-4 fo-gray"
          }, [t._v(t._s(e.position))])])], 1), s("img", {
            attrs: {
              src: i("b4c0"),
              width: "50px",
              alt: ""
            }
          })]), s("div", {
            staticClass: "mt-20 fo-28 fo-b"
          }, [t._v(t._s(e.title))]), s("div", {
            staticClass: "mt-20 fo-16 fo-gray",
            staticStyle: {
              height: "112px"
            }
          }, [t._v("“" + t._s(e.desc) + "”")])])
        }
      )), 0), s("div", {
        staticClass: "k2 flex flex-between item-center"
      }, [s("div", {
        staticClass: "flex flex-start item-center"
      }, [s("img", {
        staticClass: "mr-20",
        attrs: {
          src: i("0948"),
          alt: ""
        }
      }), s("a-carousel", {
        staticStyle: {
          width: "550px"
        },
        attrs: {
          "dot-position": "left",
          autoplay: "",
          dots: !1
        }
      }, t._l(t.phones, (function(e) {
          return s("div", {
            key: e,
            staticClass: "notice-item"
          }, [s("div", {
            staticClass: "fo-16 fo-gray ell w-100"
          }, [t._v(" 恭喜 "), s("span", {
            staticClass: "fo-b bold"
          }, [t._v(t._s(e))]), t._v(" 刚刚开通了包小盒尊贵会员！开启智能设计效率之路！ ")])])
        }
      )), 0)], 1), s("a-button", {
        style: {
          color: "#6B4D1B",
          width: "240px",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: t.showPersonalVip
        }
      }, [t._v("开通会员")])], 1)], 1), s("vip-title", {
        attrs: {
          title: "常见问题",
          "sub-title": "PROBLEM",
          theme: "light"
        }
      }), s("div", {
        staticClass: "flex flex-center item-center mt-120",
        staticStyle: {
          "padding-bottom": "120px"
        }
      }, [s("div", {
        staticClass: "ques"
      }, [s("div", {
        staticClass: "fo-20 fo-b"
      }, [t._v("01.成为包小盒会员有什么优势？")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" 包小盒会员可享优质的原创包装模版；可使用字体素材和高级功能进行设计。模型、模版、渲染任意用，获得更便捷的设计体验。 ")]), s("div", {
        staticClass: "fo-20 fo-b mt-30"
      }, [t._v("02.购买VIP后是否可以退货退款？")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" VIP服务属于虚拟产品，一经生效后不支持退订和退款，请您谅解。 ")]), s("div", {
        staticClass: "fo-20 fo-b mt-30"
      }, [t._v("03.可以发开票吗？")]), s("div", {
        staticClass: "fo-16 fo-gray mt-20"
      }, [t._v(" 于包小盒购买VIP、印刷品均可申请开发票，您可以联系客服申请，我们提供电子发票形式的增值税普通发票，在15个工作日内发送至您填写的邮箱内。 ")]), s("a-button", {
        style: {
          color: "#6B4D1B",
          width: "120px",
          background: "linear-gradient(318deg,#f7bb77 12%, #ffdcad 82%)",
          marginTop: "30px"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: function(e) {
            return t.navTo("https://help.baoxiaohe.com/support/category/vip/")
          }
        }
      }, [t._v("更多问题")])], 1), s("div", {
        staticClass: "quesb flex flex-center item-center"
      }, [s("div", {
        staticClass: "text-center"
      }, [s("div", {
        staticClass: "fo-34 fo-white"
      }, [t._v("商家版 同步发售")]), t._m(3), s("a-button", {
        staticClass: "mt-30",
        style: {
          color: "#FF610D",
          width: "240px",
          marginTop: "30px"
        },
        attrs: {
          size: "large"
        },
        on: {
          click: function(e) {
            return t.navTo("https://www.baoxiaohe.com/business")
          }
        }
      }, [t._v("了解详情")])], 1)])]), s("div", {
        attrs: {
          id: "posContainer"
        }
      }, [s("div", {
        staticClass: "flex flex-start item-center gold-url pointer",
        on: {
          click: function(e) {
            return t.openUrl("/vip/convert")
          }
        }
      }, [s("div", [t._v("会员卡兑换")]), s("img", {
        staticClass: "ml-4",
        attrs: {
          src: i("2253"),
          alt: ""
        }
      })])])], 1) : t._e()
    }
      , a = [function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("div", {
        staticClass: "mt-40 fo-14 flex flex-between item-center"
      }, [i("div", {
        staticClass: " fo-gray"
      }, [t._v("版权权益")]), i("a", {
        staticClass: "fo-12 fo-gray",
        attrs: {
          href: "https://help.baoxiaohe.com/support/archives/300/",
          target: "_blank"
        }
      }, [t._v("了解更多")])])
    }
      , function() {
        var t = this
          , e = t.$createElement
          , s = t._self._c || e;
        return s("div", {
          staticClass: "flex flex-center item-center"
        }, [s("div", {
          staticClass: "b-item text-center"
        }, [s("img", {
          attrs: {
            src: i("3d70")
          }
        }), s("div", {
          staticClass: "fo-20 bold-500 fo-b mt-30"
        }, [t._v("模型结构")]), s("div", {
          staticClass: "fo-16 fo-gray mt-20"
        }, [t._v(" 提供100+精选模型结构，满足大部分包装结构需求，参数化尺寸长宽高 ")])]), s("div", {
          staticClass: "b-item text-center"
        }, [s("img", {
          attrs: {
            src: i("a96b")
          }
        }), s("div", {
          staticClass: "fo-20 bold-500 fo-b mt-30"
        }, [t._v("版权素材")]), s("div", {
          staticClass: "fo-16 fo-gray mt-20"
        }, [t._v(" 海量高清图标素材，版权来源清晰可溯，全类型覆盖您的设计需求 ")])]), s("div", {
          staticClass: "b-item text-center"
        }, [s("img", {
          attrs: {
            src: i("ae51")
          }
        }), s("div", {
          staticClass: "fo-20 bold-500 fo-b mt-30"
        }, [t._v("版权字体")]), s("div", {
          staticClass: "fo-16 fo-gray mt-20"
        }, [t._v("超100+款可商用字体，保障版权无忧，放心使用")])])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("div", {
          staticClass: "boxs"
        }, [i("div", {
          staticClass: "boxs-hi"
        }, [i("div", {
          staticClass: "mt-4 boxs-hi-item boxs-hi-item-w1"
        }, [i("img", {
          staticClass: "an-1 anima-slow ",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h1.jpg",
            height: "107px",
            alt: ""
          }
        }), i("img", {
          staticClass: "an-1 anima-slow  ml-8",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h1.jpg",
            height: "107px",
            alt: ""
          }
        })]), i("div", {
          staticClass: "mt-4 boxs-hi-item boxs-hi-item-w2"
        }, [i("img", {
          staticClass: "an-2 anima-faster ",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h2.jpg",
            height: "107px",
            alt: ""
          }
        }), i("img", {
          staticClass: "an-2 anima-faster  ml-8",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h2.jpg",
            height: "107px",
            alt: ""
          }
        })]), i("div", {
          staticClass: "mt-4 boxs-hi-item boxs-hi-item-w3"
        }, [i("img", {
          staticClass: "an-3 anima-slow ",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h3.jpg",
            height: "107px",
            alt: ""
          }
        }), i("img", {
          staticClass: "an-3 anima-slow  ml-8",
          attrs: {
            src: "https://yun.baoxiaohe.com/bxh/h3.jpg",
            height: "107px",
            alt: ""
          }
        })]), i("div", {
          staticClass: "flex flex-between item-center"
        }, [i("div", {
          staticClass: "mask-bk"
        }), i("div", {
          staticClass: "mask-bk"
        })])])])
      }
      , function() {
        var t = this
          , e = t.$createElement
          , i = t._self._c || e;
        return i("div", {
          staticClass: "fo-white fo-18 mt-30 lh-40"
        }, [t._v(" 助力包装印刷企业，营销利器 "), i("br"), t._v("快速设计3D渲染、虚拟展品馆 ")])
      }
    ]
      , n = i("5530")
      , r = i("9b1c")
      , o = i.n(r)
      , c = i("a6fc")
      , d = i.n(c)
      , l = i("37dc")
      , u = i.n(l)
      , m = i("4981")
      , h = i("bc11")
      , p = i("9393")
      , v = i("5880")
      , g = i("b6c6")
      , y = {
      components: {
        vipTitle: m["default"],
        headerBg: h["default"]
      },
      mixins: [p["a"]],
      mounted() {
        this[g["h"]]()
      },
      data() {
        return {
          designList: ["模板设计图纸", "盒型/模型库", "云渲染效果图", "上传素材限制", "历史版本记录", "团队协作"],
          powers: ["授权主体数量"],
          enjoy: ["免费打样"],
          service: ["尊贵会员标识", "VIP专属客服"],
          phones: ["178****9662", "182****3607", "178****9437", "152****9098", "138****7665", "132****0986", "138****7865", "170****3441", "187****6822", "192****5332", "187****9701", "182****3698"],
          prods: [{
            bg: o.a,
            label: "普通用户",
            remark: "仅用于学习与交流",
            designs: ["部分免费", "100+", "带水印", "5M/300张", "false", "false"],
            powers: ["仅学习与交流"],
            enjoy: ["false"],
            service: ["false", "false"]
          }, {
            bg: d.a,
            label: "个人专业VIP",
            remark: "畅享VIP包装模型、模版及素材",
            designs: ["折扣价格", "无限制", "高清", "10M/2000张", "true", "false"],
            powers: ["1个个人授权"],
            enjoy: ["false"],
            service: ["true", "true"]
          }, {
            bg: u.a,
            label: "企业高级VIP",
            remark: "畅享VIP全部功能，畅享渲染",
            designs: ["折扣价格", "无限制", "高清", "20M/10000张", "true", "&敬请期待"],
            powers: ["1个企业授权"],
            enjoy: ["1次(200元以内)"],
            service: ["true", "true"]
          }]
        }
      },
      methods: Object(n["a"])(Object(n["a"])({}, Object(v["mapActions"])("profile", [g["h"]])), {}, {
        navTo(t) {
          window.open(t)
        },
        openUrl(t) {
          this.navTo(t)
        }
      })
    }
      , A = y
      , b = (i("0773"),
      i("2877"))
      , C = Object(b["a"])(A, s, a, !1, null, null, null);
    e["default"] = C.exports
  },
  "8d5d": function(t, e, i) {},
  "8ec7": function(t, e, i) {},
  9003: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("a-modal", {
        attrs: {
          title: t.title + "建议给设计方案取个名",
          footer: null
        },
        model: {
          value: t.visible,
          callback: function(e) {
            t.visible = e
          },
          expression: "visible"
        }
      }, [i("rename", {
        ref: "renameRef",
        attrs: {
          "show-submit": !0,
          "project-name": t.project_data.project_name,
          trademark: t.project_data.extend_attrs ? t.project_data.extend_attrs.trademark : "",
          "product-name": t.project_data.extend_attrs ? t.project_data.extend_attrs.productName : ""
        },
        on: {
          nameChanged: t.handleNameChanged
        }
      })], 1)
    }
      , a = []
      , n = i("5530")
      , r = i("485e")
      , o = i("5880")
      , c = {
      components: {
        Rename: r["default"]
      },
      data() {
        return {
          visible: !1,
          purpose: ""
        }
      },
      methods: {
        show(t) {
          this.visible = !0,
            this.purpose = t
        },
        handleNameChanged() {
          this.visible = !1,
            this.$emit("navigate", this.purpose)
        }
      },
      computed: Object(n["a"])(Object(n["a"])({}, Object(o["mapState"])("editor-v2", ["project_data", "knife_data", "isCup", "scale", "is_outside", "last_saved_local_history_ts"])), {}, {
        title() {
          const t = {
            share: "分享",
            render: "渲染"
          };
          return t[this.purpose] ? t[this.purpose] + "前" : ""
        }
      })
    }
      , d = c
      , l = i("2877")
      , u = Object(l["a"])(d, s, a, !1, null, null, null);
    e["default"] = u.exports
  },
  9205: function(t, e, i) {},
  "949b": function(t, e, i) {},
  "964b": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/false.276670e8.svg"
  },
  9892: function(t, e, i) {
    "use strict";
    var s = i("6736")
      , a = i.n(s);
    a.a
  },
  "9b1c": function(t, e, i) {
    t.exports = i.p + "editor-assets/img/bg1.55637913.jpg"
  },
  "9eab": function(t, e, i) {},
  a28b: function(t, e, i) {},
  a6fc: function(t, e, i) {
    t.exports = i.p + "editor-assets/img/bg2.3602e3a3.jpg"
  },
  a96b: function(t, e, i) {
    t.exports = i.p + "editor-assets/img/t2.9fc12b6e.svg"
  },
  ab5c: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACgAAAAoCAYAAACM/rhtAAAE10lEQVRYR+2YXWgjVRTHz51JMpO2yaRflLZLCWtaSkKFQknjrgoFra1lFdm1Lj64YNEHRUGUfVjXJxcfFkQQFEFcdKtlH1xBpXZd+lK1pS2FQEO3X9luEUmVKWWS1GSSycyVmc2EO9NJmu7aTQXnZWbux7m/+Z97zr13EBgvZHqv1CvWB1aBjgqUpRj/A97vHPnPK6jNz2Qy6a+qqnoCANoAwAUA0d3d3escx22Uo1A8Hj9eU1NzGgB8qjkA+D2VSk26XK5b+f6FoDDbs1KwEDS5XG6IpulLAPCwBYikKMqH4XD4/Z6eHtEKdGFhge3u7n6Poqi3AcBu0WZRluWLNpttnKgzwJoBNbi84S8oijpbhkK3tra2nm5pafmDbBuLxY41Nzf/BAD+/WwoinItHA6PEB9qmWY0uJmZGSYUCt1ECD26n2GifnN7e/upxsbG22oZz/MPNTQ0/AwA3nJtYIx/m5qaerKvry9Lul1XsOBWWZY/pyjq5XIN6+0wxptra2sn1feOjo5phFDZcLoNRVGu0DT9CuluFYzSC9Lp9AmWZX89KBwBOac+I4R679WGKIqPOZ3OGXIl0QGRoig3EEJqtFbswhhPUhQ1AADaPNQVROvr63U+n28LAOiK0d0dWI5Go83t7e07KmQBMJPJPOtwOK5XGE4bPpvNnmYY5nsdUFMsm82+ZrfbPz4KgJIkvelwOD7VXawBSpJ03mazfXAUAHO53AW73X6ZBETpdPpFlmW/OgqAoiieczqdY6SLUSKRCLpcrumjAJhMJk+63e55A+Dg4CA9Pj5+ByHUXElIjHFsaGjo+MTEhGwAVFOOJEmXbDbb+UoC5nK5y3a7/WI+D2ppRg0SbcmbnZ2t6+3tXQEAT4Ughbm5uc5QKKTlQLOCWtCIovg6wzAfVQIwk8m8xbLsJ/oqYgno8/molZWVmzRNP/4gIWVZ/qWzs7M/Go0qVoB6ytFcHYlEmgKBwNyDChiM8Z9LS0vBrq6uv3TXkmuxvvaSm1fE8/wj+T0dc8hK/h2LxfpbW1sXSOX2bBaI83EBVBCEUxzHXQMA2yFBSoIgnKmtrb2Rt68FBvlc2CzkCw0qqtDxePwFt9t95RB2OUoikXiJ47hvCbeqGAZIcsOq76r3QAqC8AzHcVcBgP2XlFRSqdSr1dXVX5eCI/eD+rP5XoDmef5EfX39dwih+82Rch7uG6s5Zyq7m6BN868o5Obmpr+tre1HhFDrPSopxuPxcx6PR9vrFZl3upu1+55Dk1WwkGWRSORYIBD4ASG073GS/AiMscDz/PNNTU3qmYeE2zPviH4FQFK1ogrqgTQ2NuYaHh5WT2CnylESYxzd2Nh4zufzrR8EjkzO+jjkr7hiQaP183q9aHl5+V2WZS+QJ0MzsLpCTE5Onh0YGNDXV4MLLdxM1hvm34Eh1Q47Ozv9Ho/nS4RQnRlOkqTPRkZG3hkdHc0VUa4YbMFUsb9bxZS0VH1xcbHV7/dfpWlaO7gDQDqVSr2RTyOlIKzmouE7S/1+2w/SMG+9Xi81Pz8fZBimZXV1dToYDKrrqn6VAjHXlQ1YKnCK1Zm9TP6psgIpCWflLqugLKWkGdSqf7mQVn0tg6RcyHLgzC42RCgROJZw5ACkSsUam9tYKVvKxQeGUz/gH2s2wnz8M6fVAAAAAElFTkSuQmCC"
  },
  ae1d: function(t, e, i) {},
  ae51: function(t, e, i) {
    t.exports = i.p + "editor-assets/img/t3.8fb8d6c1.svg"
  },
  af90: function(t, e, i) {},
  b285: function(t, e, i) {},
  b4c0: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABQCAYAAADvCdDvAAAHFklEQVR4Xu2dW1MURxTH+8xM7y7LxSuaRFCjbAFKNJXkKUbNGowpX5IX8xGSJx+S6AImVQtVyi1J5cGn5COYx1SZMiBTEJPKg5WKipYI3u94BYTd2Z6Zk5qxQFRgZ+meLpJqXunzP2f+v+2evsFCrqfxbfIf+qEQvQnJljtBSrbMphpALA7SdqG0AQVkoaB4WocCsrB4KCALjIcCooBwOqBe6pwGig5XQEQ7yqmngHAaKDpcARHtKKeeAsJpoOhwBUS0o5x6CgingaLDFRDRjnLqKSCcBooOV0BEO8qpp4BwGig6XAER7SinngLCaaDocAVEtKOcegoIp4GiwxUQ0Y5y6ikgnAaKDldARDvKqaeAcBooOlwBEe0op54Cwmmg6HAFRLSjnHoKCKeBosMVENGOcuopIJwGig5XQEQ7yqmngHAaKDpcARHtKKeeAsJpoOhwBUS0o5x6CgingaLDFRDRjnLqKSCcBooOV0BEO8qpp4BwGig6XAER7SinngLCaaDocAVEtKOcev97IN7/A+H0yA8H144T0EGE1lwaFJybkPw20P86yfzauFaLQYy7JtsB0LU4t04AAWEG5noaNhMCRoCcXE2oq92A+ta7XCIFBuOPn1GWWLqpwLDCm6OD4oCYB94k6OqFV1FYBDXgGmxru1dYFF9r7E9H2LD1Bp9KgGjbccQBOb7/LSlDlgtXoL7tQYDHE9YE//yiiGWjG4QJziKErs2EAEEzbTC0NoddsKdPKbkEW9sfycg1mePB0b1lpbHiRNg5kdmWKCAxhtbGsAv2gTg4BDs7RmTkmsyB3U3LmIZrw86JLsuIAfJXuoxNWKF/gnwgEfcCvNc5FrY50/XxROo1ltNeDTunS9wnYoD0NZUzG1eHXbAPJDveD7sPWzJyTebIdDWu03WyJOycjm4/FAOk9+tK5jgrwi7YB5Js+xsAUEauyRyWua8O0IiGndNG/Y4QINmeVLVGtJKwC0ZXY9H61tNh55mub5ppY4usCQuwq0KA5CStQRBgPJpsOy8TyMOuhkUlOlTJyEmz44PcQPCX5jgrztbKKNhxyKOine2XZOSammGZ6QqG1koZOWnleD8/kD+aVzArWyml4AL2sUTVY3U3bQANi0TpzaoDmhNJtv7DD8RsrGJIFoVeMCFkLDs+uGz34VEZubwceHRvlMWK62Tko7oxCtsP8g1ZmE5rbIe1mThEC7toamhI7gyegk9/dsLONTVcdR9YyTS3QkY+Zru3iz/svMXVQ9BML2ZorZdRMBLMRnd0nJWRa2q625uqBUfOtvsTB4eW7uwY4QIia8HkGeQAeVCUbL8iC4isDUX/eVBDqtHTkGyx5w3kyJE9+idL1m8ievjDlb8glLypOHHsy0qDRqQsdr0tk9iOzgHvOecNZKyvqTwqabuEOMSl9dFTAC2ujB6CmNZY18QmYuihn+94z2Mx+3rpru+GuYBYXalaWceaFI3H8MHBizJg+COIxL05f7gaun8GPv+JzRsImukShla1LIOo5EMpyzxQB+iGvnfl+ee6MBarb7sw6eW8hizs/SbBHLtMChBvuHp08bSs6e5od9OymISzj0nvssCuliW/vz9vIMNmumSxxN5hO3gvvrPjmhT43nje07ARiICbKgEKRkNjka2HzkzfvS64h2R/25/QDF1O7zA0vOnQc68nW7IBno+7CZrNyxlm13ALBRRgOe1W8Uett6c3LwgIHttXzKgh5B5XkJpdICOxZPtQkLa8bbyZVe44qwPNpbxageK9odiInvHWHvMCgt7XI/WmamStXL0iR8bcC+UfyzmuRTNVwVCTsqvrr6t0fRi2H7r+IrzAPQTN/a8w1FcFoi+gEY0aj2GLnKmuf4QQH6+RcY3Jt8Z2HErj/S/2jsDTXjTTMaZZtTI2Ef2C0UG6OnsWEuGfnSMSIH2pGiZpz8p7vJyr3SiZ5fZloB6CPalqJuGIdrJjUXDvQrLzhoCOlldC9lCFYFuR9787C0BmvBeQF8iEmaowJI6tqGMucvfSORnrDjzZsIhN6OuJ7eb1IS/ZgA0md3Vnaz5nIaPmV8tjSKVNA72hauQJDMp4kV8207FVZKKGoJz9qqevjvxrqlmB4IlUKbMwIe1F5808DO0WbHt+Xh7wg1dQM+/qay43XgM0/Ks9U8OwARlyPHIeWubeIJ0RiP8Sx2y1jD8vmCqYwhhsfbanU5DDBTT21xt9mWqZ03eiE5dS6zy8+0MmX6kvAcGTzXE2mknIhOGdBkYgNjDTNDDfAxTyezyyR8+VVyWkfmGxoSEF93LQC+LPAfFveReVrpPxdx7PZlSaRUrvD8A7T7efw/rxhyktk5DaM/JMcWd61ikg+HvjEuaStdLWGt5yw9VYZM3YQNjrDe84NjceqQIdImEBn0nXZvpwfNfLq/G5avgXfqUHUrsr3mAAAAAASUVORK5CYII="
  },
  b62f: function(t, e, i) {},
  bafb: function(t, e, i) {},
  bc11: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , s = t._self._c || e;
      return s("div", {
        staticClass: "vip-bg-height"
      }, [s("div", {
        staticClass: "vip-bg"
      }, [s("div", {
        staticClass: "title"
      }, [t._v(t._s(t.title))]), s("div", {
        staticClass: "flex flex-center w-100 flex-center mt-30"
      }, t._l(t.titleChecks, (function(e, a) {
          return s("div", {
            key: a,
            class: "flex flex-start item-center " + (a > 0 ? "ml-30" : "")
          }, [s("img", {
            attrs: {
              src: i("354d"),
              alt: ""
            }
          }), s("div", {
            staticClass: "fo-14 ml-8 fo-gold"
          }, [t._v(t._s(e))])])
        }
      )), 0)])])
    }
      , a = []
      , n = {
      props: ["title"],
      data() {
        return {
          TITLE: this.title,
          titleChecks: ["商业保障 版权素材", "正规发票 报销无忧", "模型任用 高清渲染", "专属客服 快速响应"]
        }
      },
      watch: {
        title(t) {
          this.TITLE = t
        }
      }
    }
      , r = n
      , o = (i("d531"),
      i("2877"))
      , c = Object(o["a"])(r, s, a, !1, null, "6ecebf92", null);
    e["default"] = c.exports
  },
  bd03: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return t.showTipsFor("resizeTip") && !t.tmpHideResizeTip ? i("div", {
        staticClass: "tips"
      }, [i("div", {
        staticClass: "h-line",
        staticStyle: {
          width: "300px",
          top: "330px",
          right: "30px"
        }
      }), i("div", {
        staticClass: "v-line",
        staticStyle: {
          height: "23px",
          right: "330px",
          top: "330px"
        }
      }), i("div", {
        staticClass: "v-line",
        staticStyle: {
          height: "8px",
          right: "30px",
          top: "330px"
        }
      }), i("div", {
        staticClass: "r-line",
        staticStyle: {
          width: "42px",
          height: "42px",
          top: "337px",
          right: "9px",
          "pointer-events": "none"
        }
      }), i("div", {
        staticClass: "card"
      }, [i("p", {
        staticClass: "title"
      }, [t._v("编辑可修改尺寸和材质")]), i("a-button", {
        staticClass: "ok",
        attrs: {
          type: "link"
        },
        on: {
          click: t.IKnow
        }
      }, [t._v("知道了")])], 1)]) : t._e()
    }
      , a = []
      , n = i("3357")
      , r = {
      mixins: [n["a"]],
      data() {
        return {
          tmpHideResizeTip: !1
        }
      },
      methods: {
        IKnow() {
          this.hideTipsFor("resizeTip")
        },
        tmpHide() {
          this.tmpHideResizeTip = !0
        }
      }
    }
      , o = r
      , c = (i("9892"),
      i("2877"))
      , d = Object(c["a"])(o, s, a, !1, null, "6f7bfe65", null);
    e["default"] = d.exports
  },
  bdb8: function(t, e, i) {
    "use strict";
    i.r(e);
    i("ddb0");
    var s = i("750b")
      , a = i("7c20")
      , n = i("1151")
      , r = i("dad9")
      , o = i("f160")
      , c = i("4794")
      , d = i("3ccf")
      , l = i("365c");
    i("bf605");
    e["default"] = Object(s["b"])({
      setup(t, e) {
        const i = Object(s["i"])({
          pageSize: 12,
          currentPage: 1,
          keyword: "",
          category: ""
        })
          , u = e.vuex.mapState(["queries"])
          , {loading: m, data: h, refetch: p} = Object(d["c"])(l["getTempList"], {
          variables: i
        })
          , [v] = Object(d["b"])(l["addTempCollection"]);
        Object(s["k"])(Object.keys(u.queries.value).map(t=>()=>u.queries.value[t]), ()=>{
            const {keyword: t="", category: e=""} = u.queries.value;
            i.currentPage = 1,
              i.keyword = t,
              i.category = e
          }
        ),
          Object(s["k"])(Object.keys(i).map(t=>()=>i[t]), ()=>{
              p({
                variables: i
              })
            }
            , {
              lazy: !0
            });
        const g = Object(s["a"])(()=>{
            var t;
            return (null === (t = h.value) || void 0 === t ? void 0 : t.data) || []
          }
        )
          , y = Object(s["a"])(()=>{
            var t;
            return (null === (t = h.value) || void 0 === t ? void 0 : t.count) || 10
          }
        )
          , A = Object(s["a"])(()=>{
            var t;
            return 0 === (null === (t = h.value) || void 0 === t ? void 0 : t.count)
          }
        );
        return ()=>Object(s["c"])("div", {
          class: "tempalte-list"
        }, [Object(s["c"])(n["default"], {
          on: {
            change: t=>{
              i.category = t
            }
          }
        }), Object(s["c"])(a["default"]), A.value ? Object(s["c"])(c["a"]) : Object(s["c"])("div", {
          class: "list-body"
        }, [Object(s["c"])("div", {
          class: "list-container"
        }, [Object(s["c"])("a-spin", {
          attrs: {
            spinning: m.value
          }
        }, [Object(s["c"])("div", {
          class: "container flex item-center flex-wrap"
        }, [g.value.map((t,a)=>Object(s["c"])("div", {
          class: "good-content",
          key: a
        }, [Object(s["c"])(r["default"], {
          on: {
            collect: s=>{
              v({
                variables: {
                  type_id: s
                },
                update() {
                  let s = "收藏成功";
                  t.like_id && (s = "取消收藏"),
                    e.root.$message.success(s),
                    p({
                      variables: i
                    })
                }
              })
            }
            ,
            search: t=>{
              e.router.push({
                path: "/templates",
                query: {
                  keyword: t
                }
              })
            }
          },
          attrs: {
            good: t
          }
        })]))])])]), Object(s["c"])(o["a"], {
          attrs: {
            total: y.value
          },
          on: {
            change: t=>{
              i.currentPage = t
            }
          }
        })])])
      }
    })
  },
  bf605: function(t, e, i) {},
  bfae: function(t, e, i) {},
  c3fa: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwCAYAAABXAvmHAAACd0lEQVRoQ+2YT6hNURSHv58YiJBigMhAmDARZkpMjAjFROTJ4DEgfzKQASkRAwzkMRNJegO9gZDB6xm8MlLCQJGUgSSilKWtfWt33zn33HfOPvd42ntyOnevs9fvW2vt3d1LTPChCa6fBNB0BmvLgJm5tbcABgxKcs/oo06AY8Ber3hA0vno6qGePWBm24EzbYKPSxqMDRE9A2a2FrgBTG4T+wvYJel5TIioAGa2GLgLzMgR+RnYJulDLIhoAGY2y4tfVCDuFbBT0vcYEFEAzGwKcBNY7UX9AJ4B6/37MLAGcHZuPAH6Jf2uChEL4CywNRBzAFgGuKcbV4D3wLnAJsrJVBnAzPYBRwJhFyRdN7ODIYCky2Z2FOgLbCufTJUAzGyjj25L031JJ9xLDsAk4GpQWpVPpqoAj4EFXv0osEeSE5UJ4H+fBtwGlvrvXkgKy29c26IqwC1gFfAW2CHpS8t7VgaCufnAPWA20CjATGAFMCrpZxi6TgA+E/OAdcBTSR/HFfbAuFIGOjktAigruP27BJAXyZSBLmsslVAqoS5LJc8slVAqoVRCFSOQSqhiAMecQma20LdF3L22T9KnMj5i/ZUo0pMFsB847EVflHStJEBP1skCGHOXLQkwFxgAproWo6R3JdfpqKc2gDJis74pKsUEECvSZY/jlIGUgYIIlNnEu4G/3TXgkaT+uqNc0N1wfVXXAXTjlKQ7oX3WHlgCPAiMHgKvG4JwDeINge/Nkl52BHCTZnYJ2NSQ6Dy3Q5IOtU9m3sjMbDpw+h+CGAJOSvrWFUDLyMyWAyuBOQ1l4yswIulNnv/a7sS9Ak4AvYr0f1tCfwA+DU9Ak12mMgAAAABJRU5ErkJggg=="
  },
  c775: function(t, e, i) {},
  cda7: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = i("750b")
      , a = i("3bdd");
    i("62d2");
    e["default"] = Object(s["b"])({
      setup(t, e) {
        const i = e.vuex.mapGetters("profile", ["isLogged"]);
        return Object(s["f"])(()=>{
            if (i.isLogged.value) {
              const t = e.route.query.redirectUrl || e.route.query.redirect_url || "/";
              window.location.href = t
            }
          }
        ),
          ()=>Object(s["c"])("div", {
            class: "login-page-wrapper flex item-center flex-center"
          }, [Object(s["c"])("div", {
            class: "bxh-contain"
          }, [Object(s["c"])("div", {
            class: "bxh-logo text-center"
          }, [Object(s["c"])("img", {
            attrs: {
              src: "//yun.baoxiaohe.com/user-materials/0dc60e3b-9b26-4e6e-aba1-8f0780befa5b.png",
              alt: ""
            }
          })]), Object(s["c"])("div", {
            class: "login-container mt-40"
          }, [Object(s["c"])(a["default"], {
            attrs: {
              isPage: !0
            }
          })])])])
      }
    })
  },
  ce2f: function(t, e, i) {
    "use strict";
    i.r(e);
    var s = function() {
      var t = this
        , e = t.$createElement
        , i = t._self._c || e;
      return i("div", [t._v(" login "), i("canvas", {
        attrs: {
          id: "canvas"
        }
      }), i("button", {
        on: {
          click: t.ok
        }
      }, [t._v("检查是否登陆了")]), i("button", {
        on: {
          click: t.ok2
        }
      }, [t._v("调用某个业务接口")]), i("router-link", {
        attrs: {
          to: "/"
        }
      }, [t._v(" 首页 ")]), i("router-link", {
        attrs: {
          to: "/hello"
        }
      }, [t._v(" hello ")]), i("router-link", {
        attrs: {
          to: "/editor"
        }
      }, [t._v(" editor ")])], 1)
    }
      , a = []
      , n = i("d055")
      , r = i.n(n)
      , o = {
      data() {
        return {
          ticket: ""
        }
      },
      mounted() {
        this.$http.get("/api/v2/users/wxlogincode").then(t=>{
            const {data: e} = t
              , {url: i, ticket: s} = e;
            this.ticket = s;
            const a = document.getElementById("canvas");
            r.a.toCanvas(a, i, (function(t) {}
            ))
          }
        )
      },
      methods: {
        ok() {
          this.$http.get("/api/v2/users/wxloginstatus", {
            platform: "pc",
            ticket: this.ticket
          }).then(t=>{
              alert(t.msg)
            }
          )
        },
        ok2() {
          this.$http.get("/api/v2/tags/").then(t=>{}
          )
        }
      }
    }
      , c = o
      , d = i("2877")
      , l = Object(d["a"])(c, s, a, !1, null, null, null);
    e["default"] = l.exports
  },
  d15f: function(t, e, i) {
    t.exports = i.p + "editor-assets/img/true.a2cb1e92.svg"
  },
  d531: function(t, e, i) {
    "use strict";
    var s = i("5bec")
      , a = i.n(s);
    a.a
  },
  d778: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACgAAAAoCAYAAACM/rhtAAAHaklEQVRYR+2Ye2wURRjAZ2Znd++uFaiUgo+28VoKFLQoRSuJSjVNoQaM2l5UsIoWK0hiNMZn0CoxauIbK9ZWCRcj2FYTNVaQIJoQX4WqRaSH51m0YNJDKIG9u73dnTFz3m7mtnvtHfYP//D+upn55pvffI+ZbxYCACD4D/8Y3P+A/8ZB41kwYd2RkZHi3NzcBRDCcwEAOZTSgKIo/ZMnTw5lsvjJkye9OTk5F0EIZwEAFErp0dOnT++bMmXK4eR8mk5POkDY09Mj1tbWrkYI3QEAuNhJAaW0JxqNrs/JyfnBaVxRlPlut3sDhLAuDcD3hJC3d+zY0V5XV6cBAEaB2gETFtM0rRpj/AYAoDQDC1FCyBOCIDzNyxqG8RhC6MkMYzyo6/rdoijutluUB0zAGYaxFiH0EgAAZwBniRBC/H6/v5l1NDY2tiGEGrOZDwDQCSH3CYLwOg9pAppwTQihNrtiSmmfYRgfEkIOUkqjoihWIYTuAQBM4WUJIZ2sjRDy2XSMEEJaNU37BkLoRgjNEQThOgjhJfa1DMO4C2P8lgnJwBBrRCKRy91uNzOxyE0Kqaq6zuVyfZbss46kgYGBgrKysg4I4dKxLEUp3X7o0KE7Z8+ePczJJWItFovVyrK8EQDg5cbi0Wj0ao/H8zXrSwA2NDTAzs7O7wAA1o4opd+FQqFlpaWlx9MBtLS04PXr16d1J3P7hg0bmltaWvR0OoLB4Nler/djCOGlnEyfz+e7tKuriyYAdV1vEARhGycwFAgELrPt2nGNBQsWwN7e3q0Qwht5AUrp+wsXLrx53759aY8QUz4QCEwvKyv7FgBwntlnGMZNGOOuBCAh5CMI4bXmYCwWa3S73VszDfLOzk5XfX39DgjhIjaHUvpVd3d3rc/ni2WqIxqN3uJyubaY8pTSTxBCy+HAwMBZs2bNYvHhSg4eqaysvCCTnfOL9/T0eGpqataxvp07d75WV1cXyRSOyTFP7N279zfOirFAIFAAFUWp9Hg8vZxpOzDGa7JRPlGyuq5vEgShydQXiUQWwlgstkyW5Y/MTl3XHxJF8UWHRceKpXQFR1ZzNE27H2P8nLm2qqrLoaqqKyRJesfs1DRtjSRJHfYjYaKs5KDH2lw8Hm8SRXGTKROPx1cyCy6RZflTzoKPi6L4TLI9bgZOELh5xT6CMX6Ks+BSePz48Qvz8vL6uezZjhBaNgZgJm7LRIbfWwKQEMLOwyXmwIkTJy6Cixcvxrt37/4DADAjOaAGg8HSmTNn/pllHGZjzFExGwwGzy0pKfkFACAnFf1ZXV1dxAQFwzBeRwjdxWVyK8b4XtuKE+3uFEhd118RBIHd74kfIaSNtROA4XC4JD8//2f2PzmuRyKRKq7Oc4LLFtgp0xN9rG70eDzfcBWUcezYsfJp06b9mgBkQrqudwiCcDsXiz92d3df7vP54g6FZLZwplo7JKsBpPr6+q8hhBWcBzdjjFeztgW4f//+/Hnz5rFkKeDM/KYgCGsdEmYiAM0S7w2EkHU4AwCG+/v7L6yoqPgrBZA1IpGIz+12v8vHnqZp6yRJYtU1DzUhgJqmPYAxfpZfj93JHo8nUVeOAmQWtV83LF7j8fitsizz1Q6bmy1kinuZTlEUN/NPAsMw2jHGzGOWbsvFJrHf73etXLnyc1t9prFTXZbl7n+R2Ragqqo3SJLENmwmJauAvmxvb69rbm5W+TVGAbIdHThwIH/OnDlfJJ+JVuxqmrZakiSrJMrCijzcdZIkvcdX7pTSn/v6+q6qrKwcses0S/5R2TU4OFhYXFzMngDF3I5osph4IUNLpuhVVbU+ee9bzwpKaSgUCi0uLS1lF4M9bP6pqLl4TLHu4cOHiwoLCz+DEJbwA4SQTR0dHfc2NzcbNtC0zXg8vkYUxVe59ZjsH8PDw9XTp09nD/hRcGaSpAVkAsFg8Byv17sdQljOr84eQ0eOHFlRWFjI3JL2x94727Ztexoh9JBN6PdwOHxNQUHBoMMxZiUhb0ET2B6joK+vL2/+/PndEMIrbYsEFUW5MTc39ycnwj179uQsWrRoC4TwetvmfhkaGlpaVFSU7tNHShabFjR1jIpHNtDW1iY1NTW9iRBaYYNRWB0ny3IX33/06NHzZ8yY8YH97Usp7T148ODyuXPnHhvLcjyM+XgfZTmuw4LWNO1hjDH7pJGyMULIy36//5FVq1Zp0Wj0CpfLxTLVupUSPqP0w127dt1WU1OjZALHpvBwjpZzglQUZYnH4/EDAPJsrvuBUvotQuhO+6cTXdefr6qqepR7jDkmBacvMW63XsaQ4XDYO3Xq1PchhPPGyWQ1FoutdbvdbEPmb7zqKCUGM4ZKarfk2VOztrZ24xgfioZOnTrlmzRpkvVqTHO4p73nneIvbTY7uZv1RaPRm2RZfgpCeEFSxiCEbA0EAg+Wl5eHz8Ry9iRx8tJ4lk3ZSENDA2ptbS2WZTlvcHBwsKKiwv5NJ6OYs4Oks+CYR45NiVOlbF/njOCckuRMLekUFomTxUHheLApU/4GFSTyj9rh69MAAAAASUVORK5CYII="
  },
  d7af: function(t, e, i) {},
  d885: function(t, e, i) {
    "use strict";
    var s = i("a28b")
      , a = i.n(s);
    a.a
  },
  d89e: function(t, e, i) {},
  d8d8: function(t, e, i) {},
  dad9: function(t, e, i) {
    "use strict";
    i.r(e);
    i("1276");
    var s = i("750b")
      , a = i("ed08");
    i("8d5d");
    const n = i("5613")
      , r = i("7a71")
      , o = i("d778")
      , c = i("ab5c");
    e["default"] = Object(s["b"])({
      props: {
        good: {
          type: [Object, Object],
          default: ()=>({})
        }
      },
      setup(t, e) {
        const i = Object(s["j"])(!1)
          , d = ()=>{
            e.router.push({
              path: "/design",
              query: {
                id: t.good.project_id,
                type: "preview",
                mid: t.good.id
              }
            })
          }
          , l = ()=>{
            e.router.push({
              path: "details",
              query: {
                id: t.good.id
              }
            })
          }
        ;
        return ()=>{
          var u, m, h, p, v;
          return Object(s["c"])("div", {
            class: "good-container " + (i.value ? "good-container__active" : ""),
            on: {
              mousemove: ()=>{
                i.value || (i.value = !0)
              }
              ,
              mouseleave: ()=>{
                i.value && (i.value = !1)
              }
            }
          }, [Object(s["c"])("transition", {
            attrs: {
              name: "el-zoom-in-top"
            }
          }, [i.value ? Object(s["c"])("div", {
            class: "preview flex flex-between item-center"
          }, [Object(s["c"])("img", {
            attrs: {
              src: n,
              alt: ""
            },
            on: {
              click: ()=>{
                l()
              }
            }
          }), Object(s["c"])("img", {
            attrs: {
              src: (null === (u = t.good) || void 0 === u ? void 0 : u.like_id) ? c : o,
              alt: ""
            },
            on: {
              click: ()=>{
                e.emit("collect", t.good.id)
              }
            }
          })]) : ""]), Object(s["c"])("div", {
            class: "image-container"
          }, [Object(s["c"])("img", {
            directives: [{
              name: "show",
              value: !i.value
            }],
            on: {
              click: ()=>d()
            },
            attrs: {
              src: Object(a["F"])((null === (m = t.good) || void 0 === m ? void 0 : m.image) || (null === (h = t.good) || void 0 === h ? void 0 : h.mode_image), 240, 240),
              draggable: "false",
              alt: ""
            }
          }), Object(s["c"])("img", {
            directives: [{
              name: "show",
              value: i.value
            }],
            on: {
              click: ()=>d()
            },
            attrs: {
              src: Object(a["F"])(null === (p = t.good) || void 0 === p ? void 0 : p.knife_image, 240, 240, 60, "|imageslim"),
              draggable: "false",
              alt: ""
            }
          })]), Object(s["c"])("div", {
            class: "title",
            on: {
              click: ()=>d()
            }
          }, [t.good.title, i.value ? Object(s["c"])("a-tooltip", {
            attrs: {
              placement: "top",
              title: "商用"
            }
          }, [Object(s["c"])("img", {
            class: "ml-4",
            attrs: {
              src: r,
              alt: ""
            }
          })]) : ""]), Object(s["c"])("transition", {
            attrs: {
              name: "fade"
            }
          }, [Object(s["c"])("div", {
            class: "overflow",
            directives: [{
              name: "show",
              value: i.value
            }]
          }, [Object(s["c"])("div", {
            class: "id",
            on: {
              click: ()=>d()
            }
          }, ["ID: ", t.good.id]), Object(s["c"])("div", {
            class: "flex item-center flex-wrap"
          }, [null === (v = t.good.keywords) || void 0 === v ? void 0 : v.split(",").map((t,i)=>Object(s["c"])("div", {
            class: "content",
            key: i,
            on: {
              click: ()=>e.emit("search", t)
            }
          }, [t]))])])])])
        }
      }
    })
  },
  e027: function(t, e) {
    t.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAIAAACR5s1WAAAACXBIWXMAAAsTAAALEwEAmpwYAAAF8WlUWHRYTUw6Y29tLmFkb2JlLnhtcAAAAAAAPD94cGFja2V0IGJlZ2luPSLvu78iIGlkPSJXNU0wTXBDZWhpSHpyZVN6TlRjemtjOWQiPz4gPHg6eG1wbWV0YSB4bWxuczp4PSJhZG9iZTpuczptZXRhLyIgeDp4bXB0az0iQWRvYmUgWE1QIENvcmUgNS42LWMxNDggNzkuMTY0MDM2LCAyMDE5LzA4LzEzLTAxOjA2OjU3ICAgICAgICAiPiA8cmRmOlJERiB4bWxuczpyZGY9Imh0dHA6Ly93d3cudzMub3JnLzE5OTkvMDIvMjItcmRmLXN5bnRheC1ucyMiPiA8cmRmOkRlc2NyaXB0aW9uIHJkZjphYm91dD0iIiB4bWxuczp4bXA9Imh0dHA6Ly9ucy5hZG9iZS5jb20veGFwLzEuMC8iIHhtbG5zOnhtcE1NPSJodHRwOi8vbnMuYWRvYmUuY29tL3hhcC8xLjAvbW0vIiB4bWxuczpzdEV2dD0iaHR0cDovL25zLmFkb2JlLmNvbS94YXAvMS4wL3NUeXBlL1Jlc291cmNlRXZlbnQjIiB4bWxuczpkYz0iaHR0cDovL3B1cmwub3JnL2RjL2VsZW1lbnRzLzEuMS8iIHhtbG5zOnBob3Rvc2hvcD0iaHR0cDovL25zLmFkb2JlLmNvbS9waG90b3Nob3AvMS4wLyIgeG1wOkNyZWF0b3JUb29sPSJBZG9iZSBQaG90b3Nob3AgMjEuMCAoV2luZG93cykiIHhtcDpDcmVhdGVEYXRlPSIyMDIwLTAxLTE5VDE1OjEwOjI0KzA4OjAwIiB4bXA6TWV0YWRhdGFEYXRlPSIyMDIwLTAxLTE5VDE1OjEwOjI0KzA4OjAwIiB4bXA6TW9kaWZ5RGF0ZT0iMjAyMC0wMS0xOVQxNToxMDoyNCswODowMCIgeG1wTU06SW5zdGFuY2VJRD0ieG1wLmlpZDo1MDM5MTFlOC1kZmYyLTYzNDYtODYxZi1lMjhmMWFkYTE4NzAiIHhtcE1NOkRvY3VtZW50SUQ9ImFkb2JlOmRvY2lkOnBob3Rvc2hvcDo4ODMzNDA1Ni04ZGYwLWIxNGUtYmVjMi03M2M1ZDI5ZmNmZjgiIHhtcE1NOk9yaWdpbmFsRG9jdW1lbnRJRD0ieG1wLmRpZDo3YTc5YjU5Yy02YmNmLTYyNDEtOTNlYS0xNzViYWQ2NDBlNGEiIGRjOmZvcm1hdD0iaW1hZ2UvcG5nIiBwaG90b3Nob3A6Q29sb3JNb2RlPSIzIiBwaG90b3Nob3A6SUNDUHJvZmlsZT0ic1JHQiBJRUM2MTk2Ni0yLjEiPiA8eG1wTU06SGlzdG9yeT4gPHJkZjpTZXE+IDxyZGY6bGkgc3RFdnQ6YWN0aW9uPSJjcmVhdGVkIiBzdEV2dDppbnN0YW5jZUlEPSJ4bXAuaWlkOjdhNzliNTljLTZiY2YtNjI0MS05M2VhLTE3NWJhZDY0MGU0YSIgc3RFdnQ6d2hlbj0iMjAyMC0wMS0xOVQxNToxMDoyNCswODowMCIgc3RFdnQ6c29mdHdhcmVBZ2VudD0iQWRvYmUgUGhvdG9zaG9wIDIxLjAgKFdpbmRvd3MpIi8+IDxyZGY6bGkgc3RFdnQ6YWN0aW9uPSJzYXZlZCIgc3RFdnQ6aW5zdGFuY2VJRD0ieG1wLmlpZDo1MDM5MTFlOC1kZmYyLTYzNDYtODYxZi1lMjhmMWFkYTE4NzAiIHN0RXZ0OndoZW49IjIwMjAtMDEtMTlUMTU6MTA6MjQrMDg6MDAiIHN0RXZ0OnNvZnR3YXJlQWdlbnQ9IkFkb2JlIFBob3Rvc2hvcCAyMS4wIChXaW5kb3dzKSIgc3RFdnQ6Y2hhbmdlZD0iLyIvPiA8L3JkZjpTZXE+IDwveG1wTU06SGlzdG9yeT4gPC9yZGY6RGVzY3JpcHRpb24+IDwvcmRmOlJERj4gPC94OnhtcG1ldGE+IDw/eHBhY2tldCBlbmQ9InIiPz7jtxXVAAACLUlEQVRYw82Yv0vDQBTH799TJ0UHXRz0D3BRBwcF8bcgrSCCYNGpg4hapDg4dOtiBwsiNZRIW2oUSxHb1NIWvyWhTZP0csld9MJ3aJrLu09y7957eaTj83iqF84+7nfKF0uF2Lx6OPGyCeEHTvEnLmGAX5uEcVympkS1xIyyN5Jb9RSGYTBuEQaBJ1ssnLLM7RRuZHkxNIhys7Jeigeb3ioYgakgEHiZU8o2P4EhmKKsjjvEdSU9llsTRWAIBmGWFeL4PSl2eqtg3BsCsOERGHK+D2LzA+Gr4LouNv8g1r0g0BM9/dS6X/oQQnajr31rh0BI+UsCQ704ZkIEjok8wqR9CLhJGHMsvJ5k6+qzXlwpng8bY3hoFyKi3QgnWC7E9PaP8aC1VgOZ1nUY8pwJwZgbgxEYx1w+MizfdiGEu6ST4LGm0t2ToAwJlSCnlyaVLcotACAoh/6RAAIAQVnmGWVHGWJ5MAIIAATlIWXEkXart5vfLX2/fBkGAQQAMp7bGHZ5Wtltddo9u9G3hHACCABk2A6GZvMHtpzr5OAkgADgsRzJ6gOFg5/AXA66Y8IrU19ZVw4hBKZjem5RV46rSloIgblFWYKVK4cQAjNYMYZtCgcPgRm22ROYKwcngZnAuo6mJdhrVCsHJ8FAKvdV1IAj/plSG9pdNcNJMFDUSFHeyVLoSlHyy/LxI8VnoCwfxLK0BmRpksjSLpKlcSZLC1GiZiq9rYxaGeJsK/8Cp89K679edQYAAAAASUVORK5CYII="
  },
  e15f: function(t, e, i) {},
  e7cb: function(t, e, i) {},
  ea0c: function(t, e, i) {},
  f5de: function(t, e, i) {}
}]);
